{
    "parent_survey": {
        "meta": {
            "company": "Sterling Holidays Resort",
            "created_by": "5757ace0cc38e39671947a27",
            "id": "or8bQMxdBvrOqgW9JJ1",
            "total_resp": 184,
            "unit_name": "Manali, White Mist"
        },
        "responses": [
            {
                "avg_rating": 74.64,
                "cid": "9ca9c60c-587c-4848-8002-31708b5dcbf1",
                "label": "How likely, on a scale of 0 to 10, are you to recommend our services to a friend or colleague?",
                "options_count": {
                    "10": 1
                },
                "timed": {
                    "2016-06-17 18:43:43": {
                        "pretty": "10",
                        "raw": "a_10"
                    }
                },
                "timed_agg": {
                    "2016-06-17": 10.0
                }
            },
            {
                "avg_rating": {
                    "a_1": 3.46,
                    "a_2": 3.91,
                    "a_3": 3.84,
                    "a_4": 3.49,
                    "a_5": 3.96
                },
                "options_code": {
                    "a_1": "Cleanliness",
                    "a_2": "Room Service",
                    "a_3": "Value For Money",
                    "a_4": "Ambience",
                    "a_5": "Amenities"
                }
            }
        ],
        "sentiment": {
            "tripadvisor": {
                "Negative": 13,
                "Neutral": 39,
                "Positive": 132,
                "options_count": {
                    "\nAfter a long journey from Shimla , we are hoping to reach a friendly , neat , spacious and cozy resort and we were not disappointed when we reached Sterling resort Manali. The Soups , punjabi dishes served were very tasty and hot , a welcome hot intake in contrast to the cold outside. The rooms are neat, spacious and cool. We could see the snowy white mountain tops and musical sound of the water early morning . Manali is beautiful and added with it if we reserve in Sterling it will be two mangoes in one throw. Please visit to take the experience.\n": "Positive",
                    "\nAlthough under renovation & with no amenties to offer, our stay at White Mist was made memorable beocause of the lavish family room offered to us & also exceptional service by the staff at the hotel. Also, the veg food was delicious.Mr. Gaurav, the manager was a delight to deal with & extremely co operative. Once the place is renovated & ready it would give the other hotles which have pathetic service a real run for its money!!Cheers!!\n": "Positive",
                    "\nAmazing stay & food .Had been to manali with my friends and stayed in white mist for 2 days , it was most memorable trip.This hotel had its own brand and hospitality was too good.Staffs were very helpful and friendly .\n": "Positive",
                    "\nAs a sterling holiday Time share member, we were provided rooms in a different block. The location of the hotel is very good, but rooms are average. Even the heaters provided were of very poor quality. It produced more light than heat. The room was lit as if a halogen lamp was lit. Appartment were provided only with a microwave oven and not gas as per the agreement. Overall it was a average room.\n": "Neutral",
                    "\nBasic Facilities Food very goodNo parking areaStaff : can be more courteous. Non availability of any leaders to guide.No play / recreation area for kids.Rooms : clean and good wood work. (Could be designed better) \n": "Neutral",
                    "\nBeing a Sterling member, this was a natural choice for me. Keeping aside the reservation woes that I have to go through every time to make a booking, he resort itself is just about average.It is located a little away from the main Manali area which was okay since it kept the place quiet. Half the resort was being renovated. The day we reached, the elevator was not working but started once we had climbed four flights of stairs.There was no Wi-Fi & the members' package excluded breakfast. The room was good & overlooked the mountains. We struggled with the all-weather AC a bit as it did not seem to be warming.The spa amenity was unavailable as it was undergoing renovation. In a nutshell, if I was looking only for a place to sleep, this would do. But if I was looking for an all-round resort, this place would not pass the test.\n": "Neutral",
                    "\nBig and spacious room. Good for Family. We went with our kids and I find that kids enjoyed more in the room because of good space and big beds. Best part is the location of the hotel, not in the main room of Manali, which keeps you away from the rush of visitors.\n": "Positive",
                    "\nCourteous staff.. Heaters and microwave not powerful.. Dont go for outside activities co-ordinated by hotel staff- They have their margins.. Good looking hotel.. but no lift.. Very good view.. Bathrooms need furnishing..\n": "Neutral",
                    "\nDate: 13 Aug 2010For an exotic honey moon trip we visited Himachal Pradesh. As part of the the Honeymoon, we stayed in Sterling Resorts Manali for 4 days. This is the best hotel we have ever seen in terms of quality of food, amenities, service quality and gesture.\n": "Positive",
                    "\nEXCELLENT place to stay and we were lucky enough to get the experience of First Snowfall of the season on 29 th November-2012 @ Solan Valley. Food quality is good at Sterling white Mist, staff are polite and co-operative. The resort needs renovation and the heater provided in the rooms needs to be changed as it is not capable of November temperature.\n": "Positive",
                    "\nExcellent service, very warm and hospitable staff...we had a great time! Kids have a place to play even when it s sunny, rainy, cold or dark outside...the kids zone rocks!!there s an evening activity where guests get to meet each other....so u can make new friends too!!\n": "Positive",
                    "\nFirst impression is the most lasting one, it is said. This truly applies to the Sterling White Mist Resort at Manali which I, my hubby & my 14-year old daughter visited during the Deepavali week of November 2012. We reached on 10th night and found the entire resort lit up with fairy lights. What followed was five days of sheer fun & frolic with various activities which the resort offered. Great accommodation, superb views (especially to see the snow-clad peaks from the dining hall window while having your breakfast & lunch), delicious food but the most praiseworthy was the warm, friendly, courteous, cooperative, honest, ever-smiling and ever-helpful staff, pampering us to the hilt and taking care about our minutest requirements. The word \"NO\" does not appear in their dictionary at all, whether it was the security guard at the entrance, the gardener watering the plants, the housekeeping or kitchen staff, the front desk executives or the Resort Manager himself. This speaks volumes about the level of training imparted to the staff. Deepavali was the most exciting day, as right from \"puja\" in the morning to the games & lighting fire crackers in the evening to the buffet spread at night, everything was so magical that we felt we were transported into another land. The resort's travel desk is a great help even if you do not take any packages from them. White Mist had a nice recreation room, a cosy bar and well-maintained garden & lawns. We occupied a clean duplex room, with partial kitchen and the room was fitted with the best of amenities. Although we couldn't take advantage of the spa, I am sure even that could have been a good experience. Thank you for such a memorable stay and a wonderful experience which we are going to cherish for long time to come. As I have aptly titled, it is truly a \"HOME AWAY FROM HOME!\"\n": "Positive",
                    "\nFirst of all when I reached Manali, I was unable to find this property as there are no sign boards. But once when we reached this property, it was very comfortable stay. Though the rooms need an urgent makeover, the atmosphere here was very good. The staff in this hotel are very helpful. they have a perfect traveldesk managed by Nishant. They took care of all our sight seeing needs.Even their restaurant is managed by good staff especially Roshan. He can guide you to whatever you like and will go out of the way to help you. we celebrated my wife's birthday at this hotel, I was unable to get a cake and Roshan was there to help us out. We had a wonderfull time. My 2 daughters enjoyed their vacation a lot. They are again planning to go to Manali in next vacation.Thank You Team White Mist. You made our vacations a wonderful time.\n": "Positive",
                    "\nGood Service - They were prompt in responding to our needComfortable Room - Upholstry and linen were well keptGreat View - The view from the balcony was phenomenolAverage Food - I did not find much variety in their buffet menuWell located - Easy to get there, and well connected from places aroundAs we were checking out, they took our feedback seriously and spent time discussing my remarks with me.Mr. Aditya from Sterling resorts was also helpful in finding us an accomodation in Chandigarh on the way back to Delhi.\n": "Positive",
                    "\nGot a chance to stay at this Resort .Nice Resort. Location is good. Market just 15 min away from hotel. Very professional staff in all Manali.Superb restaurant & lobby. Food is awesome (but quite expensive). Special thanks to Mr. Hemant (F& B). Very humble and helpful. Overall stay was nice & very silent place. Highly recommended for Honeymooners.\n": "Positive",
                    "\nGreat resort...well renovated...they arranged for the local travel and other facilities within no time...had fun activities arranged...nice in house food but a bit expensive....the choice is completely yours if you want to have food from the resort or from the local dhaba just outside the resort...although i should mention that the food served in the resort was great...nice view(take a room facing the cliffs)...they tend to take some fees for early check in but not much....the travel desk helps you a lot to plan the various sightseeing activities....there are inhouse games like pool table table tennis,chess,and other board games and also the motion sensing video games...I can go on and on with the review but in short a great experience and will definitely return here....\n": "Positive",
                    "\nHave the sterling timeshare and get 6 nights at this resort every year. The place is evolving and improving the services. The rooms are outdated but the restaurant has been done up quite well. Service has improved and unlike last time the garden is maintained well. Nice to see the resort taking initiatives like organizing the evening snacks pary for the inhouse guests, see a merchandize store which has opened up (though they didnot have anything of our interest). Took the food package it was a great deal. The garden is maintained well. This is sbit off from the main city and going to city sometimes is a problem unless you are fine doing haggling with the autos\n": "Positive",
                    "\nHi all - This is Sachin from BHEL - I stayed in Resort in Oct 2014, Resort is good one part is the under renovation and one block is operating. only concern was Resort Policy - when i called up Resort they said pets are not allowed and i made a spl. arrangement for my pet at Delhi itself. This is the first time i was travelling without my Tiger ( pet) .It was surprising to me that when i was their in the Resort i saw security guard was taking one dog to inside the Resort. When i asked him who is this he said Ye GM Sahab Ka Hai. Also mentioned this dog stay in hotel only last 1 year .My Concern is that if your GM can keep pets than why not us. i was ready to pay some nominal charges but mr. Aditya Refused completely - Its not allowed and Pets are not allowed. I think this is not fair.\n": "Positive",
                    "\nHi,I have a special corner for this resort in my heart and It was my first visit after my marriage. The resort is located little far from Mall road.The property is big with different room as per your requirement. I visited in winter so they provided us with Heaters.. The rooms were really cozy and service was excellent.. On Food part.. I must say we stuck to their menu during entire trip and made a point not to eat outside... In the basement, you have the indoor games and disc.. No swimming Pool.. The place was really calm as it is on the outskirts...For Manali outing, They have the customised tour plan as per your need...I had a great experience there as we saw one of the heaviest snowfall of 4 days and explored the resort.\n": "Positive",
                    "\nHotel is over all good, in the sense, location, view from te room, size of the room but has to maintain its equipments in the rooms properly, the cocept of the hotel needs to be followed dilligently. the two rooms we had occupied, were provided with different operating equipments.\n": "Neutral",
                    "\nHotel needs total refurbishment specially bathrooms and furniture. Well located surrounded by beutifull mountain ranges. Needs to improve on heating system as well as lighting. We shivered whole night with the kids.\n": "Neutral",
                    "\nHotel was amazing with most courteous and helpful staff....food was superb...they also have inhouse concierge facility to assist the guests with regards to sightseeing options, which we utilized as well..Rajkumari and Aditya were very helpful through out our stay and Mr Ishai was the most welcoming personality....we were there to celebrate my birthday and hotel's little little genuine efforts and thoughtful ideas made our trip a most memorable one :)....\n": "Positive",
                    "\nI booked Sterling Manali through cleartrip. There was an offer going on where i got 40% off on 4 day stay. The total outlay was 13140 for 4 days including breakfast in Junior Suite. The resort is around 3 KM from bus stop. Taxi follows union rates of 150 Rs and auto charges 50 INR. It's one of the few branded resorts in Manali and hence reaching there is not a problem at all. The resort is built on a considerable free space and has two separate buildings - one for restaurant, reception, entertainment area; another for dwelling. There is an open lawn and a small garden. Suites are cozy and has a dry kitchen (coffe maker, microwave and fridge along with basic utensils). The TV is basic and has a Tata Sky connection. Bath room is clean and well maintained with good supply of linen rolls. Room service is prompt and staff always greets with smiling face. The best part is the restaurant. With large glass windows, wooden furnitures and high roof, it's look is distinctly colonial.The breakfast has south indian, continental and north indian menu and i found the preparations fresh and tasty. The non-veg items looked to be expensive and did not have any trout fish dishes. Through those large windows I could clearly see the manali peaks while having food. I did not avail adventure tours (rafting, biking, para gliding, treks) or evening programs conducted by Sterling. Overall it was a very good experience and I would like to stay there again. Though honestly had i not got the offer, I would have considered the rates (4700 / day) high and opted out.\n": "Positive",
                    "\nI chose to stay as this was one of the RCI Gold Crown resort. I did not have great expectations. However surprisingly it provided overall very good experience. Location was good and maintained.I got spacious room with big balcony with wonderful valley view. Food and dining hospitality was good; thanks to Hemant - restaurant in charge. He was personally taking care of all clients. I liked it. Other amenities were OK and staff need to improve a bit. Stay could be better if had additional information about all activities and facilities provided. Overall, we enjoyed our stay.\n": "Neutral",
                    "\nI had booked 2 studio rooms at Sterling White Mist Manali for 5 nights during Oct 2013 through RCI. The resort's location, upkeep, food, service and staff is excellent. I have stayed at many other hotels and resorts in the past but did not find such a great staff anywhere. The service is almost instant and you will find someone caring for you everywhere in the resort. The food is very nice and the restaurant staff is again ready for anything you ask for. They never say NO to anything. Overall it was one of the best experiences of life. I will recommend this property to anyone planning to stay in Manali. If you have your own vehicle to roam around, all the more suitable. If the resort can setup a lift in the new block also, will add lot of convenience to the old age visitors.\n": "Positive",
                    "\nI had booked this place through RCI. And I'm repenting my decision to visit this hotel. This hotel is very big but is look like budgeted hotel. I had visited this place with my family includes my 3 yr old daughter. This hotel look good from exterior but interiors are pathetic. Floor was broken, tiles was broken, no light in hall except one small bulb. (can you imagine I spend one night). Poor heating facility (I had given brandy to my family). Room's were stinking. Geyser was pathetic. Bathroom look like Hospital. And I had paid astronomical high price to book this hotel when it was available at as low as 1700 rs. per day. (visit this link to confirm http://www.travelguru.com/hotels/India/manali/manali-white-mist-a-sterling-holiday-resort-00002424?checkInDate=03-03-2014&checkOutDate=06-03-2014&numRooms=1&rooms%5b0%5d.adult=2&currencyCode=INR&ci=ta&utm_source=52016&utm_medium=mt-pl&utm_campaign=dom-hotels-cr&utm_content=B60)Next day when conditions didn't improve I had called RCI for same and showed my digress. RCI connected to hotel. Mean time I had booked another hotel and left the hotel. That time Hotel Manager Mr. Rajesh meet me and promise me better room and service. And they actually done really well. In this hotel few room are in better condition. (still avoid it). I had plan for 7 days. out of that 2 days I was Screwed very badly. Next 3 days things was much better. And last 2 days I had avoided this hotel I stayed in another hotel as I don't want to screw my holiday.\n": "Negative",
                    "\nI had travelled to manali with my wife for a holiday and it was my second stay at sterling resort manali nad i liked the location of the hotel it is away from the city with the best views you can get in manali from any hotel ,on one side you get the view of river with snow covered mountains and other side huge mountains with long trees as you are in a forest ...... activities you can also take morning as well as evening walk on the road side as the traffic in that area is very less......... the games conducted by the resorts in the evening are very good to interact with other peoples in hotel . the room service is very good and the food is also very nice........ this hotel also has a travel desk and it is very nice, they conduct daily tours also......... according to me this is the best place in manali\n": "Positive",
                    "\nI have been to various properties of sterling group, but the property at Manali would get the lowest rank among various other properties of the same group .This time things went wrong right from the beginning . The room allotted to us had hint of cigarette smell , which was informed to person showing the room . He bluntly refused that there was nothing of such sort and smoking is not permitted in the room. After some argument they agreed to change the room. The staff at the restaurant was also not upto mark I think it was supposedly a gold crown resort , but off late because of the renovation work in the resort the ratings have gone down No wifi internet . No children play area.Over all a bit disappointed with sterling this time .May once the entire renovation is complete may be the resort can improve its standard Regards\n": "Neutral",
                    "\nI have booked junior suite. Room was nice,neat and clean.location was very good.Food was excellent.\n": "Positive",
                    "\nI love to say something....about this resort.I have discribe amazing experiabce....I realy love to stay this place again and again.....superb experiance amazing hospitality in this resort...I want go that place again and again.....\n": "Positive",
                    "\nI recently stayed in this property in August 15 and found the resort excellently located.The food in the restaurant was awesome specially the Manali Dham Thali.The trout fish tandoori was fresh and delicious.Though the resort was under rennovation the Resort Manager took extra care to make us feel comfortable.The entire staff was very courteous and after a 2 day stay it was worth visiting the resort and looking forward to another visit.\n": "Positive",
                    "\nI recently stayed in this property in August and found the resort excellently located.the service staff were excellent and respond to every minute requirement even during the odd late nite times . we also interacted with the Resort Manager and found him to be very friendly and cordial and he took special care of my family . the stay was really awesome and we would strongly recommend all especially with family to go and stay in this wonderful property which has been recently renovated . regards,Tapas Sahu .\n": "Positive",
                    "\nI recently visited Manali and came away with some great memories of my stay at Sterling Resorts. The place is very scenic and has some lovely views of the mountains. The staff are just amazing and service was unbelievably warm and efficient. The food was delicious and they were eager to give us anything we wanted. At night they had a bonfire in the open garden and had fun activities for the guests. All in all it was a super stay and I would definitely go back some day.\n": "Positive",
                    "\nI stayed at White Mist last week for 3 nights...... It was a grt! experience their. I recommend this hotel. This hotel is around 3 KM from Manali Bus Stand on a good location. I my package Brk Fast was included. Food was Excellent. There are lot of indoor games to play\n": "Positive",
                    "\nI stayed at White Mist, Manali for 5 days. Hotel is far from the city. The views are not that great as you would find in whole of Manali. You would need to hire a taxi every time at an inflated price to go to the city. If you hire any taxi to go places like Solang Valley, Manikaran, they would charge you higher as they have to pick you up from a far off place. You cannot take a walk in the evening outside as it is an isolated place and not safe at all. Food too is okay. I like hill station food and eating at different places, but you have no option for dinner than to eat at the hotel itself. Rooms are not great either. they are small with not so great bedding as you would expect from a hotel of such rating. I would not recommend White Mist if you are planning to visit Manali. Book a hotel which is accessible with good views.\n": "Negative",
                    "\nI stayed for 2 nights. This is a old property, service as well as food is good...They provide only a small room heater that is not sufficient as room size is good. Hotel staff was very much friendly. Mall road is around 4-5 km far away from here, so it has one more negative point this also.\n": "Positive",
                    "\nI stayed here with my family for 6 Nt in room no. 2002 along with my two adult kids 29th April to 5th May 2013.Our room was 1BR type on 3rd floor.Our room was spacious and at good location.From balcony entire mountain view was there.This resort was very good, neat and clean , well maintained,food was also very good.Entire staff were very polite and helpfull,soft spoken.Room service and house keeping were excellent, Bath linen were very soft, Mattress were also of good quality. Overall our experience was very good and enjoyable.Spl thanks to mr. Rajesh - Resort Manager & Mr.D.S.Aditya - Front Desk Manager for their good guidance and help.\n": "Positive",
                    "\nI stayed in a suite here for 2 nights and found the accommodation to be good. The service is good too and so is the food. The suite is large with a sit-out and has views of snow-clad mountains albeit distant and not that great. But location wise there are better placed hotels in Manali, that provide better views and are closer to the city centre. This one is a bit far-off and the approach road has been severely damaged recently. There's no Wi-Fi but there is an Internet cafe which charges Rs 60 for half an hour of surfing which seems expensive! The food too is very expensive, for instance a humble sada dosa costs Rs 165 before taxes! Overall I found the accommodation and service to be good, but if you really want to enjoy Manali choose a scenic locale or a hotel in close proximity to the mall road depending on what you like. This one unfortunately scores low on both these fronts. Also considering that the suite costs Rs 4000 per night before discounts, it might be a tad expensive, and am not aware of the condition of other rooms! They have other facilities like spa, fitness center etc but I didn't try them, who needs them after all with all there is to see and do in Manali. But I did get a call informing me about these facilities on the first day of my stay and these seemed expensive too!\n": "Neutral",
                    "\nI stayed in sterling resort manali in month of April 2104 with my family,my room no was212 nice hospitality shown by Mr Aditya and his team,resort is well wmmaintained .food was awesome. My all credit and special thanks to Mr Hemant FnB manager.security guards was always in position to helps u out. God bless to all sterling family.\n": "Positive",
                    "\nI stayed in the Sterling White Mist in the month of June. Overall we enjoyed our stay. What really makes the difference is the feeling of being truly welcomed by its staffs. Being owner of hotels, I was there for relax break and also in hunt of good employees so was observing and noticing everything The restaurant service is great. Particularly, remarkable praise to Mr Hemant Das (Manager) who couldn’t have been any more helpful and friendly. Surprised at his quality and professionalism, he actually impressed with the level and quality of service. Even though the Hotel was full and extremely busy, he managed all with his ever smile face. A hard working Manager ever seen who have all the credits of making trip enjoyable. Reception and restaurant staffs are very forthcoming available, pleasant and helpful if understandably a little more stressed at times. Rooms are old and need to renovate but has beautiful view. Thank you so much for providing such attentive great care and service Mr. Hemant!\n": "Positive",
                    "\nI stayed there in Jan 2015 with my family. No idea how they treat their direct guests, but the service they offered to us, a sterling vacation member, was terrible. Their wash rooms had no dental kit or comb etc, even when asking for basic stuff like these, got different response from different staff members, one said they don't have any, another said they don't give it to sterling customers, while another said they are given only to select sterling customers based on which package they have taken. Even talking to resort manager didn't help. It was not about the basic stuff, but how you treat your guests. BTW, we had the top paid package from sterling and have got all these basic stuff in their other resorts before. There is a total lack of standard customer experience across their different properties and there have been one or other instances every time.\n": "Negative",
                    "\nI stayed there with my family. Warm welcome to being transported in your room with bag and baggage in a matter of few minutes - a highly effective welcome. Excellent staff, with faultless service. They make sure that your stay is purely comfortable. I loved the small details they take care of without your telling them to do so ! My 9 year old son had his own fun time in the Kids activity room getting all the attention from the staff. The staff who was kept for the game was wonderful.Over all very good hotel for every one.\n": "Positive",
                    "\nI travelled to Manali from 2nd - 5th Jan to celebrate new year with friends and family.We have chosen White Mist-Sterling resorts from make my trip.Since the deal was good so we thought to opt the same.By the time we reached manali we have call the service desk to ask whether they provide can for the hotel which they clearly denied.We took a private cab from bus stand to the hotel which is placed around 5kms from it.After Reaching hotel we requested to see the room but we they ask to wait for 30mins since the room was not clean.By the time we wish to see the hotel and there we came to know that the hotel was quite different as shown in the pictures.Certain cons which i would like to highlight:-1. The hotel as mentioned on sited is not on mall road but far away from it around 5kms.2.Transportation costs around 200rs per side if you wish to mall road or nearby.3,Hotel mentions 80 rooms but have only 33rooms instead.4.There is no facility of Wi-fi as mentioned on websites.5.The staff was not at all helpful in sorting out your queries.6.No generator facility at the night in case of breakdown.7.It seems to be more than a 3star hotel rather than a resort.8.No good restaurants nearby.only option is to have it in hotel only.9.They don't even provide a knife to cut fruits or rather you can say they don't even pay courtesy even to facilitate you. 10.Room cleaning can be done only once and that too as per not your convenience but the time they felt like.Overall a disappointing hotel with a scarcity of many facilities.\n": "Negative",
                    "\nI was allotted to a room where in accessibility was only through stairs,there were no lifts,each n every time have to travel 3 floors down n up....hat water available in bathroom only from 6.30 to 10.30....so after that u need to suffer with chilled water in extremely cold weather...its very bad that geysers are not provided in bathroom....it was very old room for which wooden flooring n painting is done that's it....so bathroom is in pathetic condition with cracked tiles on it....so overall experience i never felt i was staying in a 3 star property....\n": "Neutral",
                    "\nI was given to understand that the Sterling properties in North are better maintained. It is a fact. I was pleasantly surprised by the warm reception an the comfortable stay that was offered when I stayed there in the third week of Apr. Had a wonderful time at the Resort with my Family.\n": "Neutral",
                    "\nI was there on a family holiday. Location was very good with very nice view.I was looking for an accommodation for 4. The room was nicely designed but failed to provide privacy for two as assured while booking.Guests are expected to clean the utensils provided in the kitchenette daily on their own; else have to pay for having them cleaned by the house keeping staff.Very good food and the courteous staff of the restaurant was the highlight of the stay.No provision of Wifi either in the room or the Lobby for people trying to mix pleasure with work\n": "Neutral",
                    "\nI went to the hotel as a part of my summer holidays tour,we went to manali,rothangpass,darjeeling.etc.... so i have to stay in this hotel for 2 days . this hotel has a great view and the rooms are good i didnot sleep well because i got cold there but it is not hotel problem . the room service could have been better. It is somewhat costly not much.but i had a great time there. In one certain morning i didnot get hot water there is some problem it seems and i was disappointed there other than that the trip went great ...\n": "Positive",
                    "\nI went with my family to manali in June'14 and stayed in studio apartment of this premises but the wow feeling was missing at this hotel. The worst part was the availability of hot water which the resort staff told that it will be available only for 2 hours in the morning and 2 hours in the evening.\n": "Negative",
                    "\nI, my wife, my 6 yr old daughter along with my parents visited this resort in the last week of november. It was cold but the staff with their warm behaviour welcomed us n treated us like royalty. Everyone of the staff had a pleasant smile not an artificial one. It was truly a wonderful experience. The rooms n the food was awesome. Highly recommended to all.\n": "Positive",
                    "\nIt is few mins drive from bus station, very clean room and has very good heaters as well. It does have a wonderful view from the room as well. Food also tastes very good. The best part is it is located in a place where there is no much of traffic.\n": "Positive",
                    "\nIt was a fantastic holiday experience in manali while staying in sterling white mist.All the facilities,indoor activities staff and food was very good and the best part is the location of the resort which is far from the meddling crowd and very good for a perfect holiday.Even if you do not want to go out you can still enjoy a lot in the resort it self because of the indoor activities and very friendly behavior of the resort staff.In my opinion its more then a worth a holiday at Sterling white mist Manali.\n": "Positive",
                    "\nIt was a good hotel with a good staff..food was good..staff was well behaved..rooms were clean..view from the corner rooms was good..thanks to the staff for making my anniversary memorable by decorating the room for us..just a single drawback is parking space..but i am sure that will also be solved after the ongoing renovation\n": "Positive",
                    "\nIt was a gr8 Experience staying there.the activities arranged daily in activity area,Lawns,View from the rooms, Staff behavior and most importantly food and the ambience of the hotel are all excellent.i would suggest this hotel to any body coming to Manali.i would also want to tell every body that all the staff here is courteous and a special recognition to Mr Megh.\n": "Positive",
                    "\nIt was a nice stay. rooms are big enough, nice addition was the oven in the room,food both breakfast and dinner was also good. only should improve amenities like playing area for kids etc.overall it was a nice stay.\n": "Positive",
                    "\nIt was an amazing experience to Manali with Sterling Holidays. Excellent co-operation by Mr. Ajay Verma (Sterling-Chandigarh). It was nice climate and good rush in the evening at Mall. Amazing tracking onwards Rohtang Pass.\n": "Positive",
                    "\nIt was our one of the best summer vacation in the resort. Location is preety good but might get lost while to locate it views are good from the rooms if you have mountain facing rooms resort people does some sort of activity every evening for entertainment of guests which is remarkeble. Some of the facilities are good but service needs to be improved so is the food menu. resort is spacious and well spread out with ample of playing space to enjoy with kids or even yourself.\n": "Positive",
                    "\nIt's a one of the best place to stay in Manali, having kind manager and polite staff. Rooms are spacious and good. Located very next to Club Mahindra, little away from city centre but having no issue to transport. Good food. One day found few insects in room but removed by house keeping staff promptly. Charges for laundry, travels (Car Hire) and extra services are reasonable. Small issue with air-condishner which operates on default set temperature. Over all its worth to stay any time as this resort operates with high standard like star category hotel.\n": "Positive",
                    "\nIts a very basic Family Holiday Hotel & not at all recommended for Couples. The hotel needs some major renovation and the rooms facing the parking are an absolute NO. Don't be mislead by the Sterling Brand, its probably one of the least impressive properties they own.\n": "Negative",
                    "\nIts a very good Hotel and service is also good. . Staff and service is very good and assist you well. Its located at a good height and near to some famous Manali locations . Do visit for AMAZING Valley views on all sides. It was comfortable stay for the entire family and food was also great... Would surely visit again\n": "Positive",
                    "\nLocation is very good. Rooms and service is also good. They held some internal activities for enjoyment. Indoor games are also available like Ludo, Chess, Badminton, Table Tenis, Pool..... You can also enjoy dance in their DISCO...........\n": "Positive",
                    "\nManali has become very crowded & congested. With certain improvements on roads, Punjab / Haryana and Delhi people can easily come & go. Sterling resort is away from huzzle / buzzle of the town. Near Mahindra resorts. Comfortable, very good food. Less choice. Good service.Arrangement with taxi is not clear. Guidance counselling for tourist on commercials is not good enough.\n": "Positive",
                    "\nManali in tourist season is overflowing with traffic jams worse than one encounters even in metro cities. However, where sterling scores is over its location, a few kms aways from manali town, at a place called prini, on the manali-naggar highway. The resort is well-planned out with spacious wating area, a nice restaurant and a reasonable well-stocked activity room. The rooms are adequate with stunning views from some of them. The food selection provided in the restaurant was of a good variety, but the quality fluctuated a bit (taste-wise), probably because the chef was a new recruit (just had been employed 10 days previously, we learnt). The prices of the dish were extremely reasonable. The travel desk facilities, were very good, as we expect in Sterling Resorts. The location of the resort ensured that you could easily make day trips to Naggar, Solang valley, Rohtang pass, Vashisht or simply laze about the premises with the good book (borrowed from their library at a nominal cost) or play with your kids from an array of games available in the activity center - badminton, table tennis, carrom, cards, pool, etc.\n": "Positive",
                    "\nManali is a very beautiful place to spend summer vacation. Sterling resort is situated on the bank of a river. We stayed in duplex type of suite. Place is good for a small family. They provided a small kitchen, dinning space and good interior.\n": "Positive",
                    "\nMe and my wife checked in to the White mist in November,2011. Was early for 2 hours than informed before. The beautiful lady at the reception was very much welcoming and had no problems during the stay for 4 days. The house keeping and room service also was very good. The restaurant service and food was exceptionally outstanding. The hotel arranged site seeing trips very well trough a 3rd party. No complaints I highly recommend this place for staying.\n": "Positive",
                    "\nMr Aditya, FoM and his team were very courteous during our last visit during mid May 2016. We are very happy and satisfied with room cleanliness, good food, hospitality, etc. My 11 year old son had found the kid's play area very interesting. We had clicked photos with mountains with glaciers as the background (standing in the first floor balcony of this hotel).\n": "Positive",
                    "\nNice hotel for families. Delicious food. stayed in this hotel in the month of August 2014. Rooms was quite spacious. Service was Excellent. Every staff member and specially the Manager of this hotel is an asset to the organization. worth visiting this place.\n": "Positive",
                    "\nNow a days this resort is under complete renovation and total maintenance.They provide different rooms or near by block which are not so good. It is an average two star hotel with no parking facilities or other activities. No Wi-Fi and entertaining amenities. It become boring. The room services are so good. It is also very far from Mall Road, market and other favourite destinations. So we should very very cautious before booking the rooms. The condition of this hotel is not so well to enjoy our holidays with family now a days.I am the person who is dissatisfied with this booking. The office person should clarify all the details before booking. It is waste of money, time and points. Please be careful friends and Sterling members.\n": "Neutral",
                    "\nOne of the most wonderful family trip at Manali. The Stay at the White mist was Amazing thoroughly loved every moment of our stay . Hospitality was awesome . We loved the food. The kids had wonderful time at the games room. We all had the blast at the DJ nite and the karaoke.The staff really took good care of us and helped us with everything we asked for and guided us for all the sightseeing.The rooms are well taken care by the housekeeping staff. The location of the resort is amazing you get a beautiful view from the garden.All in All i can say we really enjoyed the stay at the Resort, we have already planned our next winter vacation at Manali stay at White Mist.love you guys and see you all soon for the Christmas!! Roshan Tete & Family\n": "Positive",
                    "\nOur stay at White Mist Manali was in the month of Feb 2013. The stay was very good and we would say it is a wonderful resort. Our check-in was at around 3 PM and was very smooth. The food was of excellent quality and we really enjoyed all the breakfast we had during our 3 day stay.The service staff was very helpful and responsive. The only issue we had was the location of the hotel. But other than that, it was a wonderful experience...\n": "Positive",
                    "\nOur stay at White Mist was excellent. The staff are very warm and the service, especially at the restaurant is excellent. The food quality and taste is excellent. The alacarte price is on the expensive side. However they have some moderately priced meals options. Location is good, about 3 kms from the Mall road, with decent views of snow capped mountains. Overall a wonderful trip.\n": "Positive",
                    "\nOur stay during the short period was very comfortable. The rooms were spacious and well cleaned. The food was great in taste. the big balcony was surely an add on.The hospitality of all the staff is also appreciable.\n": "Positive",
                    "\nOur stay in White Mist was great with my son, husband and myself. The food was great with a lot of varieties. The service and staff were excellent and the best thing was everyone was friendly and one is always welcomed with greetings and smiles as one passes from the reception to the lawn or rooms. Its hardly 3 km to the Mall road and would cost 80 by auto or 150 by cab. Keep up the good job Sterling. Thank you\n": "Positive",
                    "\nOur stay was a memorable moments at manali sterling holidays resort. The facilities at the resort is excellent. And staff always obliged to our requests and food tastes good at the restaurant. The view and the location of the resort is beautiful. We thank the resort guys for making our stay at Manali memorable.RegardsPrasanna\n": "Positive",
                    "\nPeaceful location with all the amenities in the near by location. Got a warm welcome from the staff. Rooms are very comfortable. Can be great if WI-fi is also provided. Recommended to stay least once.\n": "Positive",
                    "\nPlace is 3 kms away from the main center but once you reach here...its quiet and peaceful. Mahindra and Sterling - both resorts are adjacent to each other. Service and facilities were limited due to renovation in full swing but otherwise its one of the top class Sterling Resort.Service and staff was is on the toes to make your stay memorable. They have a good team for Paragliding and other activity which one should not miss. Paragliding activity is a risky event and with the professional - a little extra may be worth for a longer flight to enjoy.\n": "Positive",
                    "\nPros1. Splendid view from the garden and also from the room2. Customer service is excellent3. They have game rooms and neatly maintained4. Nice foodCons1. The game room has timings till 9 PM and admin is strict in sending out the inmates. 2. Rooms are cleaned on daily basis without the consultation of inmates\n": "Positive",
                    "\nPros: Staff was soft spoken, activities space available, lobby looks good, staff at front desk is good. There are shops in the vicinity for basic needs and the property is adjacent to Holiday inn.Cons: Room - Post check-in there were hairs on the bed, upon complaint sheets was changed. I was given room towards the road side so sleep quality wasn't good enough. The washroom needs renovation since its a decade old style. Handwash and shower gel was provided. Insufficient charging facility was available in room. The cable network was not working well so all those who wish to watch television for a while might be disappointed. Hot water facility was unavailable during day, however, they were willing to give water in the bucket from outside.Food: Buffet could have been better, all those who like parathas might be disappointed with raw ones. Options of buffet could have been more. Table cloth was dirty in the restaurant. Breakfast starts 7.30 am but in our case it wasn't completely ready upto 8 am. Food menu overpriced as compared to other better hotels in the town. The staff in the restaurant could have been more courteous, soft spoken, willing to serve food even at the time of breakfast. If you order ice cubes in the room then its chargeable. Lift/ Elevator: Wasn't working at the time of cheek-in however from evening started working.Location: Its approx 5 kms from the mall road, one has to wait for sometime at the road for passing by auto rickshaws and taxis fare of which is expensive during season 100 to 400 depends upon your bargain. Travel Desk: The concerned person was not available at the travel desk so a lady (sitting at travel desk) guided us, however, she didn't guide us properly despite apparently knowing everything since we told that we won't be staying for long in the hotel. Exaggerated claim to be a part of esteemed sterling holidays. Very disappointed. I hope management listens !!\n": "Neutral",
                    "\nPros:1. It was a good hotel with good staff.2. Rooms were clean with nice wall decoration.3. View of snow clad mountains from the corner rooms is goodCons:1. No parking space. Your taxi driver will complain if you visit in winter.2. Little remote..away from mall road. 3. Food is costly. Better to try out in mall road itself. 4. No wifi in rooms. You need to come to reception area to get wifi. This is not good considering the stature of hotel.\n": "Neutral",
                    "\nReally good buffet, food and restaurant services, decent rooms and well serviced. Really nice lawns and hospitality. The 2 rooms at the top floor are definitely to grab for, with ultra spacious room space and really good bathing rooms.\n": "Neutral",
                    "\nRoom with a good veiw,reasonably good food, simple breakfast,caring staff,efficient travel desk at a premium.An older type infrastructure less of amenities away from mall road, no wifi,water heaters could be better\n": "Positive",
                    "\nRooms and service are excellent. Good food. Excellent housekeeping. Location is good even though 3 km away from main city. Since the renovation is going on, the garden is not maintained properly. The reception lounge is very spacious. Indoor games are good for time passing. Overall we enjoyed the stay very much.\n": "Positive",
                    "\nSpent 5 days at this property. Splendid almost unparalled views. Staff extremely courteous. Place particularly the bathrooms need complete renovation. The place can also use better quality linen and towels.\n": "Neutral",
                    "\nStay : 25-Oct to 28Oct 2015Pros : Good View rooms available Well maintained rooms. Spacious rooms. Well maintained restaurant. Though the menu does not have that variety ,  bt the chef can provide ur requested dish if the items are available in the kitchen. Cons : The hotel is in the Prini area which is far away from the main manali area.  No local transportation to the main manali area available.  So u vl actually need ur own car or the hotel car for transportation.  There was no activity area and no wifi in the hotel. Reason for the same was  that the hotel was just renovated.  Also during our stay, the lift was not working for two full days. When we and some other customers complained, they said that engineers are working over it and that the same will be in working condition in and hour. Bt till we left the hotel, the same was not working. We had to climb up and down 3 floors everytime. There were also elderly aged people in the hotel who also had to face this lift issues. Bt the reception did not bother to get the lift repaired. Hot water is not available 24*7. Service is not that quick and prompt. U vl have to call atleast twice to get things done.\n": "Neutral",
                    "\nStayed for 2 nights, three days in family room. The room and the amenties were average. They arranged for the paragliding which was good. Food is very good but little expensive.Just note - No swimming in the hotel\n": "Neutral",
                    "\nStayed here in December 2004 and June 2012 as well. It was wonderful to start with and has got only better over the years. The property is sprawling, very well maintained and the pictures uploaded will give you a fair idea. The dining facilities are wholesome with buffets for breakfast, lunch and dinner and are available as an added package. View of the Himalayas from the dining room is to kill for. Service at times was sluggish but with a little nudging got better. Lots of games and activities for children as well as family if you want some leisure and the travel desk is most helpful if you want to venture out. It is situated a bit far from Manali proper in Prini - a small village and the distance could actually work as an advantage, far from the madding crowd. I'll definitely be back with the family..\n": "Positive",
                    "\nStayed in Sterling resorts for 7 days. It was my honeymoon trip. Manali is really beautiful place its not very cold when we went there (Nov) around 12 degree. Hotel service is really good, housekeeping, daily activites and travel desk are really good. They gave a room which has poor hill view from its balcony and they changed immediately on request. Food is also quite nice and plenty of varieties. Well is this the positive side. Only one negative part is the quality of facility. Some places the wooden floor is broken, heater was not working and toilet is not clean either. We enjoyed our stay and had a great trip with sterling. I recommend everyone to visit Manali and i believe Manali is a small remote hilly town and this standard is really appreciable. heard they renovating their resorts which is good news for future tourist.For Honeymooner please go for honeymoon suit which gives you awesome snow covered mountain view. Cheers\n": "Neutral",
                    "\nStayed in Sterling white Mist for 4 days, average place, my room window was cracked and chipped, which made my room very cold , The hotel had provided me a small heater which was not adequate, Only after complaining several times and speaking with resort manager they changed my room heater the 2nd day. The resort on the whole was much colder than other resorts in that area (I had visited Honeymoon Inn,Manali which is much warmer), Room service was excellent. Food was good too..... Chose sterling only if you go in summers, In winter's I would recommend Honeymoon Inn, although smaller in size it is much warmer,is brand new, has better facilities and food there is great. Honeymoon Inn is also Good value for money.\n": "Neutral",
                    "\nStayed in early March 2015, we were treated to heavy snowfall, which was exciting for us, being from the south. The view from the rooms are very beautiful, with the majestic mountains all around. The travel desk did a good job and we were able to see all the scenic spots despite the snowfall. Food is good, but could add more variety. Rooms on the 3rd floor have best view.\n": "Positive",
                    "\nStayed there for 3 nights. room was decent, they provide a small heater not adequate. Food was good. hotel staff was really friendly, my advice you can stay there but don't take cabs from hotel they are over priced\n": "Neutral",
                    "\nStayed there in March 2015. The rooms are spacious and the view from the balcony is indeed breathtaking. The resort itself is situated away from the busy centre of manali which makes it quite and peaceful. The food at the resort is quite a let down. Half the resort is under renovation.. Hopefully, once complete, it would be better.\n": "Neutral",
                    "\nSterling Resorts: Manali: Good treatment, but property going downhill Date: 1 March 2011We booked this hotel for our short stay in Manali mainly based on its rating on TripAdvisor. And it is a nice place; however a lot needs to be improved, really. We reached the resort around 9 in the night as it was snowing and driving was a bit difficult. There weren’t many boards giving directions on how to reach the resort. Upon reaching the place we found out there was no valet parking available. The porch was not really big enough to keep the snow away. There were no door mats to keep the dirt and muck away from the reception / lobby area.On checking in we saw both the rooms were done differently. Beds, mattresses, etc. all were different. The rooms were facing the lobby which was facing outside world. Snow and water from above was all dripping in the lobby area. As a result we had dirt marks all across the room. Also during the night snow used to slide from the room and parts of it used to hit our room door wetting whole place. On top of all this the heaters provided in the rooms were not efficient enough. There was no provision of connecting another heater. Hot water was available in the morning from 7-10 and in the evening from 4-6 and not 24 hours.The room service was good. They managed to serve nice hot food in the room even at these temperatures.They had just one restaurant but food was good.We happened to visit the spa and it was amazing. Very nice clean and well kept. The temperature inside was perfect.All in all things can get better.\n": "Neutral",
                    "\nSterling Resorts: Manali: Good treatment, but property needs renovationDate: July 2011We booked this hotel for our short stay in Manali mainly based on the name \"Sterling\" we have heard from friends... And it is a nice place to look from outside and a lot needs to be improved inside, really.Hot water was available in the morning from 7-10 and in the evening from 4-6 and not 24 hours.The room service was very good. The quality of the room is not worth the money you pay. The wardrobes were very old, 10+ years old I would think. The kitchen is too tiny and old as well. The bathrooms smelled, so we had to leave the exhaust \"on\" all the time. They need to renovate this property.\n": "Neutral",
                    "\nSterling has renovated the property recently and amenities in the resort are at par with the best in the range. The staffs are friendly and they accommodated me with early check-in. They have a good restaurant and here again the kitchen staff accommodated my son with extra ice cream and chocolate milk. Highly recommended for all group of travelers.\n": "Positive",
                    "\nSterling is located in Village Pirni on the outskirts of beautiful Manali. We were offered this accommodation by a friend of ours who is member of Sterling. We were given accommodation in a spacious room with kitchenette. The room was very clean and it's one side opening to a small lawn. There is a room service and food is very nice. The staff is courteous. Overall a nice place to stay if you have your own vehicle as place is 3-4 Kms from the Mall.\n": "Positive",
                    "\nSterling resort Manali is a well maintained and peaceful property. The view of the snow cladded hills from the resort is very beautiful. Very co-operative staff, neat & clean rooms and the food quality is also very good. Altogether we had a comfortable and memorable stay here and would like to visit again....\n": "Positive",
                    "\nSterling resort is very nice resort. It provides good rooms, good food. It's location is mind-blowing. I [--] to know about it from my 1 friend. Now whenever or whereever i will go out of station i will go to sterling resort only. I really liked it.\n": "Positive",
                    "\nSterling resort manali is where we stayed during our vacation in November2012. The rooms are very comfortable, we had used a duplex room. The restaurant serves fresh hot food, including south Indian , North Indian and continental. The resort has a good games room, wherein activities like carroms, TT, karaoke, Wii, ps2 etc are there.\n": "Positive",
                    "\nSterlings resorts is situated about 3 kms from manali and gives good view of the snow peaks and lovely scenary. Its room service is not excellent but good. But if you eat in the restaurant their service is great. I loved their food. The room had the view of the lovely apple trees and mountain ranges. We stayed in the service apartments and it had its own kitchen. So we could make our own breakfast, lunch and dinner for my 18 month old kid. It was a boon i tell you...The best that i liked about the hotel was the buffet breakfast. The least that i liked about hotel was the room service. Food quality was great. Even my kid had some of their food and it suited her.\n": "Positive",
                    "\nSuper chilled rooms with poor bathroom. Warm water is not always available. Blankets are not at all good. South Indian breakfast most of the days. Only good thing is the activity area to relax in the evening.\n": "Negative",
                    "\nThe 3 star Sterling resorts in Manali, very old built, frankly could not live up to my expectations. We were 2 couples. I advice you to take journey thru Volvo nt car ,as the total journey was tedious.Very first thing that amused me in hotel was there was no Valet Parking. Although the hotel looked good from the outside, it did not have a lift, neither were the rooms all that good. The last thing you would want after a tiring journey, is smelling bathrooms. The bathrooms seriously need some furnishing. One thing very good though were the views.Take left side rooms with a view to mountains not valley.And there are some parking facing rooms, avoid them.There was no lift in the hotel, so try keep your booking to 1st floor only. Hot water was available in the morning from 7-10 and in the evening from 4-6 and not 24 hours. The quality of the room is not worth the money you pay. Old wardrobe's and bad bathrooms perhaps attributed to it. Facilities were decent with a small kitchen inside the room, which makes it worth while for families with small children as the same will be useful making milk, tea, home food etc. We happened to visit the spa and it was nice. Very nice clean and well kept. Good playing activities. The resort has good playing activities, somethings children would definitely enjoy.We did Water-Rafting too in Kulu, which is 1 hour drive from the Resort. Dont go for outside activities co-ordinated by hotel staff- They have their margins.There was only 1 restaurant but was quite good. Nice breakfasts and food.It is a decent family resort with facilities suiting them. But if you are a couple, or a bunch of college friends you can perhaps find better places. Surely the resort does not live up to it's brand Sterling's name. It's perhaps one of their not so good one's. Not worth the money for my liking.The only silver lining of the whole package was the cheap rates provided by our tour operator.We booked on internet from Antilog Vacations which r very budget & the best for manali tours.They suggested us that Apple country resort was a better option but we somehow stuck to this hotel.Anyways , we r contented that we got cheaper rates than the fellow travellers\n": "Neutral",
                    "\nThe Resort has two building with lot of play area for children and activity area. main building is having very traditional look and the other one look like apartment building.The location of the hotel is 3 kilometers away from main city and markets even though very good since it is located between mountains on both the sides. The view from this hotel is very panoramic and quite view worthy. We had our room with balcony over the play ground. we had direct view of mountains from our balcony. We got snow very next day when we reached at Manali, our room was warm to stay in comfortably. The room we had was spacious enough to accommodate four of us. The room service was quick and on the dot. The Breakfast was excellent which compromised the lunch and diner quality. The service was very polite and social. The hotel staff was very courteous and ready to help at any length also they have all types of arrangements for every need of their customers. We had gone to Manali for first time and we were not having any idea what places we visit? The courtesy shown by the hotel reception and Manager and guided us with all details of places to visit with total arrangements. The hotel also have various food plans rates, to suit your budget and taste.Cost wise the hotel is in medium group providing some where 3 star facility, but the hotel is maintained very well. In the indoor activity area they have lovey games so one can not feel bored. The Sterling Resort where we stayed for 7 days is definitely we recommend to our friend and is the place to keep visiting again and again.Thank you very much to The Sterling resort to give us a memorable leisure time.\n": "Positive",
                    "\nThe best part of this hotel was when we opened the window curtains early morning. A breathtaking view of the himalayas stole our gaze. That was all i needed for my moneys worth!! There is a well maintained nice lawn, it helped us soak some sun when it was too cold. They have some recreation too like table tennis and all that. The food was average. The hotel staff arranged for all our local touring at competitive rates, esp. the trip to Rohtang pass for which the majority of people end up being overcharged.\n": "Positive",
                    "\nThe hotel is idelaly perched at a very comfortable and less crowded areas of manali. Beautiful room, very good food.The activities and play areas are an asset to unwind.The staff is extremely good.Can hire a cab easily for all areas nearby.\n": "Positive",
                    "\nThe hotel is located a little towards to outskirts from the hustle of Manali. The property is big and the rooms are well equiped with decent bathrooms. The rooms offer a breathtaking view of the Himalayas. The hotel has lots of indoor activities.The hotel staff is extremely polite and helpful. They will arrange all outdoor adventure activities and transportation for you at reasonable rates. Their tie ups for adventure sports like para gliding and river rafting are safe and recommended. The staff is very helpful and efficient.Overall, one of the best hotels in Manali, very highly recommended.\n": "Positive",
                    "\nThe hotel is pretty old in terms of the interiors as can be seen from the condition of the paint and furniture. The location could have been better but still is not inconvenient and is close to the mall road.The food is ok nothing great and so is the service here.The rooms are spacious but it makes it all the more uncomfortable as Manali cold is terrible specially when the hotel does not have proper heating system.Lastly, do not use the hotels travel desk. It is way too overpriced. It is better to go to the main market and negotiate with the touts roaming around all over the place.\n": "Neutral",
                    "\nThe hotel is situated on the Naggar road. Though the location of the hotel is little far from the main city (mall road etc) but the hotel is nice. The staff is very friendly & food is good. If you are lucky, you will get a room with view of snow mountains.There is no parking and no lawn or garden area.\n": "Positive",
                    "\nThe hotel like all other Hill area hotels is marred with terrible service nad very avg food...people don't just come to the hills for adventure sports...sometimes we also wish to just relax and enjoy the company of your friends...the hotels is a lovely location and organizes lovely day trip...food felt quite average and the quality of rooms is not up the the sterling name...however...overall...it's fine for a couple days stay.\n": "Neutral",
                    "\nThe location is very good The resort needs renovation and the heater provided in the rooms needs to be changed. It's a little out of the main town, but its fun to travel in the buses which you get just outside the hotel.\n": "Neutral",
                    "\nThe place was nice with a beautiful view. Food in the restaurant was also good. It's a little out of the main town, but its fun to travel in the local buses which you get just outside the hotel, else a taxi is just a call away.\n": "Positive",
                    "\nThe resort is nicely placed on the left bank. It has nice interiors, pretty good rooms, lip smacking menu on its recentlystarted masti menu system is simpley the best. after the whole day of sight seeing , the resort has wonderful gettogether in tne evening in form of DJ, bon fire etc.\n": "Positive",
                    "\nThe resort was superb. It had all the facilities in it. The food also tastes good but it is very costly. The room service was very quick. The staff were also very courteous. We stayed in a studio apartment and it was very spacious. Each room also had a space for kitchen in it. The location of the resort is also good. This is surely a good choice to in Manali.\n": "Positive",
                    "\nThe rooms are so welcoming and cozy. Superb designed rooms. As a fact, a family of four can easily be accommodated in a Guest room. The Guest rooms had a diwan near the view window, which can be used as a bed for one person.\n": "Positive",
                    "\nThis being my third visit to White Mist Manali, explains a lot about the resort. Standing up to Sterling hospitality this resort leaves no stone unturned to make to make your stay a memorable one. Even though, this time around, the main building was undergoing renovations, you would never realize that until you walked to the parking which presently doubled up as a debris collection ground, but without compromising on the parking.facility. The staff is friendly and courteous, the check in quite swift. The rooms are good, I visited this resort after 13 years this time and should admit that the decor has kept up with the times. The sheets and towels are impeccably spotless, the toilets clean and smelling good. The restaurant, presently a make-shift arrangement due to the renovations was decent and the choice of food is varied, right from South Indian to Continental to Local, its all available. The holiday activities room is equipped with games (though I think they were lesser as compared to my last visit) With all the positives in it favour, Sterling Resorts have changed their full-fledged kitchens in to dry kitchens in the rooms (a few plates, cutlery, bowls, a microwave oven, a coffee heating pot, etc.). The very reason one prefers Sterling was the facility of having a fully-equipped kitchen so you could have home food even in a distant land (you just cant eat out every day). This is the probable cause for my kids to getting a stomach infection and still we didn't have a choice (though not because of their restaurant, but again you cant keep eating in their restaurant too), with fever temperature reaching 103 we called the front desk if any medical help could be obtained, the support offered was inadequate (a doctor on call would charge Rs. 1500) and the nearest hospital was a Mission hospital at Mall Road.Luckily the medications we were carrying helped and the kids were fine the next day. Overall the experience was a nice one, but hey this could've been expected from any good hotel, WHY CHOOSE STERLING THEN?\n": "Positive",
                    "\nThis is a very good sterling property in Manali. Eventhough it is little in the interior it is well knit and excellent . From the room you can enjoy the mountains with white snow background and for nature lovers this is a treat to watch . The restuarant is very good and serve excellent food. Winter time is worth visiting as you can see the snow laden mountains and scenic beauty . It is a treat to go out and enjoy . But if the snow is very heavy you get struck indoors . Also there is problem of flights getting cancelled or rescheduled. All these are worth the risk for the enjoyment you get.\n": "Positive",
                    "\nThis is by far one of the best resorts in Manali. Spacious rooms with balcony, great view of the hills behind, lovely food. Everything that one expects from a hotel on a holiday. The courteous staff took extra pains to make our stay comfortable. Will certainly come back.\n": "Positive",
                    "\nThis is not one of Sterling Hotels better properties in India. It is on the wrong side of the Beas river, the main attraction of the hill station. You hear the constant roar of the gorgeous river but have to travel a couple of Kms through dreadful roads and rickety bridges before you get to the river front. The staff as with all Sterling hotels is most courteous , they do their best to please. The food is good though the buffet could do with greater variety. We were there during 'off tourist ' season when the hotel tends to let out rooms on big discount to groups, this makes for a noisy and crowded environment. But Manali is superb , still one of the better hill stations and one does not mind the little let downs.\n": "Neutral",
                    "\nThis is not the 1st time I stayed at this resort but this time I highly appreciate well managed service. The staffs were warm, friendly and accommodating, particular praise to Mr. Hemant Das( F & B Manager) who was amazing and very attentive. He was MOD that day and checking everyone multiple times to ensure of having enjoyable stay. I found him 1 MAN SHOW” entirely.I will gladly come back to white mist in future.Thank U for being our Best Man Hemant and wishing all the best for u.\n": "Positive",
                    "\nThis resort can be described as a paradise for Honeymooners. The rooms are equipped with modern amenities. The view of the snow capped mountains is breathtaking from the balconies. The food is excellent and the travel desk is helpful in arrangement of sight seeing trips\n": "Positive",
                    "\nThis resort is wonderful n its staff too. Its food is very good n chef too. I m muslim n they made chicken haram(jhakta) but they specially bring hallal chicken for us n serve. Staff member understandes us n gives service best this resort is awesome\n": "Positive",
                    "\nThis summer we had visited manali and Booked in advanced at white mist.rooms are in very bad shape and needed a major renovation.Ambience within room is pathetic,very old furniture and if you pull door's for wardrobe whole wardrobe comes on you.It was raining and room heater which was provided was not in working condition.House Keeping staff is also not good.Bathroom and toilet is in worst condition a dingy toilet.If you are healthy person you can't seat on toilet seat.Room main door was full of cracks and it was see through from both the side's.Flooring to ceiling each and every thing is not likable.In-short at the end of the day you will not like to go to your room.I think it is 2* property.Restaurant is good with minimum menu and they serve HALAL food.\n": "Neutral",
                    "\nThis was my first experience for Sterling resorts, over all i was pleasantly surprised. The rooms were good, clean and well maintained. There were a host of facilities such as carrom, TT, pool etc. The staff was very courteous and friendly. They guided us very well to various sight seeing places, and went out of the way to arrange a trip for us to Rohtang. Cons: The place is located quite far from the main market, and it was difficult to find. Tough we had our own vehicle so the distance was not an issue, but other wise finding transport to and fro the market area migh be difficult.\n": "Positive",
                    "\nThough the resort is under maintainance most of the rooms have excellent view. Very peaceful location and 180 degree view of snow clad mountains. Staff is extremely well trained and special mention needs to restaurant staff. Even being a non member I would prefer to stay here whenever in Manali.\n": "Positive",
                    "\nUnforgettable days at Manali. Thoroughly enjoyed the trek at Hampta Pass with Nishant and Bharti. The first time experience of rafting was awesome and the paragliding was thrilling.Specially the evenings were full of entertainment, Highlighting the DJ nite n Karaoke super amazing conducted by Prikshit.. The tym spent here was truly wonderful. Family tym is the best tym!!!I will rate the resort completely 5*.\n": "Positive",
                    "\nVery Comfortable Stay at this hotel in Manali and has very comfortable rooms. There are two blocks , one which is the hotel in which the non Sterling members stay where we did and the other block which is more like the service apartment which has an adjoining kitchen is mostly given to the Sterling Members. I would insist that you request the hotel for a Mountain view room from where the sunrise view is quite spectacular. The food of the restaurant's hotel is quite good especially the Mughlai food. Service of the hotel was also good as expected by Sterling resorts. For looking around in Manali, the travel desk at the basement will help for the travel plans and vehicle arrangements. We managed to stay in October , 2013 and that was a good time to see Manali as after some time Rohtang Paas was shut down due to bad weather conditions up there, also being a off time for manali , you will find the place less crowded.In all a great hotel with a very affordable price tag.\n": "Positive",
                    "\nVery bad food. Hot chocolate was very bad. Hot water instead was tastier. Rooms were clean but the shower area needs attention. The chef for sure needs more training to provide better quality food. On new year eve they block the main entrance and make you go through the basement. Lift 90% of the time does not work. With 2 children and room given on the 2nd floor you are sure for a decent workout after a good day's sightseeing. Overall my experience was bad and will not visit Sterling Manali AGAIN.\n": "Negative",
                    "\nVery beautiful hotel, nice food, great room service supplemented by nice weather in Manali makes this a very much recommended hotel in Manali. There's a nice shopping area in Manali and this hotel caters to the need of its people, by being so well placed near the city yet very calm n serene.\n": "Positive",
                    "\nVery good place and courteous staff. I checked in late in evening but food was still served hot. Heater is complimentary. You can also buy wollen caps and socks over the reception counter. Its in the market so traveling locally is not an issue. You could avail of local taxi for tourist from the hotel too\n": "Positive",
                    "\nVery nice hotel to stay 2 km way from main mall area. quite and clam. Decent room and service. They have very good food. They are kitchen in the room if you wish to cook. The sit out from the room is very good.\n": "Positive",
                    "\nWe booked this hotel as sterling member. But surprise, we found this hotel is not as per standard of Sterling. No Garden. No play area. No Kitchenette. Just rooms & Restaurant like hotel and that's all. Room was good. Food was good. But no feeling of vacation.\n": "Neutral",
                    "\nWe had a family trip to Manali and had a good time. This hotel was quite reasonable when it comes to sty arrangements & food. Facilities were decent with a small kitchen inside the room, which makes it worth while for families with small children as the same will be useful making milk, tea, home food etc. The service quality was average. The location is good overlooking to a mountain and next to a apple orchard. This hotel is also accessible to the manali town.\n": "Neutral",
                    "\nWe had a great time at Sterling White Mist. The place is super. Very close to the bush bush of Manali yet away. The rooms are comfortable and team of staff friendly. Overall a fantastic experience. Definitely recommended for stay.\n": "Positive",
                    "\nWe had a memorable stay at Sterling White Mist from 11 November to 14 November. This was our second visit to the resort. We had visited it when it was Himalayan Resort. The puja in the morning of Deepavali and the get together in the evening made it all the more special for us and made it feel like truly a home away from home. The kitchenette is well equipped and the ambience is serene and pleasant.The thoughtful quote in our room by Jane AustenTO SIT IN THE SHADE ON A FINE DAY AND LOOK UPON THE VERDANT GREEN HILLS IS THE MOST PERFECT REFRESHMENT.stayed with us even after our return back to Delhi.Thank You. Ms Lakshmi Srinivas\n": "Positive",
                    "\nWe had selected this hotel after reading reviews but in actual it was disappointing. We had booked hotel through booking.com. We had reached late in the evening there and also conveyed our late arrival to manager over phone in advance but very surprised when he had offered room in another hotel or regret for the booking. We had no option but to leave our family there and seen different resort and wasted 2-3 hours and finally agreed to take room in nearby resort for one day after he assured to allot room in the same hotel next day. Mr. Aditya (Manager front office) was very helpful and personally look after all our needs. Now talk about hotel.. Lobby and restaurant area was good but rooms were furnished with old upholstery and particularly bathroom needs immediate renovation as it spoil the image of this hotel. Room service was also poor and offered only upto 10.30 pm. One more positive thing in this hotel is its lawn area and play room for small children.\n": "Positive",
                    "\nWe have been to Manali many times but this time we had a great experience. We stayed at Sterling Holidays Resort refereed by one of our friend. It was an amazing experience. I got my share of personalize service. Starting from front desk to travel desk was a prompt service. Big room size, clean linen, and beautiful view. Travel desk is managed by Nishant, smart, intelligent young experienced boy. He took us to places which were unexplored by tourist.  Restaurant was managed by Hemant, who took care of our requirement very well.Property is managed by Resort Manager Mr. Rajesh, who is full of etiquette, humble and interesting was, he remembers each and every guest of his by name and there need. Sterling Holiday Resort Manali - \"Prefect Example of Great Team work\".\n": "Positive",
                    "\nWe have booked this hotel for 3 days. They arranged the vehicle from station to station. Every one in the hotel are helping minded. We don't know Hindi, so they arranged a driver he can speak Tamil and English well. It was really a very good experience for us.My kid enjoyed a lot in the park area. It was so neat and cleaned.\n": "Positive",
                    "\nWe made to Kullu and Manali... Yes... one of the best places to view the Himalayas from.We stayed at Sterling, White Mist at Manali. The staff were very courteous and the resort was well stacked with entertainment for the family.We had Video games , carrom, Air-hockey and other board games that kept the entire family busy after hectic tours around and rest in the room.The restaurant was awesome, with fantastic food.... we went with North Indian food and enjoyed every dish that was served.Do go for the package for Breakfast + Dinner so that one can save money with the deal for the entire family.We requested for a bonfire to be arranged and the staff were kind enough to arrange one for us.We went in End September - early October and the climate was just right... not too cold and cooler than the rest of the country ( India)...\n": "Positive",
                    "\nWe reached early in the morning at 5:30 am. Our check in time was 10:00am. We were given a room at 6:30 am. The staff was very helpful in this regard.The room is spacious, toilets were clean, linen were clean. the room was facing the valley.The food served in the restaurant is amazing. The travel desk also go out of their way to help us for sightseeing and vehicle arrangement.We checked in on 29th December morning and were to leave on 30th evening. As check out was in the evening we were charged for two days (quite rightfully). We went to the bustand and found out that our bus was cancelled due to heavy snowfall. We contacted the hotel and they allowed us to stay that night as we had paid for the same. The next morning due to heavy snowfall we could not leave Manali. We left only at 9:00pm on December 31st. For this extra day we were not charged at all. This was one of the best act by any hotel i have ever seen. They totally understtod our situation and did not charge us at all.\n": "Positive",
                    "\nWe reached on the 25th Dec -Christmas day. Rooms are very very basic with the interiors almost falling apart...they look atleast 20 years old...although it was Christmas nothing was planned in the resort except for a cake delivered in the room...Positives: Location of the resort is good. Staff and room service is fast..nice buffet breakfast and dinner...Negatives: No hot water facility through out the day. Heaters given in the rooms are just not adequate for -3 degrees temp - just one bajaj heater which can cover for just 4-5 mtrs range..so its just like outside temp even in the room which is very uncomfortable...Rooms are very very basic and bathrooms are below average..restaurant is nice but its not value for money..no indoor or outdoor activities planned even when during an occasion like Christmas..Overall its no comparison with Club Mahindra or any other luxury resorts.. Recommended if you are looking for an average holiday only...!!!\n": "Neutral",
                    "\nWe stay here regularly. The location is pretty. Next to Holiday Inn. Quiet zone of town across the river and in trout country. Well laid out and neat. But needs maintainance of a better standard and staff that is courteous and helpful. Dont stay if you dont get a good room. Its all in the view.\n": "Positive",
                    "\nWe stayed at White Mist Manali in the month of July 2013. Its was a pleasant stay at there and a wonderful resort and food was excellent quality and staff was very supportive and was very relaxed out there. I and my friends family enjoyed every day at resort activities was very good and spa was nice.\n": "Positive",
                    "\nWe stayed at White Mist, a Sterling Holidays Resort through our RCI exchange. The place is just next to Holiday Inn, where we had stayed during our previous visit to Manali. We were staying at a duplex unit, well furnished, with a lovely balcony, small kitchenette, with microwave and toaster etc. The facilities for the kitchenette were not exactly fantastic but was just adequate for the two of us. The service was superb, every one at the resort was extremely friendly. We also ate a few times at the restaurant - the food was good and very cheap, especially with the usual RCI discounts! We did not use any other facilities. The only two problems were the innumerable steps we had negotiate every time we went out and also the almost inadequate heating facilities. Although there were two room heaters (Bajaj) but they hardly emitted any warm (leave alone hot!) air and were merely like decorations! Fortunately we had carried a VERY GOOD Philips room heater as well as an electric under-blanket - both of which came in extremely handy in the super cold temperatures. We were there in mid-December with temperatures plunging to minus figures at nights. Although the resort told us they only supply hot water during some hours in the mornings and evenings - we always got enough water whenever we opened the taps!!! Which was very useful! I suppose their insulations are good! Over all we had a really nice time there! Hope to get back again sometime.\n": "Positive",
                    "\nWe stayed at the White Mist for three nights. The Hotel was basically a bed and breakfast as it was still undergoing renovation and really did not have much to offer. The most surprising aspect was that there was no wifi at the Hotel even though the rest of the world had basic internet connectivity including the Club Mahindra next door. The other interesting thing is that in this particular resort you had to ask for everything as no information is shared including tours that the Resort can apparently arrange on our behalf.The only consolation is that the renovation is being correctly done as the rooms were really great with a wonderful view and there was no construction noise. The food served in the Restaurant was good and there are large TVs strategically placed where we could see the India - South Africa match over dinner.On the whole, I would say that the family had a relaxing trip however we would have loved to see a true 4 Star experience where the Resort staff would go out of their way to make the experience a truly memorable one.\n": "Negative",
                    "\nWe stayed at the White mist during February this year. We had been to Manali for our honeymoon. The view from the hotel was awesome. The food is very tasty, and the staff are very courteous and helpful. The rooms are maintained quite well. The helpdesk staff are also ready to help you anytime. Pros : There are umpteen shops near to the hotel. The location, staff and food are worth the money. This place is very secureCons : The road on which the resort is situated is quite narrow.\n": "Positive",
                    "\nWe stayed at this hotel for two nights...and it was a big disappointment. The hotel itself is in dire need of renovation, especially the bathrooms. The rooms are functional, with good sized beds and adequate warm linen. The staff were very helpful and courteous. The restaurant food requires a major overhaul...and is very expensive. The location of the hotel is nice, but if you want to stay somewhere close to all the action, this is definitely not the place for you.We found it too far from the mall and getting anywhere was a nightmare because of the traffic jams!!!!\n": "Neutral",
                    "\nWe stayed for two nights in October 2014 of which the first night was Diwali. The resort had a lovely bonfire and karaoke, fairy lights, diyas and crackers followed by a special buffet dinner with an extensive spread. The room that stayed in was neat and clean with nice linen and daily service. The staff is friendly and helping and the location is a quiet place just 3km from the Mall.\n": "Positive",
                    "\nWe stayed here in month of september 2012, as it was my first trip to manali i was awed by the beauty of himalyas on top of it the hotel was so peacefull and clean that it added serenity to our trip. i suggest everyone to try this hotel and you will not regret food is ok nothing to baost but environment is quiet pleasant\n": "Positive",
                    "\nWe stayed here last week for 3 nights. The half part of the hotel buildings is under construction and renovation that makes feel bit bothered but I must say the service/employees go out of their way to make sure your stay is as pleasant as it can be. The rooms are enormous and clean, with all of the necessary conveniences. Mountain range from back side windows when there is snow fall look pretty beautiful. Hotel is established in slightly lesser area but the location is superb. Amazing Manali was seen from here. Full of snow n white was never so beautiful. The breakfast buffet is a great way to start the day. The service there was better than many restaurants and the food was just outstanding. Little extras like the nightly turndown service, take out menus the one night we wanted to order, bottled water, and the overall friendliness of the staff makes you feel very special. They will go out of their way to make sure your stay is beyond perfect. You will not be disappointed. Trust me, I would like to give special recognition to the Hotel Manager Hemant Das who was simply wonderful toward us. He was most helpful in answering or numerous questions and always offered a kind smile. We felt very homely being called by our names every time we walked in and out and at the restaurant was the perfect touch, and the manager will make sure you are taken care of. He was very personable. He made our experience much better being that I was from out of town!!!!! We had the pleasure of staying at the Manili Mist. We hope to be back very soon!\n": "Positive",
                    "\nWe stayed in a 1BHK apartment which was a duplex.The room was very good.Sterling has recently renovated the resort and it is an amazing place to stay.The view from our room was magnificent:snow capped mountains!!The service provided is great.the staff would stock up supplies for tea/coffee everyday in our rooms.The activity center indeed has a lot many activities for you if you have a free evening.A bonfire night was arranged during our stay.The restaurant and the food is commendable.The sheer variety and the taste of the food leaves you speechless.Also as we took a package for our meals for our family,it worked out to our advantage.The only problem as usual with Sterling resorts is that it is far away from the main town.but given Sterling White Mist's location,no complaints.Going for short walks around the resort is also a good option in the evenings.There is also a grocery store opposite the resort where you will get everything,as Sterling does not have a tuck shop.\n": "Positive",
                    "\nWe stayed in this hotel for 3 nights 4 days in July 2012. The hotel is very good.. The rooms were big and had a wooden flooring.. since Manali is very cold, wooden flooring is always a plus point. The room had a mini kitchen with microwave. Housekeeping staff was good and cleanliness ws maintened in the room on all days.Althought the restarurant food is good.. its a bit expensive... (not too sure.. but around 75 rs for plain roti..) Also the hotel is 3-4 KMs away from the city.. so if you dont have your own transport, it will be difficult.. Overall a very good hotel for family trips..\n": "Positive",
                    "\nWe stayed in this hotel in the month of October 2013. Hotel is quite nice. Rooms are also quite nice. Food quality of the hotel is very good. Staff is quite helpful. Rooms are equipped with all the facilities which are of benefit.View from the rooms is quite good. Hotel also arranges for outdoor activities. Rates are quite affordable for the outdoor activities. Hotel also arranges for indoor activities to keep the guests entertained and busy. Only problem with this hotel is that location is a little away from the main market. But if you have a taxi(which we had) then its not a hassle. Overall it was a pleasant experience.\n": "Positive",
                    "\nWe stayed in this hotel when we visited Manali.It is an excellent hotel... Great back view of mountains... Clean and Nice rooms.Lttle bit conjucted.Staff were good, Friendly, Supportive and fast in service,Bathroom were clean.Want to suggest this hotel to other members and tourists as well.\n": "Positive",
                    "\nWe stayed in this resort for 3 nights. We took 3 rooms for my family. .It was a great vacation and we are really happy with the resort services but still I would like to recommend a few upgrades. 1st is surely like many have already said that the washrooms need major renovation. .flooring was cracked and shabby..room heating was inadequate.hot Water was available for limited time only. But it doesn't mean that they don't have positives..the resort was big and beautiful, so were the rooms with many facilities including kitchen utensils with microwave also. .which was very useful as we were travelling with kids.buffet was not available due to shortage of guests but every thing we required from ala carte were provided without any charges. However I would recommend this resort and would also visit again personally. .\n": "Positive",
                    "\nWe three couples stayed there for three days and two nights. The place was wonderful and we traveled by vehicle from Delhi. I advice you to break journey as the total journey was tedious( if you are visiting in summer). The rooms ware neat and the bed was excellent. View from the main building was excellent. We really had a enjoyable trip.\n": "Positive",
                    "\nWe travelled to Manali during the second week of March' 11 and stayed at Sterling Resorts for four nights. The hotel located at Phirni Rd, is at a fair distance from Mall Road, which lends it a serenity and calm, that you are trying to escape from the more commercial locations. Also, the duplex suite that we were in had a lovely view of the snow capped peaks. The service was excellent, and everybody in the staff was ever ready to help with a smile. The hotel desk also had a number of activities in late evenings that we enjoyed. My only grouse with the hotel is the lack of central heating. The hotel provided two portbale room heaters, but they were not good enough for the chilly nights we experienced during the stay.\n": "Positive",
                    "\nWe visited during December 2014. Part of the resort was under renovation which is badly needed to the resort. The resort is old and even the other half badly needs renovation. There is no parking for the cars. It's a bit away from mall road and one need to have a car along. Food and staff are really nice and hospitable. The resort has very good view indeed. I hope post renovation, the resort would be the most visited in manali.\n": "Neutral",
                    "\nWe visited the resort in the third week of June, 2013. The resort is located about 3 kms away from the main city in the village of Prini. Many fellow travelers have complained that the location of the property isn't very good but that is no true. If you wish to stay in a resort, you have to stay a bit away from the main town. Even more expensive resorts like the Holiday Inn, Club Mahindra and the Honeymoon Inn are located in close vicinity. Only Manali Resorts is located at a better place while others like the Span are located even further out. The staff is very friendly and courteous. During our 5 day long stay, we were treated really well. The rooms are clean and spacious but seem to be in need of some modern flair. As we stayed in a Studio apartment, we also had a microwave and an electric kettle at our disposal. The food from the in-house restaurant is extremely good. They have a wide variety of items and the taste is fantastic. They hold activities in the evening and the incharge knows how to give people a good time. The game room too is very good as you can play games like Air Hockey, Table Tennis, Carrom, Snakes and Ladders. For the younger amongst us, consoles like Nintendo Wii and PS2 are available for hire.All in all, the experience was pretty good.\n": "Positive",
                    "\nWe went for a family vacation to Manali in June 2013 for 4 days. Happened to book this hotel based on Tripadvisor reviews. Nice ambiance, neat and clean, nice view of snow peaks n Manali town from the room balcony, very good hospitality and service. Food was also pretty good except that South Indian dishes could be improved. They even packed for us breakfast n lunch as early as 4.00 am when we had to leave for Rohtang pass. Campfire n lively fun activities organized in the evening were refreshing ones to mention. Rooms could be revamped to meet modern standards, for example there were not many plug points for charging gadgets and no wi-fi. But, overall it was a very good holiday experience.\n": "Positive",
                    "\nWe were a group of 15 people and the stay was extremely comfortable!We were there for about a week.The staff was very helpful and courteous,arranged for cars at the last moment late night till chandigarh since our flight from manali was cancelled and we had connecting flights.Buffet spread of breakfast,lunch and dinner was amazing,even made us anything special we asked for.Food was tasty!We stayed in duplex rooms and they were great.The view from the balcony was beautiful,could see snow capped peaks!!!The rooms even had kitchen space and utensils.If you are travelling in a big group and wish to stay in the hotel and not go for sight seeing they would arrange for games and bonfire on request...THE OVERALL EXPERIENCE WAS AMAZING AND WE THOROUGHLY ENJOYED THE STAY... Best property to stay in Manali..!!!\n": "Positive",
                    "\nWe zeroed on Sterling Resorts under the lifetime membership offer. And in that offer the costs were nearly 20% of the original. The Room was spacious but basic. Though it offered a good view of the snow covered mountains. The Food whether it be Punjabi or South Indian, breakfast and juices were amazing. The resort did try and provide for campfire etc but we wanted to relax and thus didn't opt for them. Tried our hands at table tennis and carrom a bit. They arranged for all the site visits and our drop to Kullu (obviously charged).\n": "Neutral",
                    "\nWe, 3 couples visited Manali Sterling, alongwith 2 kids in July, 2011.. To my surprise, the compact rooms, we were alloted were totally refurnished.. We had a good tome at the Resort for 7 days.. he service was good and the staff was helpful. One day we did a Bar-Be-Que in the Resort lawns and we were charged exorbitantly by the Resort for the Equipment, we hired from them.. We had taken our own cook with us, although and he prepared all the Bar-Be-Que..Taking a cook alongwith us, turned out to be economical and food was prepared to our taste.. Eating outside, everday, makes you sick, although, we tried many eating joints, like Johnsons Cafe ( Good food ), Johnsons Bar, next door and partyed their till wee hours in the morning.. I would suggest to try out Belavista resort for authentic Pizza and The Dirty Dog eatery on the river in old Manali.Oh the whole, our trip was wonderful.. Take your own conveyance, id you want to see Manali, extensively. We did Water-Rafting too in Kulu, which is 1 hour drive from the Resort..\n": "Positive",
                    "\nWell, It may have happened because I visited in the off season but the experience in this expensive resort was not pleasant at all. There was no facilities available for guests nor the usual features available in a resort. Plus half the area was under maintenance. Further, most of the answers were given a negative reply. Add to it the indifferent attitude of the reception and support staff. For the price it charges, it is a strict thumbs down for the hotel.Visited 25th-28th September 2015.\n": "Negative",
                    "\nWent to Diwali vacation in Manali seeing the rating I decided to go Sterling Resort with my wife and 3 yr old daughter. I reached Manali in evening around 7 pm on 26.10.2011 given a grand welcome as if I and my family mean to them everything. They had made special arrangements to give us the best Diwali day celebration brusting crackers, live counter of food to prepare as we want. I was feeling like home.My room 2012 was having the best veiw with all the amenties. I was been given a choice to choose a package for the buffet. Which was amasing and effortable. Nishant who is working there is a nice person my daughter got attached with him and was playing with him alone. Nishant I would never forget your hospitality. Also he cried so did my wife and daughter. Also all the staff member even the Bartender, Managers also. Chef was very nice he always use to take the suggestions and implement it. Over all it was by best vacation ever. I would never ever forget.\n": "Positive",
                    "\nWent to Manali in Dec End, It was a great pleasure staying in this hotel, Nice property, big rooms, good staff. The only this which is related to the location of this property, This is bit far away from the Market.\n": "Positive",
                    "\nZero management, clueless staff; lack of cordination. A so called resort with no management or leadership to direct.We were not provided with the junior suite that we booked as property was under renovation; were provided with a studio room in another block; upon being asked for the tariff; they only replied that this is best. Very basic room like a government rest house. No activity and least options in kids play area (a small room) with only ludo, chess and carrom as options. Air hockey table and video game on payable basis but these too were out of order. Couple of cycles were available for kids but for that charges were 150 Rs for 1 hour. Being an old property they hardly have any space and are misfit to be called as a resort.We requested front office incharge many times to lodge our protest and for feedback; surprisingly the resort manager or GM never came in front to counsel or take ownership of lapses.In bone chilling winter; hot water is available only from 7-10AM in morning and 7-9 PM in evening; during other times they will deliver a bucket; Our room had a heat convector but it was just a simple fan blower ;We were told that the electricity load in the day is low hence it wont work well but after 10 PM in night it will work well. Naggar area of Manali where this resort is located has much better options; hence it is advised that do explore those too.Sterling Ooty-Fern Hill is far better and a true resort but at Manali it seems the management has least interest to operate; the morale of staff and team looked very down and they were all helpless whenever we reported issues.\n": "Negative",
                    "\ni stayed at the white mist resort for three days. the place is very beautiful, just opposite the snow clad hills. nice ambience and scenario. the place is a bit far from the bus stand and mall road, but it has plenty of cars and taxis. so no worry. the staff is competent and sincere.\n": "Positive",
                    "\ni stayed in room 2005 with family.room was very spacious.very good view from balcony.service was good.food was great.the floor of our room was without carpet which is must in these good resorts,more over some wooden tiles were broken.rest everything was excellent.our room was on 3rd floor so lift is required in old block.\n": "Positive",
                    "\ni took my family to Sterling White Mist, Manali in the last week of April, 2012 being the childrens' summer holidays. We drove down from Delhi. The road from Kulu to Manali is really bad and was under construction. The stay at Sterling was pretty good. We got a duplex room facing the valley with a bed above the staircase and a double bed below. The resort is pretty well maintained and there is also an option to preserve the bed sheet for an extra day without cleaning in order to save water and contributing to the environment. You just need to put a pamphlet at the bedside onto the bed while leaving for this. The food is also OK and you get a good deal by booking a two meal for your family in the morning. There are indoor games avaiable and the resort is located close to the town centre.There is also a spa where one can get a good massage done in traditional Kerala ayurvedic style. The masseurs are also experienced in the trade.The resort also organises outdoor trips for snow sleds, paragliding and cable car riding besides trips to Kulu for Shawls, trips to Rohtang pass which is the highest motorable road etc. We enjoyed our trip thoroughly but I would suggest a traveller to go there during end of winter rather.\n": "Positive",
                    "\nit has been a fun and exciting stay at the hotel. the hotel arranges fun activities every evening in the activity area of the hotel and they are usually very exciting and fun events. so the over all experience has been wonderful\n": "Positive",
                    "\nit was a different experience staying there. The hot food served was really delicious. The receptionist was very much welcoming and friendly.The house keeping and room service also was very good. the rooms were neat .The restaurant service and food was exceptionally outstanding. i will definitely suggest this place to any TA members\n": "Positive",
                    "\nit was my second visit to the whitest resort. i went after 2 years and the things were diametrically opposite to what i expected to see. the rooms were untidy, in a dilapidated condition. as a member of sterling resorts, it gives me pain and regret to say that this resort is not more worth a C grade hotel even.i asked to change the rooms but all the rooms were in the same condition. the staff people do not give rooms on third floor. the rooms on first and second floors are horrible.\n": "Neutral",
                    "\nmy exprence with sterling holidays resort Manali :-I visited Manali with my family from 26 to 29 April 2015 no proper service ,On 28 They gave me bill with Rs 1500 charged extra when ask why they were cheating they started abusing, threataned me and my family,then I reported the matter to incharge of sterling holidays Mr Menon and Mr badre ghunti they took no action but started to bribe me by offering another free holiday ,be awere of sterling holidays they are bunch of cheats\n": "Negative",
                    "\nstayed in this hotel in the month of October 2014. Rooms was quite spacious. Service was Excellent. Every staff member and specially the Manager of this hotel is an asset to the organization. I was there with my family and felt home away from home. worth visiting this place. keep it up.\n": "Positive",
                    "\nthis was my second visit to the place and resort. I really loved the hospitality and the care which is offered. food is great and specially the room service. i like resort's great location as it gives wonderful hill view from your window. the holiday activities are amazing and best part the host are very engaging and all resorts member really participate in the activities. Currently it is under renovation however it did not had any effect on the services i would ex\n": "Positive",
                    "\nvery good ambience, carpets & curtains are good. But some blocks are not revamped. It requires immediate attention. Bath rooms are average. Cleanliness should be the main part to be concentrated. Taxivalas little looting when arranged by sterling.\n": "Positive",
                    "\nvery nice yo stay here.good location and awesome stay'.Food in the restaurant was good and the rate is reasonable and the stay was enjoyable.There is nothing in the resort.But compare to out side here the stay and food is ok and harmless.The services are good.\n": "Positive",
                    "\nvery pleasant stay .helpful staff,nice food and feel home atmosphere.we were there for whole week and enjoyed the hospitality of the resort.moreover staff was so helpful in guiding to vicinity and sightseeing which is out of the world.rooms were neat and clean ,resort is located in beautiful location from there we can see the mountains.play area was good .overall nice and enjoyable place to be in and certainly worth visiting again.\n": "Positive",
                    "\nwas there for a week with kids and friends had a great time .the food was nice and the staff service was very good and above expectationsthe only problem was there was no lift on the back buildingbut the duplex rooms were nice\n": "Positive",
                    "\nwe booked the room as per our budget, the room and service was satisfactory. we felt that we are staying at our home not in hotel. location of the surrounded by lots of trees as it is hilly area. foods are not so good nor so bad but the place is very good for stay...\n": "Positive",
                    "\nwe had a fabulous holiday in manali.stayed at sterling white mist.Got a good room with a beautiful view.The bathroom,linens were all very clean. staff was very courteous nd made us feel so comfortable.The restaurant..food ,service nd ambience is worth mentioning.definitely recommended for a great stay .\n": "Positive",
                    "\nwe had a great holiday in Manali because of Sterling. We stayed here for couple of days and had a great time. We checked-in at around 5 in the morning and does not had any problem getting the room. The receptionist(poor guy got up in middle of sleep does not know about our arrival) welcomed us and provided the room within no time.(The only disappointment is they charged 1000 bucks for early check-in, can be ignored for their service). The rooms were very spacious, clean and linens were fresh. As soon as we entered the room we jumped on to the bed and had a nice sleep(since we had a terrific journey last night from Shimla). Woke up at 9:30 and were hungry like mad. We had breakfast in the room only. We ordered Parathas, Poori bhaji, toast. The food was exceptionally good. I did not have this kind of food any where else in such type of properties. The taste of the food was awesome. The chef there deserves an EXCELLENT rating. For the rest of our stay we had food in the resort itself.The staff there were very friendly and helpful. I highly recommend this place for any kind of travellers. Overall the experience was very good and Sterling keep up the good work.\n": "Positive",
                    "\nwe had booked 2 double rooms for 4 days in ist week of june 2014. rooms were nice & spacious and with a nice rose garden too..in house restuarant is good too,limited choice but excellent food.in house activitied were the highlights with daily new activities like soft/hard trek,bonfire,housie,karaoke everyday.5 th june being enviromental day ,hotel staff organized a walk along beas river & collectiong plastic waste--was really fun..Mr.Parikshit,from the travel desk had every activity well organised & coordinated.only drawback was there is no ready transport to market & back & u are at the auto-ricks whim & fancy who charge whatever they like or you have to have self transport,Taxi r preety well expensive being a tourist place\n": "Neutral",
                    "\nwe reached there in the morning at 8:30,the hotel staff was very helpful and on the reception they provide us room without any early check in charges. this was a nice gesture,the resort staff was very good,helpful and well behaved.RESORT IS UNDER RENOVATION so they provide us studio apartment on the another block, studio apartments are nice and equipped with microwave and electric kettle,as i said that resort is under renovation so the maintenance of garden and resort is so-so,the restaurant having lots of food choice from veg to non veg. and food quality is too good as compare the other market restaurants.the resort is 3.5km far from mall road and hptdc office,so each and every time u have to spend @ 200 rs to come on main market.i suggest please keep basic medication in your bag because nearest medical store is @ 1.5km far from the resort.due to renovation holiday activity centre had not adequate space.except some games like carom.ludo,chess,puzzles,every game is chargeable, being a member of sterling family i dont think its justice and fare,because when i purchased membership, the sales person told us that every utility in the resort including games would be free of cost and you have to pay only annual maintenance charges. but the reality is differ from that.the information centre of resort regarding transportation is not up to date. i enquire him about the conveyance from manali to chandigarh,the staff on the desk told me he can provide us taxi and there is no other volvo and buses. but the reality is every half n hrs u can catch the bus from the himachal pradesh government bus stand. the resort manager mr. ishai is a nice guy, he had very good knowledge about locals and surrounding places.over all its a nice experience,i would like to give few suggestion so the services could become more better.1. All chargeable games and other activities should be free for the members.2. Information about local specialities should be given to each member at arrival.and a list of must see and must eat will be good. manish jain stay time 25th nov. to 29th nov 2014\n": "Positive",
                    "\nwe recently stayed in this property in the month of August 2015.Though the main resort was under renovation but we were offered a very spacious rooms .Location is very good. Food was good and staffs were excellent.\n": "Positive",
                    "\nwhen i booked clearly i written i need view room but i got third class room out of my expectation . when i told to reception he told me we have not another room. but those room i see in photo during booking i was completetly opposite. and i shoked sterling have this type of rooms\n": "Negative"
                },
                "sentiment_segg": {
                    "family": 0.2081447963800905,
                    "food": 0.6515837104072398,
                    "good": 1.0,
                    "great": 0.22624434389140272,
                    "hotel": 0.8506787330316742,
                    "location": 0.22171945701357465,
                    "manali": 0.5882352941176471,
                    "nice": 0.31221719457013575,
                    "place": 0.26244343891402716,
                    "resort": 0.8371040723981901
                }
            },
            "zomato": {
                "Negative": 0,
                "Neutral": 0,
                "Positive": 0,
                "options_count": {},
                "sentiment_segg": {}
            }
        }
    }
}