{
    "parent_survey": {
        "meta": {
            "company": "Sterling Holidays Resort",
            "created_by": "5757ace0cc38e39671947a27",
            "id": "l5xgoDMYd9wG3gWrXOM",
            "total_resp": 75,
            "unit_name": "Dindi, By the Godavari"
        },
        "responses": [
            {
                "avg_rating": 82.64,
                "cid": "9ca9c60c-587c-4848-8002-31708b5dcbf1",
                "label": "How likely, on a scale of 0 to 10, are you to recommend our services to a friend or colleague?",
                "options_count": {},
                "timed": {},
                "timed_agg": {}
            },
            {
                "avg_rating": {
                    "a_1": 4.42,
                    "a_2": 3.77,
                    "a_3": 4.46,
                    "a_4": 3.55,
                    "a_5": 4.46
                },
                "options_code": {
                    "a_1": "Cleanliness",
                    "a_2": "Room Service",
                    "a_3": "Value For Money",
                    "a_4": "Ambience",
                    "a_5": "Amenities"
                }
            }
        ],
        "sentiment": {
            "tripadvisor": {
                "Negative": 2,
                "Neutral": 3,
                "Positive": 70,
                "options_count": {
                    "\n... that they take customers for granted. But its kind of expected if you factor in fact that is pioneer of 'time sharing' hotel concept in india - and that means customer has already paid upfront for hundreds of nights. Anyway I wasn't a member but their attitude carries over to 'walk-in' customers as well. We arrived 9am and by the time we had breakfast it was just 2 hours until checkin. They charged Rs1500 for just 2 hours. Our infant was acting up due to tiring journey so we had to grudgingly accept. The hotel was so unoccupied at that time that they even canceled breakfast buffet. I avoided this unreasonably high charge on checkout by booking another night at discounted trip via online discount code I had, and checked out after 5 hours of use. One trick they try to play is to tell the actual charges or availability at last hour. They'll never tell you both. That happened both at checkin as well as checkout and again when asked them to arrange for a cab for drop to station. I had to keep insisting as they were refusing to confirm availability of car till 1 hour before journey. Finally I made alternative arrangements using aptdc resort that is next door. Same goes for their tours to Antarvedi. I would recommend to contact aptdc next door. Resort is quite small. After pond there is little landscape. Godavri flows adjacent but there is no effort made to allow guests to enjoy is beauty. Not even few benches, close to view. You are expected to just walk over to the resort fence look over it. But rooms are spacious and comfortable. Food is average and terribly expensive - for a couple and infant it came to 3000+ for 4 meals, over a day and a half. Nothing fancy ordered. \n": "Neutral",
                    "\n3 of us (colleagues) with our families had been to Dindi in the first week November 2015. After 660 KMs drive we landed to this lovely place. Approach roads are okay but donot take the left turn immediately after the Godavari bridge, instead go further down by about 500 meters or so and take the cone left turn.We reached here in the evening and were like where did we land up. Moved in, easy checkins. We had taken 4 rooms right at the spiral stairs. This place is just simply awesome. The rooms are clean. Has a nice living, kitchen area, dining table/chairs, a bedroom with a lovely balcony (view is simply awesome). You can see Godavari river from here and the greens.Now let me tell you one thing. Lilly. The entire resort is beautifully built around a pond of lillys. Different types of them. They even have Amazonas lilly. We found a few of them clicking which could even hold a new born baby. Its a teeat for the eyes, be it when you wake up, walk to the restaurant, get in get out, or just simply sit there and keep watching. We stayed here for 3 nights. I wish to come here for atleast a week. My mom, daughter and my wife all loved this place. Now about the resort management. They are simply too good. I firgot the restaurant manager's name. But he took care very small little thing you can think of. Food be it ala carte or the buffet were tasty. They even went out of way to get us something that was not in the buffet. You dont find restaurants like that too often. Breakfast by the lillys were nice.When we were leaving we did not have the heart and wished we stayed longer.A great getaway that you should not miss :)\n": "Positive",
                    "\nA beautiful resort just by the godavari , roughly 280 kms from vizag , rooms are spacious , well maintained , highly courteous and accommodative staff , prithviraj , oppili , Rajesh made the stay a pleasant one , food is too good , fun activities were nice , the design or layout is phenomenal , antarvedi Sri Lakshmi Narasimha Swami temple is just 25 kms from this place and is a must visit .\n": "Positive",
                    "\nA great place and a beautiful setting on the banks of River Godavari.Good and clean rooms. There is a lot of activity in the resort. A nice swimming pool. Table tennis. Indoor games. The GM has been very good. Very innovative thinking of having a resort here. I think the first resort of Sterling in Andhra Pradesh. Ideal for conferences. Even for honey moon couples. A family resort also.Would like to visit once again due to its ambience.Good luck\n": "Positive",
                    "\nA unique property by the Godavari river in a natural setting. The service is generally good but a bit slow. The restaurant food is generally good. The restaurant manager and the head chef were courteous and asked us about the kind of food we like and made the dishes to our liking - especially my parents.The resort is relatively new and the service staff have some learning to do. Not yet of quality you find at any Kerala resort - but given the location the resort can become a top destination in Konaseema area. We hope to visit again when it is not so hot and hope to give it an overall rating of 5!. A morning walk on the bridge is very relaxing.\n": "Positive",
                    "\nAmong all the Sterling resorts in South India ( of course we have not been to Sterling resorts in Goa yet) the 'Dindi-By The Godavari' is a jewel in the crown! The resort is extremely beautiful. It has big and well furnished clean rooms with fairly big balconies providing good views, modern bathrooms, cool lighting, good ac etc.for a comfortable stay. Serene atmosphere to calm our mind. Clean air for the lungs.Beautiful ponds with lilies, lotuses and coconut trees,beautifully illuminated - a feast for the eyes. Coconut grove in a vast area - to walk around. A clean and well maintained swimming pool - to soak up. A well designed vishranti mantap with swings and benches close to the majestic Godavari river-to laze away. A few indoor and outdoor games - to keep active. A good restaurant. Add to these helpful and friendly staff. The resort is picture perfect - ideal place for people who want to relax.The restaurant menu should include Andhra specials. Cost could be reduced. There is no library. Hence carry your own books that you wanted to read but couldn't find time. You can bask near the pool with a book in hand.We (wife, son and self) holidayed during end Feb. and enjoyed every moment of our stay. Thanks to Mr.Tulsiram,GM, Mr,Prithviraj,Manager, and all other staff for making our holiday a memorable one.\n": "Positive",
                    "\nAn amazing resort to be visited for its peaceful room views, serene lotus pond ( looks the best at night ), great food, thrilling activities and a good get away from the routine life .U feel close to nature like never before !and also enjoy the Godavari just 'by ur side'. ;)Best place to be with families , friends and guaranteed fun for all age groups !We would love to visit the resort again..no doubt :)thnx to the whole team of DINDI RESORTS for their great hospitality and a special thnq to Mr. Tulsiram and Mr. Prithviraj for their amazing care :)TO BE VISITED MORE THAN ONCE :)\n": "Positive",
                    "\nBeautiful resort, Supporting and helpful team ( Mr. Teja and Mr. Swaroop) and awesome food.. The lotus pond is eye catching and the swimming pool which is adj-cent to Godavari river is one of the beautiful experience. A perfect place for all kind of travelers ( couples, family, friends, lone travelers ). One of the best part is the activity center ( Mr. Hari) so energetic and involves every one in the activity. All together wonderful & memorable experience.\n": "Positive",
                    "\nClean comfortable rooms that nurture relaxed family times. Very hospitable staff. Great sunrises & sunsets. Efficient spa. Practical restaurant eager to please clients. Swimming pool , adventure activities, landscaping, boating etc to keep is happy. Great place to go relax for 3 or 4 days.\n": "Positive",
                    "\nDear Fiends I recently visited this resort and liked it very much. The location on the bank of Godavari river in the middle of Coconut trees it is really awesome. The Lotus Pond is fantastic and worth seeing it. Food in the restaurant is not up to the mark. Rooms are clean and comfortable. Swimming pool and pool area is very nice. A very good place to visit in group.\n": "Positive",
                    "\nDear friends,I recently visited Streling's Dindi-by the Godavari resort.It was rejuvenating to see nature at it's truest here.I had only read about these lily pads which can hold babies weighing upto 8 kgs but to see them here in India was a fascinating experience.The homely and simple yet scrumptious food served by the hospitable F&B crew touched my heart.Being a senior citizen, such old world values were truly appealing.The General Manager Mr.Tulsiram pays great attention to the housekeeping and comfort aspects for all the guests.One of the best Sterling resorts I have been to...kudos to the whole team...It is a must-visit resort!\n": "Positive",
                    "\nDindi resort is located on the Banks of River Godavari near the chinchinada bridge.it is approximately 80 kms far from rajahmundry.The Hotel is well maintained will beautiful gardens and a good swimming pool.The resort has many activities for both kids and elders too.The hotel is a square shaped building with a pond full of lotus flowers and coconut trees in the middle.Each Room has either the front view or the balcony views to the pond or the gardens surrounding the building.The food was excellent but the prices are on the higher side. You get a complimentary breakfast each morning and the menu is mostly south indian with idly, vada, dosa, poori, toast etc.The resort also conducts some events during the day time or in the evenings.They have an Activity center, where you can spend some time playing chess, carroms and video games. They dont have their own boating facility. There is an APTDC resort just adjacent to this property where you can enjoy a ride in river godavari.Hotel provides free wifi access, but is available only at the restaurant.The hotel staff are very good and ready to get anything extra if needed.It is a very good place to spend quality time with family or honeymooners.\n": "Positive",
                    "\nDindi sterling resort in built with lotous ponds,very nice view.surrounded by cocunut trees.river godavari flowing one side.really its very good location.resort fully neat and clean.and food is very good.hotel manager tulsiram and rakesh resturent manager and other staffs personally takes care for every guests.nearby antravelly narshima temple is very famous near godavari river and sea sangam.one can watch river and sea in the same place.its between narshapur and palakulu.rajamundri airport is just 70 km.resorts swimming pool just over viewing the godavari river.one can also do boating in river.from Hyderabad by train narsapur express starts at 9.45 pm and reach palakulu at 7.50am.and resort is just 15 km from that.one can go up to narsapur also and from there the resort is just 17 km.by road from Hyderabad one can reach dindi in 8 hours.one must visit the place and enjoy the view and hospitality of the resort staff specially of tulsiram manager of resort and Rajesh resturent manager who serve very deligious foods as per guest choices.\n": "Positive",
                    "\nDindi- the place with lots of greenery and a beautiful resort..that is by the sterling resorts. I love the resort...the theme of construction in dindi was lovely look we had at our first sight.i felt in love with resort by the first sight of my visit.Reception desk people were good and helpful.Rooms were spacious and clean with a balcony of every room.And every evening they held nice entertainment in the action vity room..lastly nice disco we did.Actually we went with lot of members..we enjoyed thoroughly. Swimming pool is nice and clean...they always clean time to time.Coming to the food...it was amazing taste of konaseema food.Lots of varieties... And putharekulu I love it... I can say...everyone feel a pleasant stay with this resort at dindi..am sure...\n": "Positive",
                    "\nEleven of us travelled to the new Sterling Resort Dindi By Godavari from Hyderabad and were there for two nights from 31st July to 2nd August 2015. All the facilities were amazing at the Resort.. the Rooms, the Food, the ambience, the indoor and outdoor facilities..in particular the amazing scene of the Godavari flowing behind the Property.Special mention needs to be made about the smiling faces which greet you at every moment we cross them and the wonderful delicious food that was being served at the Cafeteria.A Great Location with Great Warm Hearts which welcome you and serve you during the Stay.Dindi By Godavari - Will come again for yet another relaxed stay.\n": "Positive",
                    "\nExcellent new property by Sterling. It seems that Sterling has definitely turned over a new leaf ever since it has been acquired by Thomas Cook and is now primed to compete with Club Mahindra. The rooms, the service and the locale are all top notch. Getting there is a challenge as you have the change flights to get to Rajmoudry Airport.\n": "Positive",
                    "\nExcellent place by the side of the Godavari. Helpful staff, good food ,excellent ambience. Rooms are comfortable and amenities are good. Good evening activities and those keen on adventure can also go for long walks .\n": "Positive",
                    "\nExceptional superb ambience... Very Clean rooms ... Awesome scenery.... Breakfast is good ...but lunch and dinner is ok..and majority of the dishes r a repeat... Not freshly i guess.... But overall a very relaxing and soothing and quite location.....\n": "Positive",
                    "\nGood place to take rest and enjoy nature beauty in banks of the river Godavari. Scenic beauty from the rooms. Has a good swimming pool. Staff are good and helpful. Good food from restaurant as per our choice. Few Temple to visit nearby Antervedi near beach also Sagar Sangamam. Another Temple Uppanapalli. Also excursion by boat in godavari river to Anterwadi beach is available. Great place to enjoy and good holiday activities including Karoke. Must visit place\n": "Positive",
                    "\nHad been to this place last August when it had newly opened. 9 months later, it was just the same - fabulous...The way the resort has been made amongst a lotus pond is mesmerising. So much of greenery all around. Rooms are big and well maintained. Bathrooms are neat and clean. Food is excellent. The only reason this resort will run for a long time is because of the staff. The smiling face of every staff member is such a pleasant sight, never heard a 'no' from any one of them for any of our requests.Hats off to Mr. Tulsiram and Mr. Rajesh for their hospitality, who gave us a holiday full of memories.\n": "Positive",
                    "\nHospitality is worst except restaurant. Room service and response is utter worse. No arrangements from the resort like boating and other activities. On an over all, i would rate it as best place to go for wrong resort.\n": "Negative",
                    "\nI and my wife visited the Dindi resort of Sterling this week. A very quite place in the middle of a man made pond full of lotus flowers of different colors very close to Godavari river. Rooms were very neat, spacious and comfortable. Great staff and their hospitality was superb. The resort Manager Mr. Prithviraj is a very nice person who tries to make your stay extremely comfortable. The restaurant manager Mr. Rajesh was outstanding and personally took care of the requirements of the guests. Food items in the menu card appear limited but if you want something specific Mr. Rajesh tries his best to get you the same. Rest of the staff were also very polite and helpful. We traveled by train from Chennai to Rajahmundry from where it takes around 2 hours to reach the location. We hired a car for 4 days from RV Tours, Rajahmundry for local sightseeing since this is much cheaper. The driver from RV Tours was again very helpful and took us to all important temples. There are not many attractions near the resort other than many temples including the famous Narasimha Swamy temple at Antarvedi and Someswara Swamy temple in Bhimavaram. Any visit must be planned between October to early March since the weather can really get very hot during summer when it may be difficult to venture out. This is a sort of a remote location and it is better to carry essential medicines with you when you visit their resort. During the past few years Sterling has improved its facilities in all its locations and Dindi despite being functional only for past 9 months is another feather in the cap of Sterling. I would certainly visit this once again.\n": "Positive",
                    "\nI had gone to Dindi during the first week of Feb along with my spouse to celebrate our anniversary. At the onset I was skeptical however I took my chances after looking at the pictures and I am glad to state that they did not disappoint me. Infact, it was the first time that I saw a resort which was exactly the way it looked in the pictures online.Since it was only 500 kms from Hyderabad, we chose to drive down. I stayed there for 3 nights and had some of the best authentic Andhra food which was specially selected for us by the Restaurant Manager Mr.Rajesh. He also went a step ahead and got some dishes prepared for us which were not part of the standard menu.The resort was spick and span and had spacious rooms with excellent house keeping facilities. The balcony of our room opened towards the Lotus Pond. Resort Manager Mr.Tulsiram was a perfect host. When he got to know about the occasion that we were celebrating, he was kind enough to decorate our room with flowers, towels and balloons, he also sent us a cake which was very kind of him.We did a local village tour early in the morning and that was a great experience as well, We had fresh coconut water, the coconuts were plucked from the tree in front of us.All in all I would definitely recommend this place for a good break from the hectic city life.Once again thank you to the resort team for making our stay special and memorable.Cheers!Bharat\n": "Positive",
                    "\nI stayed for 2 days in both the premier and the classic room. There is not much of a difference between the two. Choose classic room as it is cheaper by 1000 bucks. The rooms, the linen and bathrooms are clean and comfortable. The property is well maintained and has a pond which gives the resort a great look. The food is average as some of the dishes are good while the others are pretty average. There are limited options. The complimentary breakfast was good. Below are a few pointers:1. Food: Opt for handi biriyani, dum aloo. Rotis are not great thus we had to eat kulchas (they are good but made of maida so not a preferred choice). Pasta is on menu but was not available except for spaghheti.2. Property and amenities: Good. It has a decent pool, volleyball space, table tennis, game room which is great (It has carroms, taboo etc.) and activities room which can be used to dance on self selected music. It has cycles also available which need to be rented to ride on them.3. Connectivity: Wifi is only available in lobby. It should be made available in rooms too. So not happy with wifi as it is a must these days.Overall happy with my stay. You can go to nearby APTDC property for boat ride on Godavari.\n": "Positive",
                    "\nI think this is one the best resort from Sterling, amazing location, on the banks of Godvari river.I went with the group of 24 pax and after reaching the resort we were like WOW what a resort it is! Rooms were well furnished and well maintained and it was built around lotus pond and i can say all rooms were of 5 star standards.Food was unbelievable, we took breakfast & lunch package in which they served all varieties of food from, north indian, south indian and italian, whatever food they served was great. chef was also very kind enough to ask if at all we wanted any special variety, twice he made some special snacks for us.I would love to visit it again because of nice hospitality given by hotel staff and i would specially want thank Mr. Rajesh - F&B manager who was always helpful to us.\n": "Positive",
                    "\nI visited this resort in the month of Jan 2016 and stayed for two days 15th to 17th Jan along with my wife and son. It is maintained spotless clean. The service levels from each and every employee was par excellent. You can forget everything during your stay here.We are not satisfied for only staying for 2 days. Hence, Planning to visit and stay for more days in this month. Wonderful resort with dedicated staff.\n": "Positive",
                    "\nI was here a few days ago just to spend a couple of hours with friends and was shocked to not have heard much about this beautiful place. Its right on the river banks of godavari. We were lucky to see an amazing sunset. The food is pretty good.But not everything was available then due to Maha Pushkar happening nearby. This is an amazing getaway for a weekend. One can even plan a 5-7 days trip combined a overnight boat ride to paapikondalu.\n": "Positive",
                    "\nI wen on Vacation with my family to Dindi - By the Godavari resort (from 29-12-15 to 02-01-16) for 4 nights. I would say my overall experience was pathetic to say the least. Here are few of my observations/feedback:I spoke to some of the other guests who were non-members and came to know that they were staying in privileged rooms (which were supposed to be given to members), but where as I was put into a guest room saying no studio rooms were available. I really don't know how can you make your member stay in a guest room and make the non-members stay in a privileged studio rooms.The buffet menu provided was very ordinary and routine with absolutely no variety, it was very boring to eat the same kind of stuff for 4 days. Restaurant staff was never helpful and they absolutely have no training on how to interact with guests, especially this guy Mithun should be told and seriously trained on how to be polite and interact with guests. Mr Rajesh who is the restaurant in charge should be told by someone to treat all his guests equally and that there shouldn't be any partiality towards certain guests. I find him to be ridiculous!We have no option in Dindi resort to book a private cab, so we have to go with what ever is provided to us by Sterling resorts. You guys charge 15 Rs per KM plus taxes which is a very high rate. I don't think anyone in the country charges this kind of price per KM. When I checked with the cab driver they too agreed that 15 Rs per KM was very high. Private cab guy charged us 350 Rs for a drop from Palakollu railway station to Sterling resorts which is 15 KMs, but sterling is charging us 950 Rs for the same drop :)New year eve celebration was again a open loot from the members where we ended up paying 4500 for 3 of us which included my 7 years old daughter. This price can get you into some of the best new year eve celebrations in Hyderabad. First of all why should we pay for new year eve celebrations is it not the resorts responsibility to take care of that or at least for the members? Funny thing is we ended up paying this huge amount but still we couldn't get bottle of drinking water as even that is an extra chargeWe weren't provided with any complimentary soaps, shampoo, shaving kit, tooth paste or tooth brush during our stay. None of the staff members were pleasing to talk with and none of them were trained to be pleasing. We have to literally chase the restaurant staff to take our order and sometimes I felt it would be better to have your food sitting in your room than that restaurant. I tried to reach the resort manager to give my feedback on all these, but Mr Manager was never reachable. To be frank I don't even know the name of the resort manager and doesn't even know how he looks like. I would not recommend any of my friends for Dindi sterling resort and I would never ever visit that place even if I'm given a all inclusive free stay.\n": "Negative",
                    "\nI went with my family to this resort ... a quiet, pleasant and peaceful atmosphere just by the riverside Godavari! Enjoyed swimming and playing badminton.. Food at the restaurant was delicious my kid loved kichidi .. Very friendly staff - a special thanks to Mr. Hari - event coordinator at the resort brought everyone together and conducted fun activities.\n": "Positive",
                    "\nI went with my parents to this resort, it was indeed a very relaxing atmosphere.I went during the week days, hence the occupancy was very less. Therefore there were no holiday activities or buffet during the week days. Go there only for the weekend and stay not more than 2 days, or else you get bored really quickly. Nothing much to do outside the resort. Food provided in the restaurant is just Average and you dont have any options of eating out. The service is really good, and the resort in an overall aspect is good. Please keep enough money in cash to pay your resort bills, because the card swiping machine has a vodaphone connection and vodaphone is the only network provided which do not work in this resort.\n": "Positive",
                    "\nIf you're looking for a quick dash close to Hyderabad, then Dindi By The Godavari is just right. It is overnight by train from Hyderabad (take train to Palakollu station which is 15 kms from the Resort), and return through the same mode.Dindi By The Godavari is a new property by Sterling Group and is on the banks of the river Godavari (as the name suggests), with rooms set around a lily pond, and the swimming pool near the banks. It has the pre-requisite abundant coconut trees in and around the property giving the perfect tropical feel.The rooms, dining arrangements are all standard and good, no reason to complain. The food is nice and the best part is their staff. All are very hospitable and warm, genuinely interested to know your requirements and to do their best to fulfill them.If you're looking for a quiet time, do try to visit on a week day as apparently they are full on weekends! We were a group of 14 adults who had the perfect time on Friday, but Saturday saw another group of 105 come in! The resort is perfect to go with friends, family and has a swimming pool, a games room (with lots of games to play), outdoor games (but it is black cotton soil area so if it rains, don't expect to be playing outdoors), etc.We had a wonderful two days at the resort, and recommend it to everyone!\n": "Positive",
                    "\nIn the month of October, 2015 my friend's family members and my self visiting the Sterling Resorts (By the Godavari). In the Entrance of the Resorts and Center of the Resorts is very awesome. Also the treatment of Resorts Staff and Restaurant Staff treating like family members and supporting well to all my members. I once again thankful to Resort's Manager and supporting Staff for a great trip to my family members.\n": "Positive",
                    "\nIt is just a perfect property, a dream property in all aspects. Its asthetic appeal, over all interiors, restaurant ambience, beautiful pond, river nearby, large open spaces, holiday activities for kids, all in all a very well balanced hotel. Its fun to experience a well maintained Swimming Pool and all other exterior game areas. Well discipline n helping approach of Staff raises the bar of feel good factor. A must visit for a short vacation...Overall the Resort Manager insured our vacation for funfilled holiday....hope to revisit soon\n": "Positive",
                    "\nIt was one of the beautiful resort in India,the rooms were neat & big in size,the location of resort was good ,and the lily pond was amazing,the service in restaurants was good and they were good in your demands\n": "Positive",
                    "\nLocation was good, view from the room was awesome. food was good. suggestion: The approach road for the hotel should be improved. more sign boards should be placed.The resturant service was good but has scope of improvement. The overall experience was good.\n": "Positive",
                    "\nMy wife went with a group of 24 ladies made a weekend trip to this place.. After she came back she realized that she left phone charger at the resort. I called the resort management, who promptly took action on my phone call and ensured that the phone charger was sent by courier safely and without asking for any charges upfront or even after receiving the item.\n": "Positive",
                    "\nMyself and my wife stayed at this resort of sterling from 01 September to 05th September. The location is very nice and looks like Kerala in plains. Lots of coconut trees and Godavari was full of water due to recent rains.Total staff at this resort are very cooperative and made the stay enjoyable.Especially the restaurant food and Beverage manager Mr. Rajesh and chef Mr Suman took special care in advising the food recipe to order and explained the how they are making the recipe. The restaurant menu offer selection of food with local flavor and other common south and north Indian recipes.This location is only for relaxation, as there is no other nearby places to explore except some places of religious importance.There was no internet connectivity in the rooms. Wifi is available only in receptions and that is also of poor connectivity.\n": "Positive",
                    "\nOne of the latest and best resorts acquired and operated by Sterling. The rooms are great. The interiors and resort setting is really nice. Enjoyed the service at the spa. Food could do with some improvements, specially desserts. Service was truly with a smile. Missed the absence of laundry service. Boating in river godavari was great so was the walk in the Rice fields. The destination in terms of sightseeing is nothing much.\n": "Positive",
                    "\nOur stay at Dindi,By the Godavari was excellent. This was an option we chose at the last moment by just viewing the lovely resort with the lotus pond but were very happy to have chosen to it. We were totally bowled by the kind hospitality & service by the ever smiling staff , the food was very good & we got to taste the culinary delights of the area. This place totally relaxes you & the spa services (massages) rejuvenated all of us.we would highly recommend this resort where the serene Godavari soothes ur nerves. thanks to all the staff for making our stay so enjoyable.\n": "Positive",
                    "\nPerfect escape from daily routine .....A place to relish lush green coconut grooves....bond with family. Be with nature by bank of Godavari. Took around 90 minutes to reach from Rajmundry station other option is to take taxi from bheemavaram (40 minutes ).Well depends on the train you take . Property has been developed keeping flora and founa in mind.... you will be welcomed by lotus flowers blooming to the glory in the pond surrounded by rooms.Rooms are maintained pretty well .....nothing to complain . In house restaurant serves all cuisine and staff is happy to accommodate if you have any special request. .........very quick service . Not much of sight seeing except boat ride in godavary but you may want to visit few famous temples around ......or just eat sleep enjoy nature and relax\n": "Positive",
                    "\nProperty is very goodWelcoming/send off was not so great.Rooms are goodRequest to ask for studio type rooms so that its quite big and they have very good facing of Lilly pond viewPlace is neat and cleanFood is good, Good hospitality from Manager Rajesh. Whatever he requested he could make it for us.Event manager was also good conducted good program during Diwali.It’s just 6 months old property so would suggest team to keep the same work and improve as per the guest feedback will help them.ConsBuffet price is very high and we don’t see value for money as they don’t have much variety if we are expecting.Need to improve quality on Desserts as they are not up to the standard.Over all front office and Room service can be improved little as they are new I am agree but its not the benchmark.Overall I am happy with the stay 4/5One more attraction is : Next to the property is the Andhra Pradesh tourism guest house where you can walk to the property and you can utilize few additional service like Boating and few adventure activity..kids zone. Going directly and take a boat ride is cheaper than going via sterling.\n": "Positive",
                    "\nRecently had a group booking at this resorts. with BIKe riders from Hyderabad, Group was extremely happy with the hospitality extended by Mr Tulsiram and Team, Great Job Man...We got individual call from all the people to thanks to the resort team...excellent food and ambience...River facing swimming pool..Lovely coconut lagoon surrounding..Pool Party Dj what else ...Awesome...Great Place to relax...New Resorts with all modern amenities....Well spacious rooms...Nice Lilly pool\n": "Positive",
                    "\nStayed with Family in this resort during the last week ( 3 days 2 nights ) ; the resort is very well maintained and kept clean . the Check in was quick and we started enjoying at the word go . The Resort Manager Mr Tulasiram adds another Star to the experience and i have heard this from every other guest during our stay .. There is no \"NO\" in his vocabulary - he will do everything in his capacity to honor any genuine request .. Overall a peaceful and nice place to stay with family or friends for a couple of days .. For families - its very secured and you have a good mix of the menu for kids and adults . Only one down side which could be improved is the cramped parking - but it easily fits 10 + cars .\n": "Positive",
                    "\nSuperb Resort.. Great facility.. and AWESOME food.. We went there for 3 nights and wanted a competely chilled and relaxing holiday - and this was THE answer to that.Thoroughly enjoyed the room.. services.. and all the ala carte foood that we ordered - were REALLY Yum. The buffet is a bit limited - but I would not complain.The outdoor pool surrounded by the coconut trees was where we spent most of our time... and the lily pond around which the resort is built was our morning view.Not raising too high hopes - I would say this is a 3 star property but with great service.. new rooms.. good attention by the staff.. and descent enough activities at the resort.This is right next to the APTDC Harita resort - from where you can do some water sports- its hardly 50 -100 mts away.Would DEFENITELY recommend it for a good weekend getaway from Hyderabad. Would defenitely want to go back to this place.\n": "Positive",
                    "\nSuperrrr Awesome place to visit, fully satisfied without any compromise for any issues. Manager of the Resort Mr.Tulasiram is very very excellent n humble person who vl help n guide us for any issue or requirement & no words for other staff who are very very co-operative in all aspects. Should visit this place at least once in lifetime.\n": "Positive",
                    "\nThe concept of this place is to get in touch with nature in the most simple way- Take a holiday by the side of River and you shall feel the difference immediately. The place is designed like a village with the earthy feel and touch to its entire building. The rooms are spacious , courteous staff and lip-smacking food at their restaurant. Strolling across their garden overlooking the River, with the pool nearby. They have games and other activities on weekends. Though they say that you can have a room with the river view from balcony, none of their rooms overlook the river. other than that the overall holiday experience was very relaxing and rejuvenating. The staff is very helpful, if you wanna get something special done you can count on them. I had a special candle light dinner setup by the river side during my stay (its chargeable). They do not have Wi-fi service in the rooms, which is good with the kind of holiday they provide. The rooms are very spacious and comfortable.\n": "Positive",
                    "\nThe resort is beautiful architecturally and the sensitivity to local environment deserves praise. The food is deliciously authentic Andhra cuisine, along with a range of Indian/continental options, although we feasted exclusively on the local delicacies. The staff at the restaurant took great care of us. The resort manager Mr Thulsiram was relentlessly thoughtful and paid attention to every detail to ensure impeccable quality and service. The manager of housekeeping did a stellar job to keep the room clean and well stocked with the basics of water, fruits and bath supplies. The welcome drink of buttermilk was fantastic, as were the daily supply of Rasthikeli bananas and oranges. We were a family of 3 couples and 3 children and traveled from Chennai for the first time to Dindi. We arrived a couple of days before Christmas and stayed for 4 days and the team made my daughter's 6th birthday a very special occasion! My children have now become big fans of the Bottabomulus, which are giant dolls from the region and were a feature of the christmas eve celebrations. Look forward to many more vacations at this resort in the care of Mr Thulsiram and with Sterling\n": "Positive",
                    "\nThe resort is in a beautiful location of Konaseema. The lush green trees, the lotus ponds, the beauty of nature is everywhere.The rooms are very generous. Very friendly staff and the food is fantastic. We are NRIs who moved overseas 25 years back. I was very proud to show my birth place to my daughter and son in law the way I enjoyed when I was young.A sincere suggestion to the Management:- Please maintain this beautiful resort regularly and continuously. That way we can bring more guests from abroad and show our great country and your excellent hospitality.\n": "Positive",
                    "\nThe rooms and facilities are amazing. Staff is extremely courteous and helpful. Amenities are great. All meals were wonderful. However, the tea and coffee could be better. All in all, an excellent place for a holiday!\n": "Positive",
                    "\nThis is a very good getaway for the weekend. We were here for an evening. This place is good for any type of activities. There is a nice play area for the kids. The food is good. This place would be best just after the rains as the drive around the place is also great\n": "Positive",
                    "\nThis is best I have ever been to, this has a perfect combination of natural and urban infrastructure. Situated beside godavari river. House boat is also available for a full day. If you don't want to stay u can take 50₹ ticket and can have a look around\n": "Positive",
                    "\nThis property is a new addition to Sterling group. It is located on the banks of the river Godavari in a village named Dindi - which almost 3 hours drive from Vijayawada/ two hours from Rajahmundry. The entire stretch stretch is scenic, with lots of greenery. The resort is located next to AP tourism property. Its a beautiful place built over a Lily pond. All Rooms open to the lily pond, either from the main door or from the balcony.Rooms are very spacious, and well maintained. There are frequent power cuts in the locality, due to the remote location. However the staff do a good job in maintaining the generators and limit the power cut duration to a greater extent.The backyard of the property is maintained well. There are a lot of coconut tress. There are earmarked places for some outdoor activities. The swimming pool is situated at the corner of the property facing the river. The entire landscape as well as the swimming pool is maintained really well. the quality of water in the pool is appreciable.Front desk were very cordial during the reception. Though we had reached very early than the check in time, we were accomodated immediately. Thanks to Teja.Coming to the food, there are very less options to eat out, so we pretty much had all our three meal during our four night stay in the resort. The quality of food was outstanding. Though they had a limited menu, due to the nonavailability of certain ingredients in that region, they made sure the taste and quality is perfect. Special credit to Rajesh - F&B Manager, who made sure that we were taken care with the right type of food. His cool approach and ability to suggest various food varieties is commendable.The room service was timely. Special thanks to Ravi, Mohibul, to name a few.The resort doesn't have a license to operate a bar. However, liquor could be purchased from AP Tourism resort or at few shops in the village.The areas of improvement suggested would be the expertise on the local region and the wifi connectivity, (if something could be done about it). Many of the staff are new, though they took efforts to give us suggestions on the place to visit etc...yet google maps was able to provide us with more info in many instances. i guess this is just a teething issue, which they would over come in the coming months.Over all we had a great time at Dindi, and would surely add this to our yearly tour map. Place worth visiting.Note: Vodafone doesn't at most of the places in the resort.\n": "Positive",
                    "\nThis property is like heaven with hell of services..... \"Services every where are low grade\"....... Be it at restaurant or pool or room service all in vain..... But the best part is the location it's really awesome, it overcomes all these hurdles\n": "Positive",
                    "\nThis was a good resorts besides river godawari.surrounded by coconut trees,full of greenary and lotous flower pond.the rooms built is such a way middle is lotous pond surrouned by rooms. very nice view.resorts staff are very coporatives,food is very good.every body enjoy the food.spceial fish for non veg persons.the resort have a nice swiming pool with nice soft water.near by boating service by a p tourisam is avail able at gidawari river.near 23 km godawari river joined the sea.so visitors can enjoy river in one side and sea on other side.some famous temples are within 40 km ranges.one can enjoy the place.staying plus good hospitality by hotel staff and good food and good view with trees and ponds is very good.swiming pool aceing godawari river is great attraction.see the river and sea sangam and enjoy river and sea same place.from hyderabad narsapur express available which start at 10 pm and reach palakullu station at 8 am.on return journy train start at 7 pm and reach hyderabad at 5 pm.\n": "Positive",
                    "\nVery good hospitality, clean rooms, excellent service, tasty food, green resort, what else can we ask, thoroughly enjoyed the stay, special mention to the staff. They ensure that the guest feels at home .pool and outdoor activities was very nice.,,it's a little away from road, so very very calm and peaceful\n": "Positive",
                    "\nWe 5 ladies(senior citizens) stayed at the newly opened Sterling Resort,Dindi,from June12 to June15.We had a real memorable stay.Room,surroundings,staffall of them need a special mention.Especially Obli and his team made our stayhome away from home.The room well maintained & staff very courteous.The rooms are situated around a pretty lily pond. the beauty of which is still colorful in our memory.\n": "Positive",
                    "\nWe are a group of 115 Pax went to this resort on 27th June , Our Entire Experience in this Resort simply Superb , Treditional welcome with welcome Drink , Nice Modern & spacioues Rooms ,Most Importantly Great Food & Hotel staff were amazingly helpful through out Day & Night THE BEST RESORT FOR SHORT HOLIDAY & HIGHLY RECOMMENDED\n": "Positive",
                    "\nWe as a group of 60 people from palakol visited the property on business purpose , it was really good to see the property like this existing in our location. Food was exceptionally well , service from the arrival time to till we vacate the place was outstanding. Fun activities specially in the lawns for the group organised by the team was entertaining.We will certainly recommend this beautiful place to our friends & family members .\n": "Positive",
                    "\nWe came their kitty party and we enjoyed a lot with kitty members.its is a very nice place for visiting place. it is a lovely place by enjoying near godavari river and makes the mind very cool and pleasant\n": "Positive",
                    "\nWe had spent one night and two days at Sterling Resorts at Dindi by Godavari. It is a great place to spend a few days. Absolute tranquility, serene natural beauty ,green and green every where. The resort is well kept,clean,neat and with many lakes filled with different varieties of lotus plants and flowers. The staff at the resort are very courteous right from reception through to your room. Rooms are well kept with all accessories like coffee and tea kettle , micro Owen and with good a/c.Good restaurant and the staff is helpful. Food is good. We enjoyed our stay and would like to go again with some friends this time. Y. K. Rao\n": "Positive",
                    "\nWe have planned to spend a vacation for new year in dindi by the godavari river. The moment we went in we could see the lotus pond which attracts each and every one. The way they have welcomed us, reception staff is extremely freindly. What ever u want they are there ryt in front of u in 10 mins. We had a party on 31st nyt. Food was ok ok according to the price which we paid for couple dinner on 31st . Rest every thing was great.\n": "Positive",
                    "\nWe spent 2 nights here....the place was just OK....was expecting a far better experience looking at the fact that this place is run by Sterling....and for the price being charged which is double of what APTDC charges at the Coconut grove which is right besides this one.....the SPA was nice and well managed. The rates for food was exorbitant and the taste below par....\n": "Neutral",
                    "\nWe stayed at this place for two Days and two Nights recently and would rate this as one of my best vacation place. The surroundings of this resort are Serene and Picturesque and would match that of the Kerala backwater resorts. The Highlight of this Resort is the nice layout of the rooms around the Lotus pond where we could see Lotus in various colors and size bloom. The Pictures shown in the website is what you see there. The rooms are comfortable and large enough to accommodate a family of four. We took a studio room with balcony opening to the Lotus Pond.This resort is newly built and there are few things that are still in making but the overall experience has been very good.The housekeeping staff is good and very prompt.The Restaurant décor is just fine and they could have made it little bit more snazzy when I compare it with other Sterling properties.The food is really good and I enquired if we could get a local cuisine for dinner and I was thrilled to relish among the best South Indian fare by a local Chef. The bar has not started yet and might start once they get the license.The location of the swimming pool is just adjacent to the River Godavari and the Evening looks scintillating with the sunset shining over the river.The landscape around pool is mostly completed and addition of few kids outdoor rides (swing, slides etc) and hammock will be awesome.Special thanks to Mr Tulsiram who is the Resort Manager for personally taking feedbacks from every guests to make sure that everyone is having the best of experiences during their stay at Resort.One could also take Boat rides and other water sport activities from the APTDC resort just adjacent to the sterling resorts.\n": "Positive",
                    "\nWe stayed for 3 nights & 4 days ,Neat & clean rooms,The staff were very friendly-specially Mr.Tulasiram,Ravi & Mintu ,good food.Surprisingly no mosquito's though the resort is surrounded by ponds N agricultural fields.\n": "Positive",
                    "\nWe stayed here for 3 nights. It is located on banks of River Godavari. The rooms are spacious and very clean (Well maintained). The rooms are built around a Lotus pond which gives a picturesque view. The resort and restaurant staff was very cordial and supportive. Food is also excellent. They serve both north and south Indian food. The best part was, they offered the food on our choice apart from the regular buffet. They have lots of entertainment activities for all the age groups. An excellent place to spend time with family and friends.\n": "Positive",
                    "\nWe stayed in this property for 1st and 2nd of Sept. This property is adjacent to AP Tourism Dindi Resort. In fact, my colleague had stayed at AP Tourism property which I believe is a decent one. However I chose this one as it had good rankings in Tripadvisor. I made the booking through \"Booking.com\". My credit card was charged on 31st Aug and still was made to pay again by the property citing non-payment from booking.com. Now having paid twice for the room, I am now trying to get back money from the property. Coming back to Property, this is in Dindi village which is surrounded by coconut trees and branches of Godavari. It is near to Palakollu (take deviation from Tanuku on NH towards Rajahmundry). The best part is the drive. Property is very nice given that it is new and maintained well however service needs great improvement. Housekeeping staff is good but restaurant staff is laidback. Only exceptions being Mohibul and Minto who extended good hospitality and took good care. We didn't try food but for the breakfast which was above average.Overall, a lovely property in Konaseema. You will love the lotus blooms.\n": "Positive",
                    "\nWe went as a group of 7 families with kids to this newest offering by Sterling Resorts, true to the photographs on the website, this resort is located amidst lush greenery and on the banks of the magnificent Godavari, which was in itself breathtaking.Pros: Food, Excellent upkeep of property, clean and tidy rooms, Lush scenery all around.Cons: Short of staff, when there are more than one group accommodated in the resort, there are not enough hands to attend to the guests, teething troubles as this is a new resort in itself. The property does not have a licence to server liquor yet, however, the bar area was impressive :-)\n": "Positive",
                    "\nWe were 3 couples with kids who'd travel to Sterling Resort in Dindi...Had a wonderful moment while we were their...First thing we did was jump in the pool to cool off from the day long journey....Kids had a blast...We enjoyed playing ZINGA in the play room...and had a blast during the independence day party...The moment you enter the resort you are mesmerized by a beautiful lake filled with lotuses...The rooms are also good...but the food is awful... had a few varieties of indiancuisine...but the taste is not at all good...need to change their chef...\n": "Positive",
                    "\nWe were 4 couples staying in the resort Dindi by Godavari of Sterling. The property is outstanding and the best we saw in the Sterling Resorts. The lay our, greenery lotus flower clad man made pool really were enthralloing and pleasing the our eyes. We said \" WOW - what a fine resort \"Staff were very professional and caring. We are very happy with their personalized attention in every aspect to make us happy . I told my wife \" we have to come here every year !!\n": "Positive",
                    "\nWe were at the resort from Feb 25th to 28th. We were a family of 6 including senior citizens. We were first impressed by the ambience of the Hotel which is built on a Lotus Pond. It has a unique Central Lotus Pond area with special lighting at night. We were pleasantly surprised that there were no mosquitoes because of the water bodies.It has a selection of river view Rooms. The first floor rooms on all sides offer a better view outside the windows.the Hotel has a good Mix of Activities including Swimming Pool and Sports. The SPA is worth visiting. Boating on River Godavari is available in the Govt. Resort located next Door.The Food is above average and also includes local popular Dishes. The service is good. Weekends are crowded. Weekdays are best for quite relaxation.The sightseeing options include a visit to Antarvedi the sangam where Godavari meets the sea.All the staff including Mr Tulsiram, MrPrithviraj and Rajesh took good care of us.We enjoyed our stay and hope to return in the future.\n": "Positive",
                    "\nWe were stunned by the beauty of the resort. The rooms are built around a lovely lotus/lily pond. Some rooms face the backwaters of the Godavari river. The rooms and bathrooms are luxurious and well appointed, 5 star standards.The restaurant overlooks the lily pond. There is a wide range of cuisine available. The buffet had a very good spread. The food was consistently delicious. They offer certain packages which minimises the cost of dining. The restaurant staff was exceptionally efficient, helpful and friendly, especially the F &B manager, Mr Rajesh. There is a swimming pool, facilities for games and entertainment is organised in the evenings. One can go for a boat ride on the Godavari by booking with the Tourism guest house next door.Sterling resorts Dindi by the Godavari is a wonderful place to stay.\n": "Positive",
                    "\nWe were there for three days. Built around a lily pond, with an amazing view of the river godavari from the balcony one of the best sterling resorts. Choice of buffet or a la carte, delicious fare. Staff go out of the way to make you feel at home. No bar licence as yet, the APTDC resort is just next door which has a bar. The APTDC resort also has speed boat rides, jet ski rides and cruises for 20 minute and 1 hr duration at reasonable rates.Perfect get away from the madding crowd\n": "Positive",
                    "\nWhat a good place for relaxation I have ever seen. Food is also very tasty . Restaurant and room maintainance are clean. The beauty of river Godavari is very pleasant to see . Fresh air and relaxing swimming pool . The design of resort is very nice and river view and lake view very nice. Near by antarvedi temple and the place where Godavari meets the bay Bengal is beautiful place.  Must visit place in Andhra ...\n": "Positive",
                    "\nWhile planning the trip we noted Dindi By the Godavari as a new resort but still we decided to visit the place just because of name of sterling and we are really glad to tell you that we were not wrong. The interior at dindi sterling resort is absolutely phenomenal specially to mention beautifully cultivated and maintained lotus pond. The Hospitality experienced by the staff members is really humanly the last thing to mention is about our experience of House boat trip by APTDC which is remarkable experience of this trip.\n": "Positive",
                    "\nrecently went there with my friends and enjoyed a bit, its a cool place for kids but not for grown guys. but sure u will enjoy the swimming and boating rides they provide.... its a lonely place. nothing around it. thats a lil problem\n": "Neutral"
                },
                "sentiment_segg": {
                    "dindi": 0.25757575757575757,
                    "food": 0.5,
                    "godavari": 0.4166666666666667,
                    "good": 0.6363636363636364,
                    "great": 0.25757575757575757,
                    "manager": 0.21212121212121213,
                    "mr": 0.22727272727272727,
                    "nice": 0.21212121212121213,
                    "place": 0.4772727272727273,
                    "pond": 0.25757575757575757
                }
            },
            "zomato": {
                "Negative": 0,
                "Neutral": 0,
                "Positive": 0,
                "options_count": {},
                "sentiment_segg": {}
            }
        }
    }
}