{
    "parent_survey": {
        "meta": {
            "company": "Sterling Holidays Resort",
            "created_by": "5757ace0cc38e39671947a27",
            "id": "GMzwApkX24lQnvLNwBO",
            "total_resp": 247,
            "unit_name": "Villagio, Goa"
        },
        "responses": [
            {
                "avg_rating": 72.64,
                "cid": "9ca9c60c-587c-4848-8002-31708b5dcbf1",
                "label": "How likely, on a scale of 0 to 10, are you to recommend our services to a friend or colleague?",
                "options_count": {
                    "4": 1,
                    "7": 1,
                    "8": 1
                },
                "timed": {
                    "2016-06-17 18:29:21": {
                        "pretty": "7",
                        "raw": "a_7"
                    },
                    "2016-06-17 18:30:07": {
                        "pretty": "4",
                        "raw": "a_4"
                    },
                    "2016-06-17 22:19:24": {
                        "pretty": "8",
                        "raw": "a_8"
                    }
                },
                "timed_agg": {
                    "2016-06-17": 6.33
                }
            },
            {
                "avg_rating": {
                    "a_1": 3.72,
                    "a_2": 3.56,
                    "a_3": 3.76,
                    "a_4": 3.36,
                    "a_5": 3.76
                },
                "options_code": {
                    "a_1": "Cleanliness",
                    "a_2": "Room Service",
                    "a_3": "Value For Money",
                    "a_4": "Ambience",
                    "a_5": "Amenities"
                }
            }
        ],
        "sentiment": {
            "tripadvisor": {
                "Negative": 28,
                "Neutral": 46,
                "Positive": 173,
                "options_count": {
                    "\n1. Room:a. TV (funai) remote for USB operation not provided.b. Essential contact numbers near telephone in the room not provided.c. Should provide at least 1 flat pillow along with other pillows.d. I appreciate the effort to save water and harmful chemicals by encouraging customers not to ask for linen wash for 3 days. Afterall..do we wash bedsheets daily in our homes!?e. Voltas AC provided is very good.f. Fridge isn't good. Has no temperature control. Doesn't cool much.g. It would be good if they could have bedlamps as well.2. F&B:Many items are on menu but not available for example:a. Pasta spirallyb. Pasta farfelle.c. Caramel custard (with papaya coulis). (Dessert)d. Waldorf salad with walnuts. (Dessert)e. Few more items. 3. F&B:a. Staff does not know what is bebinca which is a very famous goan sweet.b. Staff doesn't know and they are not sure if Alfredo pasta sauce is vegetarian or not.c. In the menu, the item \"King Prawn\" is marked vegetarian with a green symbol!!d. Amazing crockery! Very impressive. I did not see this at Club Mahindra!e. Calls for room service are not always picked up promtly. They need a dedicated line and person for room service phone calls.4. Activities:Movie screening in the open air restaurant is extremely loud and disturbs all nearby blocks tremendously!!It was a real pain on Friday (19th Feb) evening when the movie \"kick\" was screened. I had to use ear buds to get some peace in my room.All sterling resorts have TT tables, carrom, chess, board games etc which is great and reminds us of childhood days when the world was not so commercialised and materialistic as it is today. Club mahindra in contrast is pathetic!!!! Almost no free activities and lots of money making racket in holiday activities/water sports etc.5. Villagio Office:The office door is just next to the public washroom at the lobby and a hazard for people who walk in or out of the washroom. 6. Call divert:After 8 or 9 pm, calls to housekeeping etc get diverted to reception causing confusion. They need to take ownership of which staff which handle what in off-peak hours.7. Taxi service:Betalbatim has good drivers. I recommend Menino (+919850874054). He has an Ertiga and very decent driver. Has USB port but no Aux cable :-( for music. They charge same for small and large cars..so make sure you book before hand with your preferred driver & car or you will have to take the first one in the queue. Make sure you always look at the fare chart kept in the taxi or else ask for the fare chart.8. Walk to the beach: It's a short 10 mins walk with an amazing view of the fields!!........just before you reach Nanu beach resort. Do not miss this walk especially in the early mornings. It's refreshing and rejuvenating.It's a safe walk back to the resort even after sunset..it's safe even though a little lonely. Make sure you carry a foldable walking stick or umbrella as you will be bothered by stray dogs everywhere. An umbrella can be opened so it is a better deterrent.Overall experience at Sterling Villagio was good. Sterling is known for a very homely environment and courteous & down to earth staff. F&B especially was very kind. Francis and the F&B consultant, many more.Vivek at the front desk was very kind too.I think sterling has a management issue and hence they have been taken over by Thomas Cook. Despite the new management, staff is grossly underpaid (as compared to Club mahindra etc).But sterling staff is still very sweet.Guests at sterling are great! Very humble and down to earth...carrying no \"false\" attitudes or stereotypes.\n": "Positive",
                    "\nA Very Nice Resort, Good Food, Neat n Clean Swimming Pool, Above all Good Experience.Worth Staying with Your Own Transport. Its Far from the city but very cool n calm place. As Our Stay was for One night It was a good Experience .\n": "Positive",
                    "\nA good resort, located at a calm place, away from city hustle.The staff is very co-operative. Even the travel helpdesk was very supportive.However, restaurant service and food variety was very poor.Few more indoor games for kids are need to keep the kids busy.Overall excellent place to stay and relax.\n": "Positive",
                    "\nA nice hotel with small rooms, the pool facing rooms are good. The food taste in ala-carte was better than buffet taste..Staff was very friendly Especially Mr.Rohit in front desk was interactive and helpful.As we checked in around 1.00am mid night the room was not ready as they were fully sold out he told that luckily a departure happened an hour before and said that he will get the room ready within 20mins as we were very hungry he comforted us in reception with some fresh juices and snacks..Should appreciate the roomboy who cleaned the room within given time..\n": "Positive",
                    "\nA small but well maintained property. Rooms are spacious and clean. Staff is nice and helping. Very near to Betalbatim beach which is clean and connected with other beautiful beaches like Colva, Benaulim, Varca and Majorda.However, this property is far away from most of the happening places of North Goa and taxis in this area are bit expensive. But one can get some good deal by hard bargain which we got. We paid INR 1700/- for south goa trip and INR 1600 for north goa trip. Best is to hire a bike from outside hotel (INR 250 for the whole day) and just explore south goa which is very scenic and beautiful.We just had breakfast at hotel which was ok. We didn't had any issues with room service etc. On our last day we requested for late check out at 2 PM instead of usual 10 AM and they agreed for the same without any charges.Overall good experience and value for money. Good for leisure trip. But if you like to explore goa night life, better to stay at north goa.\n": "Positive",
                    "\nA south Goa Resort in a serene atmosphere amidst coconut groves. Though a small place compared to the other Sterling properties it has all the basics of a resort. The staff are very courteous. Rooms are good and cozy. Food - well though the taste was good, the buffet spread is very poor compared to similar facilities. This has to be improved and a mention about the presentation both in the buffet and room service lacks professionalism and expertise. But overall experience was good. Nice arrangements by the Activities center in arranging for tours. Well done Mr. Saranappa.\n": "Positive",
                    "\nA very good location in South Goa. Perfect place for a holiday where you can relax and be away from the city noise. Polite Staff. Great rooms and great room service. I was out so did not get a chance for Lunch or Dinner. Had breakfast at the hotel and found the spread to be good but can be improved. The live counter with choice of Eggs was good and could order parathas and Dosas. Can't forget the Watermelon juice they offered which was nice and chilled. Overall a great experience and they made my vacation a memorable one. Thanks Goa Villagio.\n": "Positive",
                    "\nA very nice and comfortable stay of over a week. Prompt services..Warm hospitality...nice and helpful staff. A virgin beach ~betalbatim just 500 m away... It has a small play zone with many activities, nice swimming pool and a very relaxing spa. The food is very good. The staff is very cooperative. They were very helping when my son got sick.Over all a very enjoyable trip and comfortable stay\n": "Positive",
                    "\nAbout 800 meters away from beach, very clean and nice beach. You can see colva beach which is again 2-3km from this place. Property wise food, service, cleanliness everything okay but no lift so if you are on the 3rd or 4th floor its a tough job. Taxi service available outside the hotel only you can negotiate with them.\n": "Positive",
                    "\nAffordable, with reasonably facilities. Pool, Bar and Spa are the highlights. quick walk from the hotel and you are at the beach. Enjoyed the few days we spent there. Food was okay, nothing exciting, but the chef and steward made certain that we got special care.The reception people could have been a bit more welcoming, or is it not part of the affordable bandwagon?\n": "Positive",
                    "\nAfter 2Nights at Club Estadia,we moved to Villagio that is located very close to BETALBATHIM beach near Colva.Resort has a nice elevation and amazingly big roomsThe Doorman from Odisha wore a perma-smile and I complimented him on that.Vishnoo at reception and Bellboy RIZVAN were so helpful. The room was so big witha small Living space and a beautiful balcony. The AC was finding it difficult to cool the room.The resort has the most picturesque Pool with waving palms,bamboo and a rowof PARADISE flowering plant lining two sides. When you float on the pool you feel this is BALI or PHILLIPINES. The Holiday Activities has a snooker table and colorful walls with cartoons and has a fine view of the pool thro a large glass window. BALRAM takes good care of the HA Admin and manages to satisy all guests including naughty boys who demand all sort of Electronic Games. We had Karaoke all 3nights and many guests sang old songs and thoroughly enjoyed themselves.Food was Fantastic. The Manager Mr.Singh tries real hard to to coax the guests to go in for Buffet Combos,but smailes when you order ala carte. Magendran does a great job with the F&B service. The Bar just outside the restaurant is so nicely designed that you can either swing on thier barstools or take a table by the poolsideThere is also a Boutique next to HA but rates are far from reasonable. there are many cycles but they dont work due to corrosion.The walk to Betalbathim Beach is highly recommended and goes past the huge NANU Resort....high class stuff! But once you are there,take a walk (25min) towards the left to Colva Beach and indulge in shopping for Miami type shirts and bikinis.Again the MINUS POINT is the TAXI/CABS outside the resort. They are here to LOOT and unless you want to walk with your luggage you have to submit to their Demands. The Resort staff simply helplessly look the other way...MERCI !!!!!Madgaon is just 8kms and one can get a bus if you walk 1km\n": "Positive",
                    "\nAll karashoo,all very good and excellent.Enjoyed each sector,friendly and very helpful staff.Specially Abhijit and Peter.,Enjoyed Holi a lot wih Raindance.Will come back to Goa Villagio Again.Also want to recommend abou Sasha(FDoor man) and the Front Office staffs.\n": "Positive",
                    "\nAmazing property with wonderful decor and nicely appointed room. Entire stay & experience been extolled because of Marvelous hospitality, professionally trained team, extensive choices, sumptuous food with due customization on each request with amazing extension of connect by Executive Chef Binish Baby and due delivery by Mr. Menino. A must place to visit while in Goa.\n": "Positive",
                    "\nArrived late evening with lots of indian families as it was approaching the Holi festival. We got shown to our room which I was very disappointed with as I had booked the superior room, the room we got given was very small - one large bed which you could just about walk around which then led you to the small bathroom. Fortunately, I had printed off all my bookings and there was a picture of the room I had booked which looked nothing like the room I was given.Due to this, I complained at reception and showed them the picture I had of the room we were supposed to be staying in. I was told that the room had been decorated that's why it looked smaller, very strange that a wall must have been knocked down also as in my picture there was furniture surrounding the bed. As he knew I wasn't going to fall for such nonsense he gave me another key to have a look at another room, which we did and liked - funny enough it was identical to the room I had booked and paid extra for!!So we didn't get off to a good start and it certainly didn't help seeing dirty plates and dishes on the stairs on the way to your room, lots of flies and mosquitos hanging around too.Our breakfast experience was awful, there wasn't much variety and the other guests -Indians (we were the only westerners) appeared very disgruntled that we were there.We didn't go near the pool because it was either full of families or mosquitos!I would never go back!\n": "Neutral",
                    "\nAs one of the earliest Sterling Timeshare owners, I have stayed at Goa Villagio. It is not anything like what Sterling \"resorts\" are expected to be. It was built to be sold as apartments to willing owners that didn't happen. Then Sterling leased it and are running it as a so called resort. It is too small to be called that.And now Sterling has started a grossly unethical practice of refusing booking to genuine Timeshare Owners while letting it out en bloc to non-Timeshare owners - mostly Russians.They lie to timeshare owners constantly about \"non-availability\" of accommodation even 90 days before planned stay (when they open bookings). Despite their constantly saying that the resort is \"fully booked\", one could easily find rooms through travel websites - albeit at a huge premium. Sterling is shoving all Timeshare owners to north Goa - 50 Km away while they lease out the very owners' rooms at Villagio (in South Goa) to casual guests.Sterling Holidays' website says: \"All resorts in the Sterling Holidays network also have specially designed hotel blocks for the comfort and convenience of guests who prefer to vacation as a one-time hotel guest.\" There could not be a greater LIE! And now, they take a step forward to completely deprive genuine timeshare owners and run Villagio totally as a hotel. Why then do they call themselves as a vacation timeshare company and not a hotelier? This link will explain it better. fb.me/2rimPlJOR\n": "Neutral",
                    "\nBeautiful resort and it offered comfortable stay. Rooms are big and nice. Swimming pool is also nice and clean.Restaurant looked nice too.. although we did not have proper meals there but whatever we ate was good.. Betalbattam beach is at a walking distance. Overall a good experience..\n": "Positive",
                    "\nBeen there twice as a member. Beautiful resort. Good Swimming pool but deep. Rooms very nice and big. Main thing is Food. Never had such kind of food in Mumbai where I stay. Reception staff very co operative.\n": "Positive",
                    "\nBeing located in south, sterling villagio gives quite laid back feeling. The resort is new and rooms are well made. Pool is nice and they have also got a recreational room for kids, making it family friendly. Area around resort is very peaceful. Beach is not too far, takes few minutes by walk. There is a place nearby called Martin's corner, an authentic goan cuisine restaurant which is a must try!Talking about resort, Service is warm & welcoming, Rooms are modern and spacious, also cost effective. We had booked for a base category & were given an upgrade to suite complementary. Suites have got all the amenities & are pool facing. Breakfast was good & wide spread. Food is not too great tough. Overall it is a nice place, not too expensive. Recommended for families. Youth may get bored here as the place is away from city place & there are no happening places like night clubs arround.\n": "Positive",
                    "\nBetalbetim is only a short transfer and is ideal for people who do not want the hustle and bustle of North Goa. A short walk to the beach, the Villagio Inn, run by the Sterling Group can offer a middle of the road destination if you like eggs everyday for breakfast. No clean towels and insufficiently cleaned rooms, overflowing drains, which gave an unattractive aroma. After several complaints the hotel management, which were very slow to react to the concerns made some small attempts to rectify things, which ranged from lack of variety for breakfast, no bottled water, no clean cups, no fresh towels; as the room service made swans features on the bed while watching TV. After trying to displace us at 10am on the morning of our last day (checkout), as international check out is midday! The only facility available after this time was a cold shower, which my five year old didn’t appreciate as we had a long wait at the airport and 10.5 hrs flight home. The reaction of the hotel management to the concerns was very poor and mixed as some people seemed to get far more attentive treatment then others. Maybe it’s a little bit of “he who shouts the loudest” If you want to take a motorbike from outside the hotel then don’t pay more than 500 inr at the height of the season or 300 inr at low. You will enjoy the thrill of the open roads and you can get about relevantly cheaply. Mind the speed bumps and other travellers as there is no etiquette on the roads. The trips organised by the Hotel Reps are expensive and can all be duplicated by the local taxi drivers, who all speak fantastic English and can be hired all day for very little, 50 inr per hour (waiting for you to finish your excursions or shopping). Betalbetim beach is about 10 mins walk down the road from the hotel. It is fairly quiet in comparison to some of the other beaches in Goa. It has plenty of shacks or temporary eateries on the beach. Sea Waves restaurant, run by John and Simon and their wives is great. A family run establishment with great food at a good price. Zeebop, (beach shack), a little up the coast from Betalbetim in Majorda, is set off the beach a little. This is a great seafood lovers paradise. Albert’s, just down the road (you’ll pass it on the way to the beach) is also a good place to eat. Nanu Beach Resort can be accessed for meals, and has nightly entertainment, a little cheesy, but kids love it. However, Martins Corner, about 30 minutes walk or a 10 min drive from the hotel isn’t a great place to eat. The service was particularly dreadful . Having kept is waiting far too long for drinks and food and when the food and drinks arrived, it was awful. . If you want to travel around then haggle your taxi driver, to get a good price. Indian gold is also good value if you go to Margao and you must try the little packets of peanut balls, sold in the local shops, if you are trying to satisfy your sweet tooth. Colva Beach can get very busy, just a short 20 min walk down the beach from Betalbetim . It can get very busy with day trippers. Remember Sundays can get a little busy at the beach as it is a day of rest for everyone. The Waterfall trip is a nice contrast from the towns, set in the Wildlife reserve. You get in a jeep and head up into the hills, a bone shaking journey. Once out of the jeep you can feed the Monkeys, (don't read the signs on teh way up!) Take some bananas for the monkeys, but hold them tight. If you buy them at the start of your trip you’ll pay more. You can swim in the Waterfall, but remember the water is very cold. Going to see the elephants was also a great day out. You can get up close and personal, very impressive. If you have the time and money you can wash, swin and ride to your hearts content. Try and get out and about early, you'll see much more of the day as it can become a little uncomfortable in the midday heat. A great winter destination that will appeal to all, even if you have young children as it is a very friendly place, a little too friendly at times, but try and enjoy the cultural differences of Goa and look beyond the lack of infrastructure. Goa holds a great deal of charm. Local people are very helpful and always happy to help. Take a torch with you at night as the roadside lighting is not the best and some off the beat roads are not illuminated. It maybe an expensive flight but the cost of living when you get there, combined with the lovely fresh food more then compensates.\n": "Neutral",
                    "\nBig rooms, good food, nice bar. but goa is more about location. it is far from north as well as south goa. there is nothing at walkable distance. u got to take taxi for each sightseeing. un less you planning to stay mostly in hotel or play casino at panajim all the time :). try to avoid this.\n": "Neutral",
                    "\nBig rooms; Good food, Very good help desk executives, house keeping, room preparation team very poor, standard room facilities provided only after reminders. Very near to beach ( 10 minutes walk). Away from major traffic noise.\n": "Neutral",
                    "\nBut otherwise its the place to be when you are a couple going to Goa to chillaxWarm welcome, brilliant service....A little over priced restaurant...but thats ok to shell out when you get everything else at your easeThe only problem is when you need anything outside the resort...you will have to walk down quite a bit to get thatFood quality is good, Beer is cheaper when ordered in roomGets a little flooded in peak monsoon...but rooms on the 3rd floor are also very well done with modern amenities and superb bathrooms\n": "Positive",
                    "\nComfy place with spacious rooms. Good Buffet spread. Clean pool and plenty of eateries around the beach. One of the best hotels in South Goa. Rent a cab and one can visit Vasco, panjim, anjuna beaches.\n": "Positive",
                    "\nDon't prefer this hotel, as it is located way long from the happening places in Goa. You've to travel a minimum 40Kms to reach important beaches. We hired a bike and went to sightseeing in North Goa in the morning, while returning in the evening, we simply lost to find the way to hotel, as it is located deep inside a village (betalbatim). Though we were using google maps, because of bad signal, it couldn't help us to find the right direction and even direction boards (with hotel name) were not at all available (you'll find many boards of different hotels at every junction).Hospitality is poor. Service is also poor. Because of non-season, not many guests were there in the hotel and still, we have to wait good 40 mins to get our food after ordering it. Food is also very average, particularly south indians won't enjoy it. In the hotel prospectus, they've mentioned that internet connection is provided in every room, which actually they didn't and when I asked to use net connection for 10 mins at their lobby, they said it will cost 200/- and it is damn slow...\n": "Negative",
                    "\nDont Judge the Book by its cover - Very True for \"Goa Villagio Inn\". This popular proverb is very true in case of this place. Being a sterling member we booked this place with lots of hope. But the instances will give you a true picture of what it is and how they treat their guests.Some points to highlight:1. Ambience: Fair2. Front Desk Staff Behaviour: Poor. Specially the resort manager Ms. Irene. The entire staff was not able to speak in front of her like she is not running a hotel but a military hostel.3. Check-in: Extremely Poor, they took 3 hours to allot a room inspite of having confirmed booking 3 months in advance. We reached there from Karwar at 8pm and informed the resort twice that we will be reaching by late evening. By 9pm we were given a room no 404 and in just 30 mins we got a call stating that eigher we change the room or ele we need to pay Rs 600/day extra. Later they reduced the same to Rs 250/day. We dont know when we hada booking 90 days in advance andwe were pre-booked then why 404 was allotted and they why we were threntended to pay extra. After getting exhausted for entire day in site seeing and driving once reaches the hotel to take rest and enjoy, instead we were not able to go to bed till 11pm.4. Front Office/ Reception: The receiption is NON-AC and in summers when a guest travelling with 2 small kids is asked to sit for hours for alloting a room in heat, you can visulaize what it will be.5. Billing: We booked a 3 beded room, but we were asked to pay for extra bed as the 3 beded room was not available in the category we had booked. What is the use of prior booking if they can't block the room for the booking they had already done in advance.6. Room Linen: Not a tall clea, has lot of oil stains.7. Facilities:  - No lifts in the resort. Difficult for family and elderly people.  - Swimming pool was under maintenance for the entire week and every day they use to say it will be fixed today. Why can't they have courage to say it will be out of order for the next 10 days or so.  - No first Aid box: We needed the first aid box as my younger kid had abrasions from the visit to the beach and there were no medical store nearby so we asked from the front desk but we couldn't get that as the staff was most unresponsive. - We wanted coffee sachets in place of tea bags, but we were asked to pay extra @ 15rs per sachet as it was there policy to provide 2 tea bags and 2 coffee sachets. We simply asked to replace the tea bags with coffee as we dont drint tea but they simply refused and asked to pay for such exchange.Finally its not a resort which they claim to be. Will never visit this prioperty again!!\n": "Negative",
                    "\nEnjoyed our stay, the hospitality, quality of rooms and food. Excellent recreation facilities and value the money.Staff was very well trained and knew their job well.Only constraint it does not have lift facility, so if you travel with elderly insists on rooms in the lower floors. Preferable to have your own cab/travel arrangement because taxis outside are not upto mark and actually has a negative impact on the high standards already set in by the hotel.\n": "Positive",
                    "\nEnjoyed staying with family,had a great time at the resort.Housekeeping service was average but friendly staff.Betalbetim beach is 5 min walk from the hotel.Perfect hotel for those who seek peace and away from the city crowd\n": "Positive",
                    "\nEntry into the resort is welcoming by staff as well as ambiance, the rooms are very good and Big and especially provided to me was near to swimming pool, Activity room and Restaurant. The Buffet in breakfast was very good for those who like American breakfast with South-Indian combination. Both are my favorites and Buffet dinner is OK taking into consideration of menu choose. Activity room is also loaded with many games and only pool and cycling is chargeable and that too is very nominal. The swimming pool costume is must to enter swimming pool which is what we missed due to unavailability of swimming costume with us.Overall the experience was very good and staff were very co-operative.Note:- If you make your travelling arrangement before reaching resort, you will save much money as resort is around 8km towards inside from KTC bus stand( Main Bus Stand) and there is no public transportation available inside. Resort management and private taxi charge exorbitant money. We were only two people so hire a bike from opp. Bus stand and them went to Resort, If you have come to take rest and go to only beaches your total travel will not more than 50km in three days and visiting 10 nearby beaches & Hotels. BIke rent 350 per day due to long weekend can get in even less price.\n": "Positive",
                    "\nExcellent hotel at a peaceful location. Friendly and efficient staff and very well maintained. An extra plus for the cleanliness of the rooms. Pleasant pool area. The staff at vthe reception are wonderful and very helpful. Drawbacks were mainly connected to the restaurant that had adjusted the breakfasts to the many Russian tourists leaving us that want Indian food in India with rather limited options.Martin & Nighet\n": "Positive",
                    "\nExcellent location, beautiful surroundings, Courteous staff and clean and well maintained suites and rooms extend a warm welcome to every holiday seeker in Sterling Villagio. Sumptuous and tasty food, well maintained swimming pool, poolside bar and activity center are the added attractions. A very big thank you to Mr Bhaskar, Ms Saswathi and their entire team at Villagio for making our stay a memorable one.\n": "Positive",
                    "\nExcellent service.Very helpful staff at reception and else where.Rooms are very comfortable and kept clean. House keeping is commendable.Restaurant menu needs some improvement though Chefs and staff try to help .Vegetarian menu can be augmented.Beach is closeby and clean. Over all ,very good experience R N Mehta\n": "Positive",
                    "\nFar from the madding crowd just walk-able distance from a secluded Betalbatim beach is this great property of sterling. Like its name it gives you the feeling of being in a village. I believe a Goa trip should consist of only beaches, bars & pool...and Villagio is just the place for it. The rooms were excellent and so was the rest of the hotel. The activity centre kept the kids engaged while we adults enjoyed the bar and restaurant. The staff was friendly and warm. The drawbacks of the hotel include some majors like room service and restaurant service. Room service is poor i must say though the staff seemed very polite and prompt. But everything came with extra price, like water and coffee/tea, etc. Usually in hotels esp the star rated ones offer complimentary water and sachets of tea/coffee for the room. But here they provide just 2 500ml water bottle and 2 sachets of coffee/tea for the whole day. And if one wanted more then they have to order the full pack and not just tea or coffee. Which i found was ridiculous. Same goes with the water as well.Now the restaurant, they serve amazingly delicious food but the it takes equally unbearably long time to serve the order. Sometimes the waiter forgets to bring all that is ordered. If he does remember then probably the quantity is too little. The first couple of times we let it go but then it became a regular thing. Last we insisted we wanted to speak to the manager but that person seems non-existent. Every time we asked to meet him we were told he has left. So in short what lacks in that restaurant with probably the best cook in goa is a good manager.\n": "Positive",
                    "\nFirstly great ambience for a relaxed stay.Not sure if there were any signal jammers neither of our phones had signal, which I think kept us away from outside world. Probably a con for ppl who would expect call even during vacations.Secondly with the real high tariff, Not sure why wifi access wasn't free and the charges were not nominal though.Awesome pool and recreation facilities.Bar not upto the mark, Breakfast and Dinner buffet could have been better.Beach is at a walkable distance, but safe only during broad daylight.\n": "Positive",
                    "\nFood is awesome and at a decent price. Rucika and Mr. Singh in the restaurant make you feel at home. Very very curtious people. There is a small pool inside the resort. The rooms are spacious and service is good.\n": "Positive",
                    "\nFrom the staff at the reception to the rooms to the facilities, this is quite an average resort. The staff while checking in struggled for half an hour to complete the check-in process. The Studio room alloted to us was so small, one could barely move around. When we complained that the refrigerator was not working, the response given was - this is the best we can provide. The rooms have mosquitoes in them and there is no repellent. The food spread and taste is pretty average. The activities room is so cramped with everything, again there is no place to play table tennis or snooker or Wii.Overall, an average experience.\n": "Neutral",
                    "\nGoa Villagio is a 4 star property and is a part of the Sterling group of hotels. The property is situated slightly on the interior side though. However, it is very close from Colva Beach which is a very popular beach in South Goa. Rooms are spacious and comfortable. Staff is friendly. Overall, property is very good.\n": "Positive",
                    "\nGoa Villagio is affiliated with Sterling Holidays. Rooms are good and large. Hotel is very close to beach which is not crowded by people and clean one. It took lot of time to complete check in as they did not had rooms we booked. We had booked 3 studio apartment which can house 4 adults and one regular which can house 2 adults. They gave us one studio and 3 regular apartments. While checking out they made mistake in billing and took lots of time in rectifying. Food is very expensive. Buffet breakfast was Rs 400 plus and not worth.\n": "Neutral",
                    "\nGoa Villagio is located in South Goa a cool and calm place. Near to Betalbatim beach almost like a private beach, where you get privacy and place away from Mad rush. Staff and service are good. Has a well maintained pool and the restaurant menu was good. The items are priced slightly high, but ok during a vacation.\n": "Positive",
                    "\nGoa is a heaven for me. ...an amazing place ... i visited this place for the first time with my friends. And i thank god i got this place to stay.. .jus near the beach ...cool place to stay with a very polite staff ....tasty seafood... value for money... best hotel to stay in goa ....#1 in goa\n": "Positive",
                    "\nGoa is always my favorite place for holiday destination and if the Hotel is Sterling then no other place can beat this as when we talk about true hospitality,moreover I would like to thank Ajay in House Keeping for making my stay comfortable beyond my expectation.I am allergic to dust and while check in I have told him to take care of this till my check out he really did a wonderful job.My room was done so well.I must say such staff are asset to the hotel.I strongly recommend this hotel where staff really think for their guest.\n": "Positive",
                    "\nGoa villagio Villagio is recommended if your looking for a good break with friends or family. The ambience is good, quality of food is awesome. My friends and I enjoyed the good service of the resort and the hospitality of the hotel staff is commendable. Overall a good place for a holiday!\n": "Positive",
                    "\nGood & large Rooms. Very clean & far from the maddening crowd. Around 3 kms from Kolva beach. Swimming Pool is clean & very good.Nice indoor activities like pool, table tennis, video games, carom etc. Excellent restaurant too.Overall an satisfying stay.\n": "Positive",
                    "\nGood for families and couples.If you are the partying kind this being in south goa is not the place.But if you are looking for beaches with less or no crowd.. easy holiday with good food.. this is the place.\n": "Positive",
                    "\nGood memorable experience. Staff are extremely good and good food. . Rooms are maintained very well and give a nice view of the village. Walking on the village roads gives your feet a nice massage. Definitely would like to go there again anytime\n": "Positive",
                    "\nGood place and ambiance, food good. 10 min walk to beach, with clean white sand.Need to improve on price for quality in restaurant. Improve indoor activities. need to have spa or club.Vehicle rental are very expensive. Need to have own vehicle to go around.\n": "Positive",
                    "\nGood property to relax near to beach 700 mtsgood and friendly staff 1.2 km to colva beach from betalbetim beach walkingbut no shopping area or night life nice place to relaxgood food but slightly costlier\n": "Positive",
                    "\nHad been to Villagio in 2nd week of May. Stayed for 4 days. The resort is very good. We took room facing swimming pool, room was very spacious and clean.Overall experience is good. Service was v good and the pool was clean.One -ve thing is food is too expensive, for one time you have to spend nearly 5000/- for a family of 4 which is exorbitant. Parking is not enough for the resort\n": "Positive",
                    "\nHaving seen some of the mixed reviews we visited Goa Villagio with some apprehension. We were a family of 4 adults and 2 Kids, and we had requested for adjacent rooms and though it was a long weekend Ms Saswati Gogoi was kind enough to accept our request by providing both Studio Apartments... Well more than a 'Studio Apartment' it was more of a 1 Bed, Hall Room with a huge Hall and an equally big Balcony and it had all the aspects of a 5 Star property. We were very happy with the pampering received by the resort. The rooms were well ventilated as well, and since this is in a secluded place,its quite secure and quiet as well.This hotel has quite knowledgable front desk and they have the most knowledgable security personnel Mr Sushant Sahhu who knows 5 Languages including Russian, Swedish, Ukrainian etc., and knows the state in the back of his palm and is able to help every guest with a big smile written on his face.It has a well maintained pool and also a decent indoor game area... The best part is it is close to one of the most secluded 'Betalbatim Beach' which is less than a 10 minute walk, where we can have all the privacy and also a great places for sunset. The Beach has quite a few 'Beach Shacks' as well. The property is also within 3.5 km from Colva Beach where one can go for various activities including Parasailing, Dolphin Sight Seeing etc., For the die hard vegetarians there is Sagar Kinara Restaurant which is close to the Colva Beach.Overall this was a very enjoyable experience for us as a family.\n": "Positive",
                    "\nHaving stayed at the Villagio Inn on 4 previous occasions and found the rooms excellent and staff friendly, accomodating and helpfull specially Shushant the door man and Menino (food and beverage manager), we were deeply dissapointed by the reception and communication when trying to book again. Despite Emailing both the Villagio Inn and Sterling holidays regarding availability we did not receive any replies; Therefore booked at another facility in the area (which was good). Whilst in the area we called into the Villagio Inn to find out if there was another address or way of making contact regarding availability and bookings. We found a complete change of desk and door staff, none of whom were as good or helpfull as in ourpast experiences. We eventually managed to explain to desk staff our enquiry and were asked to take a seat where we were left in excess of 20 minutes with no explanation (we were offered a glass of water). Due to the staffs lack of interest we eventually left the premises disappointed by the lack of interest and helpfulness. We find this a great shame for what was once excellent and our preferred hotel we would now not recommend.\n": "Negative",
                    "\nHello,We are pleased to inform you that we stayed in your resort at the below dates, however found it very pleasant specially the below listed staff, they are found to be very mannered and helpful, however with these people my trip to GOA turned to a special memory.Neelu, Sulakshna and Shashank from front desk, Clandon and Captain from restaurant, Kanu from security.Your meal and ambiance is absolutely amazing however you people need to work more on your room service.I will recommend this resort to my friends and family too...\n": "Positive",
                    "\nHorrible place, Rooms not up to the mark. Taxi drivers in campus are very very arrogant. Senior citizens be careful, AS THEY DONT HAVE LIFT. YOU HAVE TO CLIMB UPSTAIRS FOR YOUR ROOM.For basic aminities even you request you dont get, you have to BEG. Illumination in Bathrooms almost Bathrooms are dark.Please dont go by Photographs, TV/AC without remote. Beach is no where near to the resort, You have to walk. Beach is unsafe.\n": "Negative",
                    "\nHotel is situated in a remote village called Betalbatim away from the din of fast paced MumbaiBeach is just 5 minutes walkA silent beach with many Russian tourists swimming in the seaVery safe to swimWhite sands and blue waterHotel staff very helpfulFood excellentAmbience niceOnly hitch was housekeeping which should be dealt with by the authoritiesWe had to call many times for small things like sugar coffee etcIf someone wants a getaway amidst white sands and blue water sans the crowd this is the place to stayWould love to go again\n": "Positive",
                    "\nHotel location is very far from main city but that is not the problem, problem is of local conveyance. The local taxi people has a union and do not allow call taxi to enter there. I paid 600 INR to just 12 Km. Very much loot. Come to the stay....it was ok type as bathroom had a leakage problem through shower point which was resolved after so many follow up. Now come to food in buffet...I stayed there for 3 nights and menu was same for all these days. I was shocked to see this and it was very limited. Service inside the dinning hall was very poor as if you ask for a glass of water you will get once you finish your meal very bad. Morning breakfast was worst...tea quality was much poorer than road side tea shop.\n": "Negative",
                    "\nHotel looks great with lots of attention to detail in the gardens, restaurant and public areas. However, the Attention to detail stopped there. Rooms were spacious and clean and worthy of five stars at first glance. As the days went on the loo roll was not replaced when empty. towels hadn't been changed. When clean towels were requested only one was changed.No hand towels. Bed Linen change was requested a couple of times to no avail. Eventually getting sheets from some poor guy at house keeping who didn't seem to have a clue and we changed the bed ourselves. Constant housekeeping requests were either ignored or half done.If housekeeping improves this would be a great place to stay but couldn't stand the same linen for two weeks! Friendly staff, location was perfect, local restaurants, Beach with plenty of quality shacks all a stones throw away. Silent Nook in particular was outstanding, Rocky and Sumit were great. Albert's place on the way to the beach beats Martins Corner for food and service too.\n": "Neutral",
                    "\nI am a member of sterling resorts. after having bad experience in mussoorie resort we find this resort is much better. We had stayed in sterling from 12 to 14 and 18 to 19 march in a studio room which the resort people called deluxe suit room, was big enough, comfortable and clean. hotel staff is very helping and caring. miss roopali and Mr. manjunath on reception are very helpful. they allow us to late checkout on the last day of our trip as our flight timing were about 5.30.Pool was good and highlighting the beauty of the resort. most of the guest in resort were foreigners. we took food masti package which is around Rs.575 per person + tax for breakfast & dinner which was quite reasonable in concern of Goa. breakfast was good but dinner was not for Indian guest. as we are vegetarian we find less options for us. you should include few vegetarian Chinese dishes in your buffet dinner menu.i want to give suggestion to the sterling people at Chennai office that they should inform in their resorts if they launch any offer. like when we book our holiday they told us if we pay utility charges (only member has to pay) in advance they will give 5% discount on that but when we reached, resort people were not aware about that. as you provide 2 mineral water bottle per day ,you should provide complimentary internet service at least 30 min. per day or charge nominal cost. you people charge Rs.100 for 1 hour which is not reasonable at all. we deposited our utility charges with taxes at Chennai office and as per our confirmation voucher no dues were pending towards anything but while we checked inn resort people introduced govt. of Goa luxury tax which was Rs. 100 per day per room, which was like an harassment because we already deposited all taxes and utility charges at Chennai office. resort location is far away from main tourist location like benaulim and colva beach but we didn't find any problem as we hire Honda activa scooter at Rs. 200 per day cost in front of the hotel. overall good experience and finally on the last day of our trip \"Manjunath\" smiles.\n": "Positive",
                    "\nI am a sterling member for 99 years and after many years I used the membership in 2 resorts. But Sterling Villagio was exceptional Mr Ramesh Ramanathan has really done a turn around. Villagio is a safe place for families I have 2 daughters and this hotel is run by ladies who are so gentle warm and helpful right from Neelu Edrea and the resort manager Irene. Would 5 star hotels give woman this opportunity. Mind you all the other staff is courteous and helpful. Our bathroom was clean evening's we would have different towel folds. Recreational activities were great. One must ho to the beach to watch the sunset. Only concern was the taxi stand who did not compliment with the resort. Will visit soon kindly allot 404 and 403 to me. Thank you for a memorable stay .\n": "Positive",
                    "\nI am staying here with mr family.... The room is nice & clean, pool water was crystel clean & here is mini pool also for kids, & also play roon for kids.. Overall nice place to stay... Staff is very freindly specially the gate man susant... Only one negative drawback is taxi from outside hotel is twice price than market price...( they are private taxi not belongs to hotel)\n": "Positive",
                    "\nI came here on 20th January, 2016 with my wife on our honey moon trip. The place looked good and had facilities. However, we weren't satisfied with the room given to us. It was at the 3rd Floor without lift and at the last corner building of the property. The food was really good and service of the hotel staff was very good. Overall i would say it was a average stay.\n": "Neutral",
                    "\nI can not complain, the hotel is nice. But we have two issues: because of the monsoon and because the room was in the base floor, the room was smelling humid (despite the room was good). Also, we were near to the swimming pool and all mornings early in the morning, kids were playing into the pool what made the resting part kind of shorter...The unlimited breakfast was also not really unlimited: no gas one day, no fruit other day...Small things that could make our stay better.But in general, the hotel is nice with a kind service and in an area perfect to take rest.You can find a couple of good restaurants in the area. Ask to the staff.\n": "Neutral",
                    "\nI had a really good time staying at this hotel. Its in a quite place and close to the beach. The hotel is clean, the staff is courteous and the rooms are nice. I would recommend everybody going to south Goa to stay here.\n": "Positive",
                    "\nI had booked this through goibibo deal price for Monday and Tuesday on long Republic day weekend. Complimentary breakfast buffet is good. Swimming pool is above 5ft and kids pool is tiny with 2.5ft.So, non swimmers can not really enjoy or relax in pool unless they are of 6ft height. My wish was not fulfilled in this regard. rooms are very spacious and clean. Nearest beach 1km walkable during day light. South goa famous Colva beach is 3km. Though Goa is friendly city, lone couple should be little brave to ride bikes at night in that area but definitely better than vagator and Anjuna beach areas of North goa. You have sufficient Street light on way to Colva beach, though it is secluded place. If you get a good deal price and alighting at Margao, Madgaon , it is a good choice, if you have your own or rented vehicle. You can avail rented bikes in either madgaon station or margao bus stand or Colva beach. Even travel desk of hotel can arrange but little costly. being a resort, it has recreation and games room. You can also rent a bicycle at hotel at 100 per hour. Try also candle light dinner at Colva or bathalbati beach side on any shack at night for memorable experience not too expensive than normal restaurants. Being a holiday resort rather than hotel, they will try to charge you for each and other auxiliary services like printing tickets etc.\n": "Positive",
                    "\nI hav visitd this hotel recently....i was surprised after reading so many negative reviews...I am a frequent visitor of goa and have been to most of the top hotels...i would like to say that service in this hotel is one of the best available in goa....ambiance is very peaceful...room service is prompt and the demeanour of the staff is unassuming and very pleasing...all the staff members are always ready to serve you....food is good quality and very hygienic...i would like to become a permanent life member of sterling and visit this place everytime i come to goa...\n": "Positive",
                    "\nI have been there with my family. The services and food are very good. They serve both veg and non veg. This is also close to the beach, walkable distance. They also have mini library, carrom, TT etc. The swimming pool is very clean. They staff are also very good. They display the event at the board and then you can participate. Once again, it is for relaxed vacation. Please do not expect any adventurous events or activities.\n": "Positive",
                    "\nI have been to several Sterling properties across India and this one in Goa has to be one of the best. The rooms are neat, well maintained, the resort provides good indoor games and a well kept swimming pool. One big concern I had was the bar closes at 10 pm which is ridiculous for a city like Goa. Room service is decent but you don't get anything after 10 pm. The food menu is also pricey. Overall, a good place to stay with family.\n": "Positive",
                    "\nI just returned from this place and the stay has been very memorable. The hotel is located very near to beach. Beach is just 10 min walk. The check-in was very smooth and quick. The receptionist, Roopali, accompanied us to our room and patiently explained about the amenities available and what amenities were charged and what were complimentary. We got the room with two balconies, one balcony was facing the garden and the other was facing a building within the property. The garden view was good.The room service was very prompt. It never took more than 5 min for our requests to be attended by the staff. The 1st day, we noticed that the remote's batteries were down. We called house keeping and batteries were replaced in hardly 5min. The food was very tasty though it was a little expensive. If you can't find the dish of your choice, you can ask the chef to make it for you :D. The bar was also very good. The room was cleaned and the sheets were changed every day. The beers in mini bar were nominally priced. Bathroom was very spacious and clean. Complimentary bathroom accessories like shower gel, hand wash, shampoo were provided and these were very good. There is clothes line in bathroom, so we didnot have problem drying our clothes.The room was very spacious and very clean. There is an electric kettle with complimentary coffee, tea and milk powder sachets. These sachets are given every day but extra sachets are charged nominally. If you drink herbal teas or green tea, you can easily make with the kettle given. There is an electric safety locker in the ward robe. You can set your own password or use credit card as key. The mini fridge was working properly unlike in our previous hotel. The LCD showed all major Indian channels and few foreign channels too. HDFC ATM was near hotel and is just 2 min drive. There is also a weighing machine in room :P. The staff was very patient and helpful. We once had a little problem with the shower. The water was too hot. We called the house keeping and it was attended to immediately. With in 10 min, the problem was solved. Also, in the final bill, one extra beer and extra food charges were included. The girl at the reception, Monisha, promptly attended to this and these were removed from the bill. I read in several reviews about power cuts in monsoons. There were power cuts here too but power was restored within few seconds.The pool was well maintained. There are indoor games like carroms, chess, PSP, table tennis etc in the hotel. It also has toys for kids. The day we were checking out, there were 28 check-outs. But despite this, our check-out was smooth and hassle-free.Just be a little careful when using the bikes provided at the hotel. They arenot maintained properly. So it is better that you carry your driving license and get a bike from elsewhere. Also, the place has no elevator. So be careful to book ground floor rooms if there are any old people accompanying you.Albert's Place is very near and great food is served there. The guy there, Irfan, is very friendly.On the whole, I loved my stay here and would definitely come back again.\n": "Positive",
                    "\nI loved my stay at Sterlings last month. Went there for a week's trip with Family.Easy to the pocket and great experience. The staff is very cordial & food was good too!Good Job! Will surely recommend it to my friends.\n": "Positive",
                    "\nI made booking for Villagio-Goa resort for 2 nights ( 28/29 March) . We have booked this room 2 months back and got confirmation for MMT but hotel simply denied entry to us stating rooms are not available due to some maintenance issue. I requested the Manager to show us what maintenance issue they are facing but he bluntly asked us to leave the hotel. Hotel Manager, Manish , was very rude even with the ladies in our group ; and did not even bother to understand our situation . This was the worst experience a customer can expect from 4 Star hotel. I request all travelers to please think twice before booking this hotel for your next trip.And If you book , Please check with Hotel thrice before reaching to the hotel.\n": "Negative",
                    "\nI stayed at Goa Villagio and I enjoyed my stay .Warm friendly team which make the place special good rooms/food everything is excellent . one needs to stay here to experience peace and tranquility. I will come back Pasiba Harasho Goa Villagio\n": "Positive",
                    "\nI stayed at this hotel in June first week for 4 Days, we chose this hotel from SOTC box holidays. This hotel is just 15 Minutes drive from Madgaon railway station, around INR 400 by Prepaid Cab from the station itself. Its nicely tucked away in the south goan countryside, accompanied by Betalbatim beach (5-7 Mins Walk), Albert's Place-Nice Goan Restaurant (2Mins) and Seawaves Shack on the beach; Thats it! It is nicely hidden away amidsts Coconut palm trees and Farm Fields.The rooms are decent as well, We stayed at Luxury Suite. The suite was pretty big and well furnished. The housekeeping was very active and they cleaned our rooms at regular intervals and got us things that we wanted in a jiffy. The hotel also has a nice clean pool with Sundeck and Gazebos; and yes! you can also order drinks at the poolside. Do order a Yellowtail White Wine at the poolside, its superrrb.Breakfasts was nicely spread and Fresh.My stay at this hotel met my expectations and would like to stay here if in south goa.\n": "Positive",
                    "\nI stayed here for two nights during a recent visit. The room was booked by a friend who was getting married. The rooms were on 2nd floor with no lift in the building but the room itself was very clean and comfortable. However, the service needs real improvement. I called the guest services for an Ironing board and iron which never came. The check-in was an issue with no one having any clue on our bookings while details were clearly there.The property itself is good with a decent pool. The breakfast was okay but not remarkable. We ordered for a biryani for room service which was nice though. I took a Wi-Fi package which gave a good speed. Overall I would still rate the experience as comfortable.\n": "Neutral",
                    "\nI stayed in this hotel for 3 days property is good rooms are clean we had problem of room clean first day but second day no problem nittin was there to help us I wanted to celebrate holi but I have leave hotel on 4th food is good and the location quite place very near to beach.out you get scooty for 450 rs per day enjoyed a lot in goa\n": "Positive",
                    "\nI stayed in this resort from 29th April 2014 to 2nd May 2014. It is a good property, well maintained with a very helpful and charming staff. All my travel and sightseeing was taken care of... Willfully recommending the resort for a short vacation....\n": "Positive",
                    "\nI stayed with my wife for 2 nights in may 2012. The moment we hve entered, I felt amazed, views was nice and reception was well orgonaized, staff ws very helpfull. Excellent food and room service but, i would say facilities inside room was not up that mark, specially aircon, which was not working properly. they sud improve room facilities. Except this, we had a great time in that resort. We got motor bike on rent fr local sight seen, this motor bike was available just outside the main gate of the resort. swimming pool was big and one can relax a lot in that area. the bar and restaurant near to pool is really awesome. its better to book pool facing room for more fun.\n": "Positive",
                    "\nI travelled with my wife for new year eve and it was a pleasant visit. And the best part was the beach that is nearby to the villiagio inn resort. Away from crowds , this betalbatim beach and the resort is best place for anyone who needs to have a pleasant peaceful vacation. On second day of our visit, we have planned to visit North Goa(Baga beach) but regretted after visiting the place as it was too much crowd on new year day. New year eve dinner at resort was nice one. There is a restaurant named Martin corner nearby to the resort(around 1.5km) which was really good. Had awesome ambiance typical to Goa and food was also good.Resort restaurant is decent. But cost is slightly on the higher side. Swimming pool is clean and well maintained.Shacks in beaches nearby to resort is also good. There are watersport activities also in those beaches.Cons:Resort should take care or atleast help customers for 2 wheeler or 4 wheeler rent/hire. As we were charged Rs.1000 per day for 2 wheeler which is crazy. But as the place was remote we had no choice. Reason we were told is it's peak time and hence charge is high.\n": "Positive",
                    "\nI visited Goa last month with m cousins. We wanted a good hotel in south Goa. We found out about this hotel, which has an affiliation with sterling holidays. It is an expensive hotel if you do not have a membership. But with a membership you just have to pay the utility charges. It is a brand new property. It is just 800 mts from the beach. The rooms are awesome and the bed are very very good. They have a swimming pool, and a restaurant where the food is very good. You must try the Chicken Tikka Masala. The staff is friendly but a bit inexperienced. The service was a bit slow. But over all it was a very nice trip. I would definitely recommend the hotel.\n": "Positive",
                    "\nI was told that the Villagio pool is under maintenance untill 30 Sept and this is very disappointing. Sterling should have planned the maintenance in off peak time and avoided maintenance during the holiday season due to dasara.I am booked at Villagio from 27 Sept to 1 Oct and it would be a shame to not use the pool as the kids are looking forward for it.I would booked your other resort of this was told to me upfront. Please plan your maintenance per customers convenience.Absolutely Disappointing!!!!\n": "Negative",
                    "\nI went and Stayed at Goa Villagio a sterling holiday resort as a part of our office offsite in July 2014. Since, it was an official offsite, I will not be able to comment on the price. However, my colleagues have said that we got a pretty good deal for a full-board stay at the hotel. Now, coming to the hotel. The hotel was a lovely place to stay in Betalbatim. It has lovely layout ensuring that each room is not far away from the in-house restaurant and pool. The pool is a medium sized pool that is clean and the hotel also has a games room. The best aspect of the hotel was the rooms. We stayed a room that was near the pool. It was a huuuuuuge room that had two balconies-one overlooking the balcony and the other overlooking the garden of the next door. The room was just like a 5 star hotel, cosy, comfortable and clean and one could just spend time relaxing in the room. The bathroom was also the star, it was huge and spotless.Being in Betalbatim, we ate at the Villagio's in house restaurant and the food was good, nothing to right home about. I have to make a special mention to two restaurant staff - Ashish and Vandana, they were always extremely polite and extremely helpful and also quite friendly to all of us. In fact, almost all the staff at the hotel was nice and friendly. The beach is just a five minute lovely picturesque walk away. Being in Betalbatim, you have to go to madgaon for shopping and eating at other restaurants.In short, the Goa Villagio is a lovely hotel to stay with the family, if you are not looking for hectic travelling and site seeing and looking at spending more time with the family.\n": "Positive",
                    "\nI went there with my family in December(since we are members I didn't need to think about the expensive hotel rates ;) ). We stayed there for 2 days n 3 nights but people there left a long lasting memory. I think memories make your trip worthy.I am not paid to write a great review about their service but I must say the service and the attention they paid to each and every member staying at the hotel was amazing and worth mentioning. I usually don't write reviews about any places but this time they forced me to write so many good things about them. Right from the doorman(who kept saying Namaste every time he saw us:-) ) to the receptionist to the holiday activity center guys, restaurant people, every one ensured we had a great time while we stayed with them.A special mention of Mr. Bhim Singhji & his team who treated us like family and ensured we got to eat the best...hehehe.I also want to mention Mr. Satya ji (though I missed his magic show) and another gentleman(i never asked his name) who taught me glass painting.After staying at Sterling's property in north goa (btw I hated that place and people there) Villagio and their staff really impressed me. Although Villagio doesnt offer market areas or any other exciting stuff but I guess thats coz its the south of goa...hehehe, but it does have a beautiful beach at a walkable distance of 10-15 minutes.I am writing this peace to ensure other fellow vacationers like me don't end up biased about south of goa & sterling's property there. Just visit this place to get an amazing service\n": "Positive",
                    "\nI'm a sterling member and had taken guests along with me to this resort. The room service is really bad.would advise u all to carry your own mosquito repellant as inspite of repeated reminders to the room service we were not provided with one and were told that we do not have enough. When asked for dustbin in the bathroom for disposing the tissues, I was told to use the dustbin in the room. Never in my life I have come across such replies.\n": "Negative",
                    "\nIam a member of sterling holiday resorts stayed in sterling villagio during the course of last week of May. To my surprise the resort is very well maintained, the service was really very good, we have to take 10 minutes walk if we need to go to beach, the beach is very good with safe zone and watch guards on duty. The main area of Goa Calancut beach, Anjuna beach and other tourist spots are very far away, which is around 40 kms from this place. It costs around 2000 by taxi during off season, I was told in season it used to be 2.5K to 3k. Thier breakfast buffet is not that great, there is no idly or dosa only sambar was available. Their lunch buffet or dinner buffet costs 450+ is not that great. The only flip side of sterling holiday resorts is their food bill. It costs at least minimum of 350 to 450 for a Non veg if u are ordering from their menu card. Per session it costed me not less than 2500 for my family of four.I suggest sterling to drop at least 30% on their food bill. Reg. the quality of the food i would say its really outstanding but the quantity doesnt justify the price they ask for. A King fish costs around Rs.450 but you get two small pieces. I hope sterling listens to this. Except the expensive food bill every thing is great in Sterling. One small note for sterling holiday management reg. thier swim pool. The swim pool depth starts from 5 ft and ends up with 8 ft. It will be very difficult for the tourist to use such a deep pool. Especially ladies will find it very very difficult to use this pool. I would request sterling to start from 4ft to 6.5 ft max.\n": "Positive",
                    "\nIdeal place to stay in south Goa. Betalbatim beach is the nearest beach about 600m from the resort. Colva and Majorda beaches are also easily accessible. We were given a pool facing room on first floor on our request. Room was clean and spacious. Staff was also caring and supportive. One can hire a taxi or two Wheeler from outside of the resort for going to beaches and sightseeing.\n": "Positive",
                    "\nIf you are looking at some time away from the crowds this is the place . I am a avid international traveler and this has been the most relaxing trips . Excellent pool ,clean resort , smiling and helpful staff . Some small things though you need to keep in mind . 1. NO LIFTS so choose first floor as Ground floor tends to attract insects & pest.2. No shops nearby and beach is 600 meters away so need your own transportation . Taxis are expensive and controlled .3. In room service is expensive so get your own snacks as there is no kitchen ( which timeshares are supposed to provide - that's how they sold us one ). 4.Tea kettle is provided and 4 each of Tea bags , coffee and sugar are provided complementary along with 2 half liter water bottles rest is charged. Fair enough , they inform in advance.\n": "Positive",
                    "\nIf you are looking for very silent resort.This is the best place for you.The beach is 10 min walking distance.The resort and around the resort atmosphere is very calm and silent.But if you are looking for happening place so big No.The rooms are very comfortable.But pool is very deep.If you so tall above 5ft6 inch then only you can go to pool.Otherwise overall it is good resort.Front desk and all the staff is good.The breakfast is also very delicious.\n": "Positive",
                    "\nIn our last twenty years holidays , this is one of the WORST Resort. Welcome drinks unberarable. Without any information they demanded family members identity card. The room and the house keeping is good. resort not even provided soap. No shops are near by to buy the soap. No question of Shampoo. Variety less retrarunt.Tastless food and very very costly. Swiming costume is a major issue. I can pile up like this. One unfortunate thing was I am the member of Sterling . This is my welcome Trip. My sincere advice Kindly not to select this resort\n": "Negative",
                    "\nInitially I booked the resort because I din't get booking at the other sterling property in Goa. The resort is located in the south side of Goa which is far from the crowded beaches like baga , Anjuna etc but this works to our advantage. The location is so peaceful and serene and the resort seemed renovated recently by sterling. Overall the resort is perfect for a peaceful gateway away from the hustle and bustle of the city. Please don't stay at the hotel if you plan to spend more time around baga, Anjuna etc beaches\n": "Positive",
                    "\nInside hotel premises, it is good.bt outside hotel it really to say good no. Beach is around 7 mins walk. Cab and local transport at this location is almost double than other parts of goa due to local union problem. Food and ambiance restaurant is really good. If you are in goa for leisure, then only prefer this. Otherwise please prefer city hotels.\n": "Negative",
                    "\nIt is very nice and well managed resort. This is a place for person, who likes to live close to crowded North Goa but wants to feel peace of South Goa. Need improvement on food quality specially breakfast, where more options should be added for Vegetarian.\n": "Positive",
                    "\nIt lies amidst beautiful n coolest beaches with excellent staff service in d most appropriate location. Ms. Saswati ; manager; at d resort is most helpful who made our stay there very comfortable n memorable. A big personal txs to her. Also Mr. Sham who is heading travel desk n various holiday activities; helped us immensely making our travel plans wisely. Its a must visit place for everyone who wants to visit southern Goa. My perfect 5 star goes to this resort; ultimate one.\n": "Positive",
                    "\nIt was a great experience at Sterling's Villagio. It is a beautiful property with all the modern amenities. Nice pool, with a separate one for kids, restaurant with good ambience, bar in front of the pool, activity area for the kids and most of all a very helpful team of people with a please all attitude.Of course since it is in South Goa, you are sitting around 40 kms from Panaji. But again Colva Beach is just around 4 km where you find all the water sports.A very good option for someone who just wants to relax.\n": "Positive",
                    "\nIt was awesome experience being in Villagio. Staff was very supporive and are serving well.Being Jain they have provided us with awesome food quality, we loved alot. Special Thanks to Chef who made all dishes Jain for us.Place is very postive, and will love to visit here again when we will return to Goa for more fun.\n": "Positive",
                    "\nIt was family trip for one week. It was memorable experience @ Goa Villagio... Quality of service and comfort was excellent..Staff co-operation and guidance was very good. Transportation can be arranged from resort itself since outsiders are too costly... over all experience at the resort is awesome.\n": "Positive",
                    "\nIt's a good hotel; little away from crowd.. Beach is just around 800 mtaway. You can have good time with your family on this peaceful beach. Good food, service & staff. If you want to enjoy some water sports, Colva beach not far away, but it is too crowded.This was my 8th trip to Goa, but for the first time we stayed in south Goa. I think south Goa beaches are more beautiful than north ones.Overall, we had nice time in south Goa.\n": "Positive",
                    "\nIts a new property and hence everything is spick n span. The pool is very clean. But min depth is 5 ft and surprisingly no life gaurd and hence kids to be taken extra care of. Management would be advised to put a lifegaurd on duty immediately.The rooms are superb...all the stuff that you would find in a typical 4 star + property. Staff are very courteous and helpful. The restaurant I must say is not all that happening. I found it to be a very dull place. Food is also average.May be another area of improvement. But then why complain when martins corner is just a 20 mins walk away!Just to summarise:Resort: 8/10Rooms: 9/10Staff: 7/10Restaurant: 5/10Swim pool: 8/10Betalbatim beach is a 10-15 mins walk.Colva beach/market is 4-5 kms.Would like to stay in this resort in future again if coming to south goa\n": "Positive",
                    "\nIts a nice clean resort to stay in. The rooms are comfortable and have all the basic amenities. The restaurant has both al carte and buffet. Though the buffet menu is limited the food is tasty. The beach is walking distance from the resort. Quiet non crowded. The weekend we stayed the resort had several only males staying. Its really odd that a family resort would take a booking like this. It should not have been accepted as it made the other guests uncomfortable.\n": "Neutral",
                    "\nIts a really good resort to spend some good time in GOA.In shorter its a value for money. It is located at a peaceful South Goa location. Nearby beach is Colva beach which is far superior and less crowded than North Goa Beaches. Although North has its own good things and they can't be missed but it is the south Goa which will give you the real Goan feel. Villagio is a well maintained ,neat and clean resort.\n": "Positive",
                    "\nIts a very well maintained resort. Not very close to market area so its really peaceful and very close to one of the unexplored beach of Goa (Betalbatim beach). Its just 10 mins walk from Resort.The rooms are spacious and very clean with a small balcony to it. Room as TV, Mini Fridge, a wardrobe as well. The service was really good and the Staff was very courteous and helpful. They have a kids pool and big pool which is very well maintained and clean (Note: Proper Swim wear is compulsory).The restaurant ambiance is great and has pool side sitting barring monsoon times. The service is a bit slow and be assured of getting freshly cooked food. North Indian food was good but Chinese and Mexican was not worth. Also Food is really really expensive and not value for money. Resort also has a Play room. it has toys for kids and Carrom, TT, and Other board games which are free. Also they have virtual gaming like Wii and Play station which are on per hour chargeable basis.Resort is 4 KM from Colva beach and 10 KM from Madgaon(Margaon) station and Market.There are no shops, Restaurants nearby but if you have a vehical there are lot of options for Restaurants and shopping areas in 4-6 KM vicinity.We really enjoyed our stay.\n": "Positive",
                    "\nIt’s a value for money resort, you get what you pay. Don't expect anything fancy here, but whatever the basics are, they are good. Nice size rooms, nothing fancy though, good and very well maintained pool, courteous service, must comment that the staff are very warm and very good spa. A massage at their Spa is a must and quite inexpensive. So if you are looking at a resort which is very well located in South Goa, next to some very chic restaurants, virgin beach (Betalbatim is just 5 minute walk) then Villagio is the place to go\n": "Neutral",
                    "\nJust a few minutes walk from Betalbatim one of the cleanest beaches. Good food and very good service. What more could you ask for a relaxing holiday. Nice and clean hotel, very dedicated staff, a good Spa and walking distance to the beach and Betalbatim village. Very conveniently located for moving around to near by towns like Madgaon etc. Betalbatim beach is walking distance from Majorda and Kolva beaches.\n": "Positive",
                    "\nLanding at sterling with one bad experience before at Yercaud in the past, was keeping my fingers crossed. The moment we landed at Villagio till we left it was like home away from home. The team at the resort starting with Sajith, Monisha, the other ever smiling girl at the reception & the activities lady, Chef Hussain & the list goes on have always a smile on their face & ever ready to help. The Masti Dining package seemed to be good enough. Variety may be improved on that front. The resort was well maintaned, rooms were clean & crisp. My Kid still speak about the auntys who gave them flowers & cake for the birthday :)KudosKEEP UP THE WONDERFUL JOBSome improvements suggested would be as follows->Sign boards are a MUST MUST MUST- Kept shuttling atleast 2 times past the resort.>Booking voucher to carry a contact mobile number in case of emergency when land lines are down(was the case the day i checked in)>Service at peak times needs to be better monitored ( in the restaurant) though must mention the refilling of the buffet was just superb.>Curtains in the rooms are smaller than the door/ windows- needs to be altered or changed.>Eye for detail can be improved- Just to give an example- The day I checked in the A/C remote batteries werent working & we really ran around to control the temperature.\n": "Positive",
                    "\nLarge Big rooms, Well Kept, Mosquitoes may be an issue. Pools are neatly kept. Food is good. Bhim Singh is hospitable and very good. Close to the beach and good for peaceful stay. Magzika shack in the beach is good as well. Martins is also near the property.\n": "Positive",
                    "\nLocated in a very quite bylane in Betalbatim. No maddening crowds. A laid back village. Dont expect any shopping areas or hang out places. The resort itself is well maintained. Food was ok, good service. beach is about 1 km. Clean beach not crowded. Couple of shacks on the beach.\n": "Positive",
                    "\nMe and my Family were delighted with Resort's upkeep, Room and its location not far from Airport ( 30mins Drive ). Being a member of Sterling this was my first visit to this property and I was amazed with the staff and their attitude for making the guest stay a memorable one. Every one at this resort was ready to go an extra mile and help us in all possible ways. Pool was clean as my children enjoyed it a lot. Food was also very delicious. Near by beach Betalbatim was clean and peaceful and was like a virgin beach with life guards.Enjoyed the Villagio -Keep it up ......\n": "Positive",
                    "\nMe and my wife wanted to relax from our routine life and my kids wanted to have fun. I booked this resort purposely after checking it's location and facilities. We experienced very cooperative and friendly staff at our service, delicious food with ample variety, entertainment, sports and activities for everybody. overall I found world class ambience of resort.\n": "Positive",
                    "\nMy family and myself enjoyed a lot.... Thats a lot for team villagio for making my holiday memorable....Excellent services... Thank you so much... Looking forward to meet you guys again coming year... Keep up your good work and we wish you good luck...\n": "Positive",
                    "\nMy husband and I loved this hotel. We have been to many resorts in Goa but we think that Betalbatim is the nicest.The hotel is in a perfect location - 5 to 10 minutes to the beautiful beach but also in the middle of some gorgeous countryside. We spent many a happy hour walking down to Colva and Benaulim and up to Majorda along the beach, but also along the lovely and very quiet country lanes. There is a beautiful lake a couple of minutes from the hotel and there were always interesting birds there.The hotel is quite new and we had a nice room overlooking the pool.The fact that there is a living-room separate to the bedroom is a nice feature. The bathroom was very modern, much nicer than a lot we have had. There are 2 balconies and this is the only gripe I have about the hotel - why are there no table and chairs on either of them? We love sitting out in the evening before going out to eat,so of course, this was not possible.Breakfast was fine, but we did not have any other meals in the hotel because of the proximity of the wonderful Alberts restaurant, and all the very good beach shacks, particularly Little Palms.The pool and surrounding area was very clean, and the gardens beautifully maintained.Finally, the staff were very friendly and efficient, and we would not hesitate about going there again - we found the hotel to be very good value considering the location and facilities.\n": "Positive",
                    "\nMy wife and I stayed at the Sterling Villagio for six nights at the end of our second three week independent holiday in Goa and while we were able to find faults they were balanced out by the enthusiasm o f the staff, the spaciousness of the hotel and rooms and the quietness.It is pretty much out on a limb as far as doing things in the evening are concerned unless you wish to walk to the beach to eat and watch the sunset. We never ate at any of the shacks – like the hotel mainly frequented by Russians - which we felt lacked the warmth we experienced at other resorts such as Palolem, Patnem and Cavelossim. Also during our stay the patio outside the hotel restaurant was being re-laid so there was no outside dining for four nights and meals including breakfast were taken in the banqueting suite which was soulless. But to be fair this should not be a problem in the future because our assessment of the restaurant ambiance as “fair” caused consternation all round and we were immediately sought out by the manageress who persuaded us to change it to “good” because, one assumes, head office would kick up a fuss, although it was not their fault the area was being dug up when we arrived. That also gave us the opportunity to complain about the rate offered on travellers’ cheques which was a derisory 72 rupees to £ sterling, against 82 along coast. No doubt they hope to get away with this rate because they have a captive audience – the nearest place to exchange money is Colva, a taxi ride away. The cost too of wi-fi – provided free of charge by all the other hotels we used – was ridiculous. We were quoted the equivalent of £30 for a five day connection which was really taking the mickey.During the day it is well worth walking north along the beach to Majorda. But I would advise you to ignore the stroll the other way to Colva which is a dump and must boast the world’s grimmest public toilet. But this sort of thing goes hand in hand with the garbage which is to be found almost everywhere you go in Goa and which the authorities appear to be reluctant to do anything about. You cannot help but fear the state will eventually take on the appearance of a giant, unregulated landfill site unless they get a grip.We used the hotel’s room service on one occasion which was very good and on other occasions dined at three restaurants, each in the same area about a 35 minute walk away which can be dodgy in the dark.We took a taxi from the hotel to them - Camron, Fishka and Martin’s Corner - which cost 400 rupees return and the driver hangs about for you. All three are recommended and you get a free Wi-Fi link in Camron and Fishka while you can observe how the other half (Russians) live as they order giant crabs, lobsters etc and copious amounts of expensive wine (sorry about the envious tone).By all means stay at the Villagio but I think our six nights were just about enough. I sense a two week package might be tedious.\n": "Positive",
                    "\nMy wife and i stayed at the Villagio for four weeks and had a great holiday.The hotel is quite new and spotlessely clean and the staff very helpful The quiet beach is a 10 to 15 min. walk and has seven shacks selling nice food especially freshly caught fish. Colva is the nearest built-up small town and has lots of good resturants and ofcourse a excelent beach with lots of shacks and is only a 10 min. taxi ride from the hotel. The only bad thing was that there was only one resturant near the hotel for a evening meal otherwise it cost about £6 return to Colva..\n": "Positive",
                    "\nNice & small resort, all the things went perfect....room service is good. Pool is neat & clean. Activity room has various things to pass your time. Food is decent (not wow). Only concern is no lift....so prefer to take a room on lower floors.\n": "Positive",
                    "\nNice place to stay, but with a couple of downsides towards its location, and accessibility.Point 1: it is situated almost midpoint between Panaji and Calangute, hence it is quite a travel to shuttle between city and beaches,Point 2: There are no good restaurant options available around, hence you mostly end up with the in-house restaurant.Point3: Room sizes are not that great, they seem to small for even 2 people.Otherwise, its a decent place to stay and the in-house restaurant rates seems to be reasonable, also the service is good.But from what i have gathered, this property is much better than the other sterling in Goa.Hope this helps (date of travel : December 2013)\n": "Neutral",
                    "\nNice resort, with great ambience. Kids will enjoy swimming the stay, with the kids zone well equipped. Restaurant serves exotic Goan dishes, though I would recommend to try the real Goan dishes in the shacks. Overall, a good property and good atmosphire, for family stay\n": "Positive",
                    "\nNice resort, with great ambience. Kids will enjoy the stay, with the kids zone well equipped. Restaurant serves exotic Goan dishes, though I would recommend to try the real Goan dishes in the shacks. Overall, a good property, for family stay\n": "Positive",
                    "\nNothing can be a good start for a trip wen u start with sterling villagio.We reached early but the management greet us very well specially the restaurant staff. They are well mannered and know how to deal with the visitors. Food was mouthwatering and ambience was also gud.It is worth visiting wen u r in south goa. 10-15 mins walk to betalbatim beach where u can find a peace if u r looking for.\n": "Positive",
                    "\nOne of those properties of sterling which is compact but still beautiful and serves the purpose of a traveller... Keeps traveller busy with active holiday activities inside the resort, yoga etc....Quick room service , lovely and delicious food with extra love served along with the food. Beach and garden nearby... Cycle facility available... Prompt check in and check out facilities... Rooms are good (look out for the guests inform of mosquitoes waiting for you when you check in the room)....\n": "Positive",
                    "\nOur experience at Villagio, South Goa has been HORRIBLE. We travelled in a group of 5 couples and had planned 3 days in North Goa & 2 days in South Goa. We had placed all of our bookings in South Goa at Villagio - A Sterling resort about 50 days in advance. The complete payment was made in advance by us. On the day we were supposed move from North Goa TO South Goa & check-in @ Villagio hotel, we received a call late in the evening from Villagio hotel manager - \"Manish\"(when our check-in time has already passed by 5 hours!!) who informed us that a complete block of the hotel is under maintenance as a result of which they wouldn't be able to provide us the rooms. We decided to go to Villagio Hotel to speak to the manager & sort out the matter. TO OUR SURPRISE (& SHOCK) WE FOUND OUT THAT THE BLOCK UNDER MAINTENANCE HAD BEEN ALLOCATED TO DEFENCE EXPO RESERVATIONS THAT WAS HAPPENING DURING THAT WEEK !!! The hotel management was FLATLY LYING on the maintenance reason. On learning this information we challenged Villagio staff to show us the block under maintenance. This request was again denied. So probably what happened is - Villagio Hotel Management gave our (& probably other folks) reserved rooms to some foreign customers who were willing to PAY MORE as a part of the block deal. The most disappointing thing here is the complete UNPROFESSIONAL & UNETHICAL hotel management that gave importance to earn MONEY rather than CUSTOMER LOYALTY. Villagio hotel offered us ONLY 2 properties in NORTH GOA. We again & again tried to explain to Villagio Hotel manager - \"Manish\" that all of 2 days activities were planned in South GOA. So North GOA was NOT a viable option for us. But he failed to understand this fact repeatedly. Only available option in South GOA was some 5 star properties that Villagio was NOT willing to compensate. Ultimately we had to search on our own and settle down for a hotel in Panjim. Again we had to do at least 30 - 40 follow-ups for getting the payment for this NEW hotel reimbursed with Villagio hotel management. Overall, our experience with Villagio in South GOA has been HORRIBLE. NOT only our entire trip plan was disrupted, the HOTEL management did NOT even have the courtesy to talk to us politely and follow up with us to check on the arrangement in the alternate hotel that we had booked. VERY UNEXPECTED & SAD for a big chain like Sterling Holidays....\n": "Negative",
                    "\nOur stay in this resort last week was pathetic. Resort not at all to even nearer to 3.5 star category. Very very arrogant staff only one or two are exceptional. Location is poor...bit far from city so u need to depend on resort only for everything. Despite being Sterling members you cant get anything from the resort without CONDITION APPLY. Even drinking water is also limited (Awful) Food is way way way expensive. Batalbatim beach is bit far and not at all relaxing place. So dirty. Taxis are very expensive. its like they will punish you for come to Goa. Travel desk of the hotel is meaning less....they told us to negotiate directly to taxi driver..In short Hotel Staff treating us like BAKRA who came here for HALAL.....! My strict NOOOOO for this resort\n": "Negative",
                    "\nOur trip to the rest started in the middle of the week, in the middle of the rainy season. This should clearly be off-season but more on this a bit later.The arrival and checking in was a breeze. There was help available to get all our baggage (there were eight of us) to the rooms we had. The property is not too large, by any standard. However, it does have its advantages. The swimming pool, the events room and the restaurant are all in close proximity and all are quite enjoyable. The swimming pool starts from 4 feet depth (if I'm not wrong) and goes on till 6 feet. While its not too long, one can a few laps quite comfortably. The events room has a table tennis table, a pool (billiards) table and a carrom board. The TT table is quite decent, the pool table is also decent, although it is severely hampered on one side with lack of space as also the fact that there is no hand rest for shots where the cue ball is placed in a difficult position. The carrom board is really not worth bothering with and in my opinion, its only good use would be to chop it up for a nice bonfire.The restaurant has its good points. The food is really not bad, although it certainly isn't something a solid chef would be proud of - typical Indian restaurant fare. They do serve freshly cooked Indian breads (roti, naan) when having your meals. The dessert is something they need to make a serious effort at. What was served as dessert really did not fly with any of us (and we are not picky eaters).Sterling Resorts is a place where members should expect a decently priced vacation. Instead, we were charged a daily maintenance rate that was more than 60% of the going rate for the exact same facility on www.MakeMyTrip.com - and that rate included breakfast while we had to pay for it!Combined with the just-under-INR 700 a day breakfast-dinner combination, while being well thought of (this is a tourist place, after all) but not really well-priced, this is a tad difficult to justify for members who have invested what they have in this company. Remember, this was off-season. I can only imagine the in-season prices.In terms of location, this site is at a slight disadvantage - the other Sterling Resorts site in Goa is definitely more conveniently located - for visiting the more famous beaches in North Goa as also some interesting places such as Panjim city, Aguado Fort, etc. Also, there is no restaurant or shopping in walking distance from the facility. This can impact your taxi bill; which brings us to the next point to talk about.If you do not have your own conveyance, this facility has a perpetual set of taxis available outside their entrance. However, you must be aware of the racket that the taxi union runs in Goa. This is a huge setback to visiting Goa - but is obviously not something that the facility itself has any control over. Going anywhere (other than the Betalbatim beach, which isn't anywhere on the scale while comparing with the other beaches of Goa) is a costly affair, as there is no meaningful public transport in this part of Goa.The one thing that redeems this facility is truly the excellent service from the staff there. Everyone is truly invested in helping you make the most of your time there. The events manager, the restaurant manager and the property manager are all very eager to please you and will go out of their way to make your experience a special one.Overall, Sterling Resorts Villagio is a very decent choice to make for your next trip to Goa - just remember that there is a price for everything - so perhaps, in retrospect, we will visit the other Sterling facility in Goa during our next trip there.\n": "Neutral",
                    "\nPEACE, QUIET, Nature. An amazing property away from all the noise of the city. The resort has been designed beautifully to offer some very necessary quiet to its residents. Nothing much to do or see around the resort. The Betalbatim beach is walking distance abt 7 mins. The sands are clean, the beach is very parsely populated, so superb for couples families etc. The service and food at the resort was amazing. You dont need to venture out in search for either.\n": "Positive",
                    "\nPeaceful location.Nice property with maintained rooms.Close to Betal Betim beach (1.5) kms.Supportive staff.One can really relax on the beach without any disturbance since it is sort of isolated beach and nothing to do except relaxing.Bike / car on hire just out side the hotel for one to check Goa at their own pace.\n": "Positive",
                    "\nPeople who like to relax, and want to be away from the Crowded Beaches.. this is good alternative to stay.. Walkable from Betalbatim beach.. The staff are good and helpful. A good ideal resort to visit with Family..But things like Wifi are paid. should be made free..\n": "Positive",
                    "\nPlace is good, pool is very neat. Cleanliness is good. Bathroom does not have a Bathtub, that's a minus. Otherwise studio appartments are spacious. Bottled water in room service was very expensive. Staff was very polite and courteous. Shyam Sunder is a good resource:) Taxis are expensive in that area. In fact taxi drivers in Batalbatim do not allow other taxis to operate and they do not allow you to self driven taxis also in the area... So that is a kind of Monopoly. Bikes are good, cheaper and fun filled. Colva is about 5 mins drive so you can get good beach Shacks and fine food at beach. Rest there is nothing near by. But it is a fine place to relax.\n": "Positive",
                    "\nPositive: 1) The Resort is good in terms of cleanliness. 2) Ambience is calm and lot of greenary. 3) Swimming pool is well maintained4) walkable (15mins) from betalbatim beach5) 2km from Colva beach where you can take bathNegative:1) Away (really) from North goa where all the fun is2) Other than Martin's Corner no restaurant nearby3) Food is too costly4) Not good for members. As a member I had to pay total 1650/perday (including breakfast) and my friend who is not a member had to pay 2000/day5) No Holiday parties/games arranged 6) In Doshin block only corner rooms are good like 204..Our room(213) was quite small, little bit smelly and without bathtub7) Breakfast menu was repititive\n": "Neutral",
                    "\nPositives:a) The resort rooms were good and spacious.b) Location of resort is nice & within 5 minutes distance from the Betalbatim beachc) Swimming pool was very well maintainedd) The resort ambience is very good and pleasingNegatives:a. The resort does not have any lift which is ok as it may be a Go Green initiative. But then the booking staff has to take care that they look at the visitor’s details and book rooms accordingly. E.g. we were accompanied by my mother in law (Age 75) & we were allotted 4th floor room. On request, we were told that only one room is available. With no choice, we changed to a ground floor room, which was at the end of the property. This room had a continuous stink of drainage as there were drainage outlets nearby. Also, there was a big generator noise as the generator was located just outside the room.b. On scrutiny, we also realized that there were similar category rooms which were empty in the resort which they could have easily allotted to us.c. Staff/service a bit is lax. The staff has to be reminded once at least to bring the things like towel, soaps etc.d. I had 2 very bad instances: a. I was taken aback by one response of the staff where they mentioned that there is a charge of Rs100 per plate (so total Rs 400=100*4) to provide 4 empty plates in the room. This was an attempt to force me to purchase the dinner in hotel which happened to be a Goa Carnival day & priced at 1500 per couple. b. When asked to replenish the tea packets that are provided complimentary, the staff refused to get tea packets instead of coffee packets. Later on they did provide us with extra packets.e. Also when we became a time share member way back in nineties, it was promised that the resorts will have accommodation with kitchenette & cooking facilities/utensils. The resorts which I had visited earlier like Munnar, Kodaikanal etc did have those facilities. However the new resorts Sterling Holidays seem to have given away this concept? Areas of improvement:a. The resort does not have any play area for children (outdoor games) except some play station games which are off course chargeable. b. Resort reservations should be online real-time system. The time share members should be given an access to the same & book online. The current system of sending a mail with 3 options of location & dates and getting the response after 2 days is time consuming & redundant. Also increase the call center support, as it takes lot of efforts to go through the same, as it takes lot of efforts to go through the same and actually getting the response.\n": "Neutral",
                    "\nProperty Visited: June 2012 (Apologizes for late review but its my first one)Pax: 04 (Friends)Where would one like to go, specially after finishing your final term (MBA) with close friends when being on a tight budget! Hence Goa it was...Let me start with the most favorite part of the trip: \"FOOD\" This property has one restaurant with ample space to sit on both ground as well as on the first floor.Quality: Considering the season, Ingredients weren't stale.Taste: Kept licking my fingers..Breakfast: An elaborate set up of both Veg & Non-Veg with a live cook to prepare 'omelets and other egg preparations' \"Beans in tomato sauce just made my day!\"Lunch: One Word \"Awesome\"Dinner: Ordered room service yet pipping hot food was servedRoom Service: 20 Mins and the food is served.Rooms: were clean and tidy, well furnished with TV, sheets were fresh and bath towels were stain freeHouse Keeping: staff was helpful throughoutFront Office: We were really surprised when we realized that the general manager was there to check us out even when the front office staff was there to assist us. This just made me realize that just a smile is not enough to make things special for a guest. But being down to earth can. Hats off Sir!Best and a safe place to stay for Families and Couples. Singles can have a great time too provided they follow the Restaurant timings.Go Goa... will return soon to this property\n": "Positive",
                    "\nProperty is 20 min drive from the airport.Decent and peaceful property far from the city. Close to betalbetim beach and colva beach where you can go for shopping and water sports activities. Resort is amazing option in south Goa for families.\n": "Positive",
                    "\nPros:-Near to beach, 10mins walking distance - beach is very quite and superb almost white sand.-south goa- Very cheap if you are RCI or Sterling member-Pool was well maintain.Cons:- Service (WORST)- need to go to COLVA for dinner- hotel restaurant wasn't that good rather over charged.- ZERO % hospitality.- Nothing was free, even to play with volleyball was been charged.- Even Sugar packet was charged @ 60 bucks - Over charged TAXI and Rented Sctoor\n": "Negative",
                    "\nReaching the hotel was a challenge due to lack of sign board, but once we got there we enjoyed our staying experience.We got a nice room with a pool view. Rooms were well maintained with good housekeeping. Started off with some initial slow service, but things improved after we complained.Staff was courteous and helpful. Restaurant served up good buffets with candle lit tables by the pool side. They usually have some live band or singer or DJ on alternate evenings adding to the pleasure. The buffet spread was decent on all days, though we felt the menu lacked variation and proper blending at times - scope for improvement there so far as menu planning is concerned.A-la-carte orders in particular were very well prepared and the restaurant staff needs particular mention for their detailed attention to guest needs.The location of the hotel is a bit of a walk upto the beach, but its not that bad.Electricity cuts are frequent but the power generator backup was usually quite prompt and we did not feel inconvened at any point.All in all, a great place to stay if one is looking for a mid-priced well maintained hotel with good basic amenities and just a small walk from the sunset beach.\n": "Positive",
                    "\nReally a nice place to stay. Calm atmosphere. Rooms are good. Ambiance is nice. The warmth of the staff is extraordinary and to name a few Ms. Ranjan of front office, Sharanappa (customer relations manager),Bhim Singh, Clandon & Sumit at the restaurant. You ask them anything they will provide. It is a home away from Home.\n": "Positive",
                    "\nReally need to improve the services, Location not too good and felt very tough time at the hotel. But rooms facing the pool are better and food at the restaurant is good. Overall we enjoyed the breakfast and dinner everyday.\n": "Neutral",
                    "\nRooms are nice and spacious and well appointed with good balconies and windows. Property size is kind of small for a proclaimed 4 star property. Its close to the beach. Hardly 5 mins on bike.Staff was friendly and Service was good. Pool was nice, But water could be cleaner.Only thing missing would be the Breakfast Buffet spread. Very less options. Prices are way high for average Food.\n": "Neutral",
                    "\nSerene location - situated among coconut grovesSpacious rooms - with two balconiesGood food - the food and beverages manager checks individual's taste and organise food.Close to the beach - about 800 meters away from a lovely and peaceful beachTwo wheeler - one get this for hire\n": "Positive",
                    "\nService was quick by house keeping and f & b. But the lady in reception was not quick. Whenever we used to call at reception she always kept us on hold.Everything was greatAnd yea no complementary breakfast was given where as in hotel bio there is given free breakfast\n": "Neutral",
                    "\nStayed here for 3 days from 12th of May 2016. This was my first trip to Goa with Family. Compared to other Sterling properties this is smaller but well maintained. The staff were reasonably cooperative. Though Food spread is limited but the taste is good. Chef Bheem and his team have done a great job to keep everyone happy & satisfied. Chef Beem attends to all customers personally. Pasta is one my Son’s favorite . Chef Bheem had made some wonderful pasta for him that he keeps telling about it again and again.\n": "Positive",
                    "\nStayed here in June 2016 with my family.The location is average and it is situated about half a kilometer from Betelbatim beach. The room allotted to us was very nice and spacious. The breakfast buffet and the food at the restaurant is decent. The food and beverages are priced slightly on the higher side.The highlight of this place is the great hospitality, thanks to Bhim Singh, Sharanappa, the team at the Spa and all the others. Was a little surprised that they charge for Wi-Fi access which should have been complimentary.\n": "Positive",
                    "\nStayed in Villagio for 4 nights. The resort is close to the beach (1 kilometer ) and located in a village 30 -35 kms from Old Goa. Hence has a scenic neighbourhood. Rooms are ok and staff are quite friendly and customer centric.Things that a visitor needs to be vary of b3fore deciding to stay here:1. There is no public transport that connects the village. If you do not have your own transport and one needs to move around there is no other option other than the tourist cabs which are quite expensive.2. There are no shops in the neighborhood to buy eatables or bread. One needs to travel 2-3 kms from the resort to get to the nearest store. Food in the resort's restaurant is expensive.3. Houses adjacent to the resort have pet dogs that can make you go sleepless at night.4. One house adjacent to the resort has cows and the stink from the cowshed can be unbearable at times.\n": "Neutral",
                    "\nStayed with Family a total of 5 adults and a child from 25th to 30th and September 2015 and thoroughly enjoyed the stay. Being a nature lover liked the quiet location close to Betalbatim Beach at walking distance. Staff is very courteous and I would specifically like to mention the name of Mr Bhiim Singh in Restaurant. He not only receives n greets every guest but also take care of their requirements in dining. The service in the Restaurant is great food is tasty n excellent.\n": "Positive",
                    "\nSterling Resort has a very poor services like they couldn't provide drinking water to his guests after repeated orders. Literally i feel cheated . they couldn't provide us extra bed for my kids in my room till at 2 AM morning inspite of repeated calls , while booking had already done online. Breakfast menu was not up to the mark as charged. Even they dont ve any courtesy to arrenge taxi for airport transfer on our cost.\n": "Negative",
                    "\nSuperb resort, friendly staff, great hospitality,nicely clean room, awesone food, spacialy thanks to resort's head chef Mr.GOPALSWAROOP SHARMA & Mr.LAXMINARAYAN for to arrenge for us JAIN food. All over gr8 and memorable trip for us.\n": "Positive",
                    "\nThe Hotel is located in South Goa vey close to Betalbatim beach.It cost us about Rs 400 by prepaid taxi from Madgaon railway station.We did not get our preferred room since all rooms booked by a Company for a Conference.The staff were courteous and polite.The rooms are nice and clean.We were provided with a Mini fridge and beverages which were chargeable.Taxis waiting outside the Hotel fleece the customers.The charges for 8 hours trip to North Goa was Rs2600 and Rs 2300 for South Goa.These were supposed to be off season rates.if your trip exceeds 8 hours which will always be the case ,if u are going for the boat cruise,u will be charged extra.We were lucky since we had a local friend who gave us a local guy with a Jeep .(Basheer - 09823952192).His rates were reasonable.We did not dine in the Hotel's restaurant since we were away for most part of the day.The food at Albert's place, just about 5 mins from the hotel is good and reasonable.Martins Corner is also about 15 mins away.Good seafood.From Betalbatim beach u can walk all the way to Colva beach about 20 mins away.I would prefer to stay in a Hotel in North Goa since all tourist attractions are in this area.\n": "Neutral",
                    "\nThe Sterling Holidays Villagio is a great hotel with excellent service. Albeit a bit far away (60 kms) from all the North Goa madness this is a hotel ideal to unwind and relax from the relentless partying in Goa. Rooms are clean, beds and pillows are really soft and the washrooms are also clean. The room service is always good and the staff is always cordial. Food served is also quite good. The bar is right by the pool and you also have a nice minibar to sort you out while you're chilling in your room.\n": "Positive",
                    "\nThe Villagio Inn hotel is a nice three star resort property run by A Sterling Holidays group.The rooms are very big in size & the swimming pool is clean and well maintained. The food taste is nice. The most important is the nearby beach of Betalbatim - Very clean and not crowded.\n": "Positive",
                    "\nThe amenity was well maintained and had a very relaxing holiday . The food at the restaurant could have been better but nearby there were restautants ( Ex . Martins) which was good . Betal batim beach was at walk able distance and often could walk and relax there . We also visited many beaches in south Goa and also travelled to visit dudsagar falls which was a great experience\n": "Positive",
                    "\nThe first thing is Room is excellent, and Front staff very good but room service and certain draw backs were very much visible.Like these are four floor building and with no Lifts and Room service was very slow and at the end of the day when you come back tired you notice that the room service guys have not done what they are supposed to and you need to call them and get things done again, but the front reception staff were very supportive and made up for the drawbacks.\n": "Positive",
                    "\nThe hotel has a series of building on a well manicured property. As its a smaller resort, its less crowded. It's away from the main colva beach and the closest beach front is a bit of a way alway; regardless the pool and layout make for a relaxed feel\n": "Positive",
                    "\nThe hotel is in a very peaceful locality, good spacious rooms and nice service.Strength- Excellent food and hospitalityLows- No transport facilities for airport pickups and sightseeing, no free wifi.Overall- A decent hotel for a holiday trip.\n": "Positive",
                    "\nThe hotel is located near a very peaceful and elegant beach. The rooms are average but worth for the money they charge. Restaurant has limited options but they customize the meals as per our choices. The chef was too friendly too cook meals for my kid on request.Swimming pool was clean and good.The rooms and services can be improved.\n": "Neutral",
                    "\nThe hotel is nice and the staff is helpful and cheerful but two things are really problematic. One, it is quite far from everything, be it beaches or restaurants and transport is not easily available. So if you want to stay here, either you must have your own vehicle or be willing to walk about 3-4 km to and fro for anything that you'd like to do. Two, our room over looked a broken down street and that's not what you're looking for in Goa. Their deluxe rooms with a view overlook the pool and that's the best that they have. But the rooms are very cleans and well maintained and the stay is pleasant.\n": "Neutral",
                    "\nThe hotel was really good.. The rooms were clean and the bathrooms too.. The pool water was crystal clear.... The room service guys were really helpful... But the only problem was the 'front desk'... Even after early booking ,, when we reached there, we had to wait for about 30 minutes to get our booking confirmed.. The restaurant was also good.. Doorman, sushant was really helpful and courteous..\n": "Positive",
                    "\nThe location of the resort is perfect for people who just want to relax and laze around, there is little to do nearby except a great beach 15 mins walk away, the resort is well maintained a staff polite and courteous, the food needs improvement but a little but all in all had a good time\n": "Positive",
                    "\nThe one thing which i love about this hotel is there hospitality starting from reception to resturant people everyone is very helpful . The rooms of this hotel were very cleaned there food is also very excellent . The only thing they need to work is about the swimming pool that it should be lively like in the afternoon if the guests are swimming or having fun they should serve some mid evening snacks otherwise its awesome would love to come again. All the best\n": "Positive",
                    "\nThe only good thing about the resort was the location and room. rest all was disappointing. the food at the resort the room service and the facilities charges were all ridiculous. only if they improve the service and stop charging for basic facilities i would not visit this place again.\n": "Neutral",
                    "\nThe property is excellent, food is awesome and service is mindblowing. We stayed there for 3 nights and didn't have a single complaint from this place. The rooms are spacious and clean, the pool and the property is well-maintained, and they have a lot of leisure activities within the property like carrom, pool table, etc. and the beach is just 5 minutes away.\n": "Positive",
                    "\nThe property is old with no view to the ocean, no lawns to be maintained. The rooms are decent and quality of beds and furniture is average. service is decent and place can at best be budget hotel. Restaurant is small with limited options, although food is ok. Small pool and a small recreation room. Reception is lazy and laid back. Travelled from 28th July to 7th August 2014\n": "Neutral",
                    "\nThe property is well maintained. Good rooms and bathroom clean. Food Quality was good. Good kids activities. Good beach.Well trained staff. Just housekeeping services need to be improved. The staff were very co-operative and good.\n": "Positive",
                    "\nThe resort is good but location is not very ideal. As i am member of the streling i m stay with my family from 23rd to25may 15.Resort has sweeming pool activity room and kids game room.Restaurant staf is to short . Food is average but morning breakfast is very good. Checkin process is little slow.Suggest for taking bike hire is available just outside of Resort. Taxi is littlebit expensive. He charged around 2300 per day. Nearest railway station is madgaon of 12km.Overall Resort is good\n": "Positive",
                    "\nThe resort is in an rather isolated spot. One can easily get a prepaid taxi from the airport to reach the resort in South Goa after about half hour drive.the rooms are all good,spacious,well ventilated. The bathroom is also decent and the bed and linen neat. However in most of the rooms the AC are not efficient,moreover the wifi is chargeable,bottled mineral water is also given only once on the first day of check in. The pool and activity centre are good. The food is good and reasonably priced although the service is slow. The staff is courteous and helpful. Beware of the mosquitoes and carry your own protection. All in all it is not a bad choice and you should have fun.\n": "Neutral",
                    "\nThe resort is in south goa very close to bealbatim beach, we stayed at the resort for 2 nights and the stay was comfortable and staff courteous. Food options are very less, either you need to drive to Colva beach which is a good 15 min drive or martins corner.. Resort food is average..\n": "Positive",
                    "\nThe resort is located very close to the betalbatim beach and makes a very good stay for pleasure of spending time whiling away time on beach. Resort is neat and clean with minimal staff who do not intrude. the food is good at the resort but can find good food on the beach also. walking distance from colva and majorda beaches.\n": "Positive",
                    "\nThe resort is situated in South Goa, but in the interiors. Traveling to & fro from the resort, The closest beach is Betalbatim,but the famous Colva beach is also 10 min drive away. Being the monsoon, Goa was in its best greenery. The resort itself is serene and green, with beautiful rooms. The inhouse restaurant serves tasty goan food, but a bit pricey.The resort has a swimming pool & spa, and also has indoor activity room for kids.The only issue was with the sight seeing tours, as the taxi available outside the resort have their say on the rates, and you don't have much of an option but to avail their service. Another option can to be to rent a bike or a car.Good for family or groups who like spending time in the resort itself.\n": "Positive",
                    "\nThe rooms facing the pool are better .The food available at the restaurant is good.We enjoyed the breakfast and dinner everyday.The rooms are cleaned as and when required by the guests.Room service is with a smile.\n": "Positive",
                    "\nThe staff at the Sterling Villagio is excellent. The doorman Sushant, the front desk Neelu, the dining room manager Sanadu, the bartender Clinton were all fantastic. All we had to do was ask and we got quick attention. Even though our travel agent did not send our booking information to them the check-in staff did a great job of finding us good great rooms.\n": "Positive",
                    "\nThe staff were really very good. All need s and request where taken care of. The only problem is there's no lift in the resort. Thus makes it very inconvenient for a leisure travelers to pick up his luggage all the way upstairs to the room.Location wise it's situated far from the city at most 30kms. But the pleasure of the breeze and the sound of waves of the beach is very soothing to ears..!! Overall had a pleasant time being there..\n": "Positive",
                    "\nThese words might not be able to justify the feelings we share when it comes to reviewing are stay at the Villagio, South Goa and the efforts of the Management at the Hotel in ruining are trip.It was meant to be a 2 day stay at the villagio for 27th and 28th March with 5 rooms for 5 couples with bookings done around 2 months back via makemytrip website and having received the confirmation mail. Having stayed in North Goa for 3 days in our trip, the objective was to explore South Goa for the next 2 days with the itinerary already planned.It was on 27th march, the day of our booking at 5.30 pm when we were about to reach South Goa after travelling for 2 hours (North Goa and South Goa are far apart-min 2 hrs journey in traffic), that we were informed that we can’t be given the rooms citing some maintenance issues and instead will be provided accommodation in North Goa again in some 3 star property of our choosing vis-a-vis Villagio (so called 4 star).Amused as we were while travelling to Villagio we got 2-3 sms in a span of 2 hours recommending north goa properties with no verbal communication. For this we had to hire a van costing us 4000/- to travel to South Goa.On reaching the Villagio, the manager Mr. Manish found it our fault on why we could not take a downgrade north goa property despite giving the options over sms in a span of 2 hrs at the day of the booking. On top of it, this guy had the audacity to be insensitive to girls and blatantly rude while rejecting our confirmation. On enquiring a few guests who were staying there and the room service staff it was found out that there were no maintenance issues and instead the rooms had been provided to the dignitaries for the Defence Expo in South Goa hinting at the Political Hotel nexus thus ignoring the plight of common man. For all 10 of us, adjustment is not a big deal, we could have even settled for any equivalent property in South Goa, it was the insensitive nature of the management specially Mr. Manish who didn’t have the decency to talk politely to guests coming from a different city and settle the issue. At the end the booking instead was provided at Panjim (midway between north and south goa) for only 4 rooms with the promise to provide the refund of the 5th room and to honour the payment of these 4 rooms at the Hotel Tree House, Neptune on the next day. There was quite a lack of communication again from the side of the Villagio the next day in honouring the payment to the Hotel Tree House, Neptune with hotel staff pushing us again to convince Mr. Manish to release the payment.I urge fellow travellers to stay away from such Hotels in the future riding high on power nexus and discrediting its patrons.\n": "Negative",
                    "\nThis hotel is merely a guest house at a very secluded place at South Goa. There is no place to eat nearby to this place. The pool was not working and was under renovation. The rooms were smelly and had to be perfumed in order to make them stayable. Rooms are spacious though. There is a strong taxi mafia and they don't let any taxi to pick the guests up. The taxi rates charged by these people are much higher than market rates. The hotel management should make it more competitive for the guests rather than monopolise it.\n": "Neutral",
                    "\nThis is a Sterling Holidays Resort, located near Betalbhatim beach (South Goa). Beach is at 10 minutes walk-able distance, Excellent accommodation for People looking for less crowded and serene places. Clean and clear beach,frequented mostly by foreign travelers. There are quite a few Beach Shacks serving lovely sea food preparations. Beach Sport Facility is also available.Hotel Plus - Clean surroundings and green environment. Hygiene is okay, Spacious rooms. Food quality is nice. Housekeeping, front office and restaurant staff were well mannered. Clean swimming pool for kids and adult persons.Hotel Negatives - There is no lift, avoid rooms on top floors, food is costly, you are handicapped if you do not have vehicle, travel guys outside the hotels are fleecing the customers. I visited on year end ( 28th to 31st Dec) and had to pay multiple times the usual rental.Restaurant was grossly under staffed, Poor guy was running to get the orders at restaurant especially at dinner time.Visit during off season for better room discounts and affordable vehicle on rent. Nearby places must vist , Martins Corner - 2 km( Restaurant), Colva Beach ( 6 km) , Covallesum beach ( 10 km), serbatim , Madgaon (City). Panjim is about 39 kms, Old Goa can also be covered.\n": "Neutral",
                    "\nThis is a nice property affilited to Sterling, away from city in a small village of Betalbalim, the beach is 10 minute walk from hotel. The staff at hotel is great..right from the front office to the house keeping to the Food & Beverage.special mention for the executive Chef Sydeny D'souza, very friendly and warm. My son still remembers him as a friend.\n": "Positive",
                    "\nThis is a relatively new property and hence well maintained. Lots of activities for the kids so that they can be engaged . Very near to the Betabatim beach , which is unexplored and hance less crowded. Veg food was excellent and recommended. Nice pool and courteous staff .\n": "Positive",
                    "\nThis is a sterling holiday resort so may be for members it seems quite reasonable. Had stayed at this property with a friend who is a member. It is a small resort with nice huge rooms and bathrooms. The overall cleanliness of the place is good. We stayed in room 203, and must say there was a constant smell in the bathroom maybe due to the window not locking there. There is absolutely no view to the rooms at all. In fact, the view from our balcony was of the adjoining roof, and the view below the other window was of the service area. It is extremely noisy, specially, during the night with the dogs howling nearby. The service, however is good and courteous. There is nothing available nearby. Everything is more than 2 kms. away. Beds are comfortable but extremely noise which can be irritating. No comments on the quality of food but it is extremely pricey, for example an omelette will set you back by Rs. 160 when ordered in the room. It is so secluded that without your own transport going out for meals in the night is a major problem. Overall, an average resort with no ambience.\n": "Neutral",
                    "\nThis is a very basis and average hotel. Should not be classified as a resort though. Around 10 min walk from the betalbatim beach. The location is pretty secluded and away from the hustle bustle of the main city. One cannot hire a self driven car in this area. You need to either have your own (owned) car or 2 wheeler or else you are at the mercy of the pvt taxis which are there just outside the property. Bargain as much as possible since these people will rip you apart with the prices. Try and go to the main betalbatim village (around 10-15 min walk) and hire a taxi from there to get a better bargain. Been told by one of the taxi drivers that self driven cars are not allowed in South Goa, unlike North Goa. We got hold of a taxi driver named Bonny (9923668523). He was a nice guy and charged lower than others. Recommended. ROOMS: The rooms are large and well kept. They don't even provide bathroom slippers. Overall the property was neat and tidy. Swimming pool also looked clean, though we didn't step onto it. FOOD: No complains. We are vegetarian and were fully satisfied with the food options and the quality. Our package was including all 3 meals and we got sufficient options for veg dishes in b/fast, lunch and dinner. Had read previous reviews wherein people had commented regarding high price of the food. But seeing the menu card, I think its reasonable. There are 4 floors and no lift. We had an infant with us and were carrying a baby stroller, so requested for a room on lower floor, but was not given. The activity room, is just for namesake, Its extremely small and packed. The pool game was chargeable. Games and activities should not be chargeable though. Beach: Betalbatim beach is just 10 min walk from the hotel and the beach, is very neat and clean and mostly foreign tourist could be seen. There are around 5-6 shacks on the beach. We visited other beaches like Cavelossim,Benaulim and Mobor. All were beautiful, unspoiled, neat and clean. Completely opposite to their north counterparts. ATTRACTIONS: Martin's Corner (around 10-15 min walk) is a nice place where one can spend the evening. Its very lively. Ample food options for Veg as well. One can also go to \"My Kind of Place\", very near to Martins Corner. Wifi is chargeable. Overall a decent experience. Nothing very great, nothing very bad. Not a resort in any way though. The only thing it hurt staying there was the huge expenses on Taxi. But I believe so will be the case anywhere in South Goa.\n": "Neutral",
                    "\nThis is a very late review - we visited in July 2014. Nevertheless.The rooms and the services were very good. The guy at travel desk was also very helpful. Everybody from the bell boy to the receptionist were courteous, and our stay was good. The food was expensive but was good. And when our kid started crying at 02:00 in the midnight, the kitchen staff were helpful enough to have a glass of milk delivered at our room.\n": "Positive",
                    "\nThis is my 3rd time staying at this resort and very time my family n I had a great experience and this time was no exception. What makes it a great destination is its location and top notch staff. Very thing seems to be hassle free and quick. Rooms are clean n elegant. Very responsive and courteious staff starting security guards to receptionist to house keeping staff. Overall had a fantastic experience and looking forward to my next visit.\n": "Positive",
                    "\nThis is probably one of Sterling's best property. This quiet place is tucked away from the craziness of Goa, yet about 10 mins ride to the famous Colva beach. Other than the fact that the place is managed by Sterling resort, I would have had no other compelling reason to come here. Unfortunately the amount of 'other charges and taxes' Sterling charges for each day has made me decide to never come to this property again as it would cost the same to go to any other good north goan property.\n": "Neutral",
                    "\nThis one is really oven fresh! Here it is...We visited Villagio in the first week of June and to our surprise it had a good occupancy even at the fag end of tourist season.Here is a rating (on 5) to help you evaluate:1. External Housekeeping - 4/52. Food - 4.5/5 (Enjoyed it since it was less spicy and chilly. Decent variety. Good for kids.)3. Amenities - 4/5 (Pool was the most enjoyable. Clean at all times. They do have a small activity room with a TT table, books, billiards table and carom table. Good scope to improve here.)4. Room Housekeeping - 4/55. Service - 3/5 (This was the only hitch during the entire stay. They looked really low on staff in Resto and Room service. It took realllllly long to process orders. It was may be because of the fag end of the season.)6. Staff - 4.5/5 (Very friendly and co-operative right from Security guy to the Manager.) 7. On Campus activities - 3/58. Rooms - 4.5/5 (Rooms were clean, well spaced and lit. We had a pool facing room with two small balconies. Each room comes with a mini bar and a TV connection.)9. Location - 4/5 (It is 10 mins walk from the Betalbatim beach and equally from local market. After 7.30 in the evening the street gets totally isolated and makes it a little insecure walking all by yourself but they say it is very safe and secure.)10. Overall - 4.5/5 (Good experience. Really quiet and peaceful. Away from the noise and hustle.)Betalbatim beach is only 10mins walk from here. This beach is really clean and less crowded, unlike Goa's other popular beaches. So, if you want to enjoy clean waters and fresh air with no nonsense around you, this surely is the beach!\n": "Positive",
                    "\nThis place has extremely bad service. We organised our bank training here and we were disappointed. The locker in our room wasn't working. Even after repeated complaining after 3 days it was still not repaired. On mentioning it during the checkout, the front office staff had the audacity to laugh it off. The door locks for the rooms were rusted. Needed to get it oiled for it to work. The towels supplied were not clean. It had muddy stains. The tap in the bathroom were not fitted properly. It was the worst service I have encountered in a hotel. Food was the only savior. The restaurant was clean and well maintained. Staff was also good. The hotel needs to seriously look into its service though. Even a 1star hotel doesn't treat it's guests this way. Please rethink before booking a room here.\n": "Negative",
                    "\nThis property has fully air conditioned star hotel grade rooms with very good ambiance. Every room has bottled free drinking water, facility to make coffee/tea. There is a swimming pool and recreational areas. Open area has large TV. Restaurant has one of the best food in town. We paid Rs.650+ taxes per day per person for one buffet dinner and buffet breakfast. It is simply good with goan flavor.The beach is 2 km away. Staff is very courteous.We loved our family vacation here. Contact number 918554994776.\n": "Positive",
                    "\nThis relatively new sterling holidays property is tucked away in a cosy corner of Betalbatim village and nearly a km away from the beach.. I went there with family (totally 10 adults & 3 Kids) in the first week of May. We were warmly welcomed at the reception with a big namaste and check in was smooth. The room was fairly spacious with all necessary amenities except the absence of a locker, lack of a dressing table for ladies and also a mat at bathroom entrance. The linen was clean. The sofa-cum-bed had a run down upholstry. The staff was pleasing and room service prompt. The house keeping staff did a good job too. The buffet was not upto the mark. Other than Betalbatim beach, Colva beach is adjacent and nearby distance. One has to depend on Taxis to move around farther which are by no means cheap. The swimming pool was clean, but the height marked as 5' was certainly more than than and one has to be careful not to follow the markings of height in the pool and had a spalsh pool for kids. They can improve indoor / outdoor activities for kids and elders. Over all the experience was good.\n": "Positive",
                    "\nTucked away in a quite corner of Betalbatim village and a km away from the beach is this relatively new sterling holidays property. I went there with family in the third week of March. We were warmly welcomed at the reception and check in was smooth. The room was fairly spacious with all necessary amenities. Provision for locking the cupboard /absence of a locker was a defenite disadvantage and also lack of a dressing table for ladies. The linen was clean. The sofa-cum-bed had a run down upholstry. A carpet in the front room gave out a musty odour but was promptly removed on request and room sprayed with generous amounts of room freshner. The staff was pleasing and room service prompt. The house keeping staff did a good job too. The buffet was generous and had predominently south Indian fares. Other than Betalbatim beach, Colva too is adjascent and at a walkable distance. One has to depend on Taxis to move around farther which are by no means cheap. No decent restaurants in close proximity. The swimming pool was clean and had a splsh pool for kids. Lot of activities for kids. Over all the experience was good. The unusually pleasant weather made the stay all the more enjoyable.\n": "Positive",
                    "\nTvs Sundaram Motors had annual managers meet during 10th to 12th april. Total member present 98.Since we enter the resort and till we left the hospitality and arrangement by the resort team was outdtanding.Special appreciation for food and personal care taken by each of the team members. Great leadership and excellent team work.best wishes.mukherjee\n": "Positive",
                    "\nUsually not a fan of Sterling properties but this one is really well maintained and run by a very friendly staff! Check in was made very comfortable for us even though we could check in only by 2 am. They even managed to serve us food at that time. The property is small, but very convenient. The swimming pool is nice and inviting, and all the food we ate there was pretty good too. Just a two minute drive to the quiet Betalbatim beach. The Ayurvedic treatments and the spa were very nice and the staff is well trained. Definitely a value for money place if south Goa is your preference.\n": "Positive",
                    "\nVery Nice resort. I like very much, we were there from 16-sept to 18-sept. We were enjoyed so much. Resort was calm & peaceful.Its a really good resort to spend some good time in GOA.In shorter its a value for money. Nearby beach is Colva beach which is far superior and less crowded than North Goa Beaches.Staff is good. Food are nice but too costly. Pool were neat & cleanThe hotel has a series of building on a well manicured property. its less crowded. It's away from the main colva beach and the closest beach front of walkble distance; regardless the pool and layout make for a relaxed feel\n": "Positive",
                    "\nVery good hotel. Big and clean rooms, good breakfast. Friendly crowd is always ready to help. Betalbatim beach is situated not far from this hotel, about 7-10 min walking. The beach is one of the best in south Goa, because it is equipped with sunbeds, umbrellas, showers and toilets. You can have a good dinner in beach shacks. Sushant is very funny.\n": "Positive",
                    "\nVillage inn, a sterling resort located on betalbatim salcete goa has got location very near to madgaon railway station. It's located in a village hence got its name. Resort has got a not so bad look. Front office staff is okay but not very helpful. Rooms are well maintained, bathrooms too and room service is worth mentioning. Holiday activities were good, but sight seeing trips got a problem since they arrange only taxi cabs and its our responsibility to deal with those people. They won't even talk with them, and land us in a place to discuss with those unknowns. Even at night they are of the attitude that taxis have to be arranged by us only. No pick up and drop facility available. Restaurant is good, food also but delay on supply make it very bad from their part.Got a nice swimming pool but its not attached to any beach.Altogether a lot to improve especially in making convenience to members and those who opt this facility cos we are coming from far off places.\n": "Neutral",
                    "\nVillagio Inn is standard, well-maintained 3* category property. The resort staff is courteous and helpful. The food quality is reasonable, but food pricing is somewhat expensive. The resort is located in a quiet, serene area within 10-12 minutes walking distance to a wonderful beach. The rooms are average.\n": "Neutral",
                    "\nVillagio inn is a picturesque resort with nice rooms spaciously laid out. Room has a wide balcony where one can sit and relax with drinks. The dining area is lovely with comfortable indoor and outdoor seating. The food in the restaurant was one of the best we tasted in the recent past. It is very pleasant to walk around the neighbourhood. Overall the stay was memorable. The staff are very friendly and highly responsive to customers.\n": "Positive",
                    "\nWas in Villagion - Betalbetim, Goa. Excellent calm and quiet place. ALthought little away from Beach. Very helpful and smiling staff. Reasonably good food quality. Well appointed Rooms were large and cozy. A word of caution if you have problems climbing up 3 floors , ask them to book room on 1st floor. No elevators here !\n": "Positive",
                    "\nWe are members at sterling and have been to most of their resorts. Like most the ambience here was also good, but Villagio in south goa was the first place with bad service. Their travel desk was not willing to help us arrange for vehicles for local travel or crack a deal. They were not even able to tell us what all places we could visit. They were the first resort who were charging us extra charges+tax for room service. Apart from this they claim to have card payment option which hardly works and send you to 2 supposed atm nearby which rarely works. Overall apart from decent comfortable rooms this place was a disappointment. I am not even sure if there was a manager at this place. Disappointed!\n": "Neutral",
                    "\nWe are members of Sterling Holiday resort. We were well received. Particular mention about Mr.Bhim Singh and his Food & Beverage Dept which took personal care of me and my family. The resort is ideally located in south goa and walking distance to the betalbatim beach. Our visit was between 19th and 23rd December 2015\n": "Neutral",
                    "\nWe are not happy from resort service. Because when we arrive at resort no warm welcome by staff no welcome drink no respect from front office staff. We get our room after 10 min . The room is very good . But the service is not good. Food is average. When we checkout that time very roude behivoir by Miss Shaswati and Resort Manegar Miss Irena . We setting in the corner and Miss Shaswati and Miss Irena are laughing and talk each other but not help us . miss Irena say to us that what ever you want to do you can . but i cant help you . We are waiting 1.5 hour for getting taxi. They cannot give proper ans to us so we have call police . After comming of police they solve our issue. So we are thankful to Goa Police . we never stay in Villagio. After Villagio we stay at club Estidia and in club Estidia we have a good expiriance . The Estidia resorts staff are very cooperative.\n": "Negative",
                    "\nWe booked a stay in this hotel recently and when we reached hotel , Management behaved very rude and denied entry instead of showing them our confirmed bookings vouchers. Location is a bit far in South Goa . Hotel looks decent but poorly managed. My advise is to stay away from this hotel.\n": "Negative",
                    "\nWe booked this hotel by viewing feedbacks in trip advisor. But it was terribally went wrong from day one of stay. Firstly hotel is located in betalbatim which is at least 25 km away from most of the sight seeing spots and happening places in goa. If I had to summarise our stay there then it's like saying in so called 5 star facility of sterling in the village of goa. Location of the hotel was so poor that there is no good food facility in near by so naturally u have to depend on hotel food unless u plan to visit north goa every day.(so why not stay in north only). Hotel did not provide facility for driver for accommodation. Even they don't allow him to access washrooms. They expect us to buy him room round. Which is really pathetic.We opted for three course buffet menus as ala catere food seems to be in US dollar currency converted Indian rupees. We had food for 3 days but everyday menus was almost same. Even breakfast menus was not so great.Room cleanliness was there but no buckets in bathrooms. So they expect everyone to take showers. Window panes were reflecting from outside with non visibility. Curtains had two rods but only one curtain.So in short we recommend to stay away from this hotel unless u want to experience calm stay and not much goody persons.\n": "Negative",
                    "\nWe checked in on 1st Aug for 3 nights and we made a booking for two rooms,Dont expect anything fancy here,Average Resort.Clean facade area,Spacious Rooms.Friendly staff.But Front Office staff needs lots of improvement.They dont know the procedure of checking a guest in.Great Spa!!! One must try it highly recommended!!!Thank you Holiday team (Balram & Peter for the decoration and Cake in our room on My Hubby's Birthday)Offcourse it was on chargeable basis but awsome presentation.The girl at the Front Desk Neelu ,i think she gets confused easily.She made us checked in in wrong room.Later it was changed as per our prefrence.Food is good and F & B Staff is really awsome.Very Humble!!!No basic stuff is available in room like Slippers,Bathrobes ,bathroom amenties etc.At the time of Checkout again The girl got confused which bill needs to be presented,I corrected her as Iam from the Hotel background so i was aware about the procedure.Today only(06/08/15) I again recieved a call from the same girl saying Mam!! Amount of 800 Rs is pending rediculous!!!!! What kind of hospitality and proffesionalism they carry ,they dont know how to prepare bills even..Cant Say I will visit the property again...\n": "Neutral",
                    "\nWe enjoyed a week at Villagio and would recommend this hotel to anyone wanting a peaceful holiday. The staff are all very friendly and provided a great service. Nothing was too much trouble. They even organised a surprise birthday cake for my husband's birthday which was lovely.We were given an excellent room on the 3rd floor overlooking the pool and restaurant area. The rooms are large, clean and serviced daily providing complimentary bottles of water.Breakfast had a good selection of both Indian and continental options and there was something for all tastes. The sunbeds at the pool were very comfortable and towels were provided. All in all a very nice hotel with excellent staff who couldn't do enough for you.\n": "Positive",
                    "\nWe had a great 3 day stay. the resort is tucked away in a quiet place, about 5-6km from the murgao bus station. Has a pool and a restaurant. The staff are friendly and courteous but are slow. Housekeeping can be improved. The resort is close to the beach (10 minutes). The beach has good shacks and some water sports too. 20mts walk on the beach to reach Colva and you can see the water sports activity.\n": "Positive",
                    "\nWe had a great holiday in the area where this Hotel is situated. Tucked away in a quiet country lane, ten minutes walk to the beautiful uncrowded beach with enough beach shacks to eat and drink at without being overrun with them. Seawaves Beach Shack is excellent with great food and service.Just down the road from the Villiago Hotel is a small restaurant called Alberts. We found the food to be very good with a great choice although due to its commanding position being the only restaurant very close to the hotel slightly more expensive but in actual fact nowhere seemed too pricey in Goa especially compared to UK prices. The Hotel has good rooms, we had a very large room with a balcony overlooking the gardens but some people had smaller rooms, they all seem to vary. We had a meal in the hotel on our first night but when we wanted a quiet drink at the bar at 10.30 p.m. we were told it was closed. Irene the Manager is making sweeping changes to the structure of this hotel and therunning of it, in her words \"the staff need a lot more training\" although we found most of them polite and courteous, but the trainee chef in the mornings could not cook the eggs properly or seem to understand that english people que and some but not all Russians shout their instructions at the chef and do not bother to que and then wonder why people get annoyed. There are no chairs for the large balconies but this is being addressed and Irene said new chairs will be delivered in February. We put our lounge chairs on the balcony but some rooms only have settees so it is not possible to do this. All in all a good hotel and Irene cannot do enough to make your stay as pleasant as possible and as I say the restaurant staff are changing the way things are going to be run and the bar was being repainted when we left on Thursday evening 8th December.You can take a twenty minute walk or slightly longer to the main centre of the villiage where you will find the Pentagon restaurant which by all accounts is very good but we did not go in that direction but we know people that did and gave good feedback. Also Martins Corner is in that direction - if you don't feel like walking you can take a taxi from the hotel for 200 rupees. (80 rupees roughly to the pound).You can walk to Majorda which is a right turn when you reach the beach or take a left to Colva about 35minutes either way walking along the beach. Colva is busy and so too is the beach but you can find a quiet spot if you want to as the beach is vast.I hope this is useful and have a great holiday.\n": "Positive",
                    "\nWe had a tough time at this hotel, which is poorly located, has small rooms, no TV in bed room, limited amenities like no toiletries other than soap and shampoo. Towels are worn out. Services are atrocious, you need to keep calling reception for same thing and if you are lucky the single line phone may not be engaged. The hotel never could make the room safe functional despite repeated reminders. Room lighting is dim and many lights do not function. Fixtures are broken. The stairways are littered with garbage bags collected from rooms. Room cleaning is a sham and moreover they left the room unlocked after cleaning. Food is very average and the variety is extremely limited. Swimming pool is okay.\n": "Negative",
                    "\nWe had been to this hotel, whose management has now been taken over by the sterling holiday group. We were there during the Diwali Holidays and what to say.. marvelous property, very good and comfortable rooms.. clean and good bathrooms, with running hot water. The staff were courteous an friendly, but were very slow. The swimming pool was absolutely clean. the property was very clean, nice and charming. The betalbatim beach is ten minute walk from the hotel. The perfect clean and good beach. But missing in actions were water sports and shacks.The hotel food was ok, but per head cost were very very high. Also the negative point was that there is no nearby by restaurant. Rest all was fun and had a wonderful time at this hotel. Would definitely recommend one to go there and stay.\n": "Positive",
                    "\nWe had booked deluxe rooms looking at online pictures...but the room was pathetic. It is nothing like shown in pictures. Please read the following feedback before booking this hotel:1. the side tables & other furniture is very sharp & coming out from sides. Basically rooms are very old & not maintained. Our kid got a very bad scratch because of all this.2. The pool is good but the stairs to enter the pool are very bad ..... made of metal that will give you bruises on your foot. We also got hurt every time we tried to hold it.3. In the morning there was no hot water though we called the reception, nothing was done about it.4. The hand shower had all the coating coming out and if you are not careful you can have a bad scratch on your hand due to the sharp coating. 5. Food is just okay. But the staff is very rude. We have stayed in hotels that are at par with sterling where people help you with buffet breakfast. but here the staff flatly refuses to even guide you and asks you to manage yourself which was getting difficult with our small kid.6. Also the safe locker doesn't work.7. No amenities for the kind of money they charge. You can get better hotels in this area for that amount.This is some basic feedback with which you will get an idea of what to expect. Dont go by the name 'Sterling'. Worst experience ...would give negative rating .\n": "Negative",
                    "\nWe had stayed at goa villagio sterling resort from 17th May2014 to 21th May 2014. when we entered into the resort we were asked to sit in the lobby sofa in front of reception there is one glass teepoy. the tepoy is made from one olden vessel covered with glass round plate which is unfit and dangerous to children. since my son 5 years old had placed his hand in the edge of the glass suddenly it was fell down broken to pieces and also he gots blood injuries in his face hand ears etc. for emergency there was no any doctor in the resort and also nearby. we had very much shocked and picked up a taxi and rushed to colva for a doctor. As I got bad experience in this way they have forcefully charged Rs.3000/- for their imported(but it is local made worth around 1000/- to 1500/-) glass by keeping the glass teepoy in a dangerous manner. Also they are charging so many taxes(I don't know whether really paying the taxes to the govt or not) for food in their restaurant and room service. For example if you order for a one litre water bottle in room service it will be around Rs.72/- whereas in their restaurent it was Rs.33/- And the house keeping was very poor in service. also it is far from S.goa and N. goa. Every time we have to use only taxi service which is expensive from their resort and charging monopoly(since no other option To sum up my review this resort is totally unfit for family staySaravanan\n": "Negative",
                    "\nWe have been Sterling members since mid 90s...and experienced real bad days.Reluctantly booked Villagio for 2 nights....and what a surprise!!Beautiful property and what a change or turn over in Sterling hospitality!!Staff was courteous but it was amazing to see how well the house-keeping staff worked. had a little problem with fungus (was pouring cats n dogs) but the housekeeping did an excellent job.Nice pool and garden all around.Breakfast was ok...but at meals preferred the A la carte and Goan food.F&B needs improvement....the manager himself could wear a smile!Congratulations to the GM to maintain this standard of /in Sterling. Noticed that most employees were local....but they worked very well! For the sterling properties, I have seen ..this is 5 star!! though not on equal footing when it comes to hotel grading.Congratulations Sterling to AT LAST....to.reach this bench mark!\n": "Positive",
                    "\nWe have been at Sterling Villagio Inn for 3 nights and 4 days in Jan 2012. Our experience with Sterling resort was totally a let down (Lonavala property) and hence we didnt had much expectations from this property. We chose this for our stay only coz we happened to be Sterling members. But then the property was really amazing and we enjoyed our stay very much. This is a 300 rupees drive from Madgaon railway station and 600 rupees drive to airport. There are no sign boards and hence we had to let our cab driver speak with the hotel reception. But then you can look for Nanu Resorts board and follow it. Villagio Inn comes just before Nanu Resorts. The rooms and very spacious and well kept. The staffs also are very helpful and friendly. They will arrange bikes for us if we want to roam around at a charge of 300 for a full day. (we can return it by 9pm). They have an excellent swimming pool which we can make use of. Food was also good though it was slightly costly, but then with so much shacks around food was never a problem. The nearest beach is Betlabatim beach which is at a walkable distance. The beach was not at all crowded and has a very decent crowd. It is ideal for family and those who wants to spend some nice quiet time. Other places near by are Colva beach, Margaon town, Spice plantation and so on.North goa is around 60 kms from the hotel. Cabs are readily available and they will charge you 2500rs for a day. Overall the experience was quiet nice and we really had wonderful time!\n": "Positive",
                    "\nWe have come in now home.From goa ....I want to share my fun in villagio of goa. I am go there with my friend and you are enjoy lost there night music dance ..and u r enjoy swimming aslo thanx to villago for the moment\n": "Positive",
                    "\nWe have just returned home from Goa Villagio, Betalbatim. The resort is very well maintained. The staff are excellent, extremely warm and caring. We were impressed with the staff both at the reception counter and in the dining room. The warmth that is so typical of all Sterling Holiday Resorts is something that we have never experienced elsewhere. The rooms are good, amenities are great, the ambience is also good and the food is a delight. We did not eat too often in the resort restaurant as we were told not to miss the food at Martin's Corner and we truly had a treat each time we visited Martin's Corner. However, it would be unfair not to appreciate the a la carte dishes we had at Villagio, particularly the Grilled Chicken with steamed vegetables and french fries and the Grilled King fish with steamed vegetables as well as the American Breakfast. The service by the boys Godfrey, Remedias, Santosh and Francis made meal time all the more enjoyable with the Executive Chef, Binish also keeping us company off and on. The care taken by the girls at the reception counter only added to the memorable stay we've had. In particular, mention must be made of Saswati, Neelu and Aslina who did all they could to ensure our comfort. All in all, it was a memorable stay and we look forward to many more memorable times with Sterling Holidays. Lalita and Julius Carvalho, Mumbai\n": "Positive",
                    "\nWe made a online booking for 3 rooms to stay in this hotel through Makemytrip. The only reason we chose this hotel was because of the 4 star rating they flaunted in their promotions. But the service that we received was poor and that of 1 star hotel. It was our first visit to Goa, and all our excitement was diminished by them due to the utterly bad service they gave. In a country like India, where we have taglines like \"Athithi Devo BHAVA\" , this type of service will only spoil the name of the Indian hospitality. We were not even attended properly and had to wait for 2 hrs to get our rooms. During this time, we weren't even offered water. Even after waiting for 2hrs, we 3 couples were given 3rooms in different blocks in spite of assuring us earlier that we will be given rooms adjacent to each other. While booking, it was shown that Wi-Fi facility is free. On our request of Wi-fi facility, they denied completely about the free service and told us that it is a paid service. This is a cheating done on their behalf for promoting themselves in Makemytrip. Our luggage was not attended by them and we had to carry it our self without the facility of lift. The rooms were not so clean and on demanding AC remote from the help desk, we were again made to wait till ages. In short, we can say that it is just a3 star hotel flaunting the name of 4 star. Disappointed and totally unhappy stay.\n": "Negative",
                    "\nWe recently stayed at Villagio for a family vacation for 5 Nights. This property is about 10minutes walk from Betalbatim beach which is a nice less crowded beach close to Colva beach in South Goa. The welcome and the registration was easy and the receptionist was very helpful. The Property entrance could be made little bit much nicer though .We stayed in thier studio apartment rooms which has a spacious Bedroom and a living room and a balcony. The upholstry was kind of rundown due to poor maintenance. The Housekeeping staff was very slow and had to be reminded several times for refilling water, towels, toilet rolls etc.The Hotel Restaurant was just OK and gets cramped if we had more than 10 families dining at same time. The food menu was unimpressive and the taste just average compared to other Sterling properties. The service was too slow and we had to request several times to refill the buffet counter dishes.The pool was maintained well and they had a good recreation room for the kids. The Hotel organized various events which keeps the family engaged during the dinner times.It would be nicer if the facilties could provide bicycles for rent for getting small general items and pharmacies as this property is far away from general stores.I was also disturbed at 3 AM in the Night saying that some sound is coming from our apartment floor but then they told us sorry and left. They should have made sure about the source of sound before disturbing the guests.\n": "Neutral",
                    "\nWe spent six nights recently with two couple friends (Two studio apartments, pool facing. One first floor rear facing) had a great experience and would highly recommend the property. A must do place.Here's my two bit from our experience:Rooms:Pool facing rooms on the ground floor truly a treat (404/403). Great view, no balcony but hardly a deal breaker unless you are a smoker. Adequately large rooms (did yoga in-room daily), Beds were very soft ask housekeeping to firm them up a bit. Better mattresses would go a long way in completing the positive experience. Pillows were, average to good. Air conditioner, worked just great as did the mini fridge.Bathrooms were well appointed and large. Had all the essentials in place and functional. For some weird reason there was actually no partition between the shower area and rest of the bathroom, just a level difference of 10mm. No shower curtains!! And No, no tub either. You land up wetting half the bathroom, including the pot, but hey, you have housekeeping.Only concern (at least when we were there, 2nd to 3rd week of April) were the mosquitoes. We had housekeeping keep them at bay by spraying bug spray twice daily. Also request the executioner, Mr Santosh to zap them to oblivion.Food:There is one multi cuisine restaurant and an outdoor al fresco type sitting arrangement with a bar on the far end. Daily buffet is also available. Morning egg station is a hit (after I showed them how to make Spanish omelettes). Vegetarian and non-vegetarian dishes in reasonable numbers, good for a four day stay. In general food is strictly average, but the service and willingness to provide makes up big time. Per portion pricing is on the higher side, but portion sizes are generous.Recreation:Tiny kiddie and an average sized adult swimming pool lined with recliners on one side, great place to catch up on a book.Recreation room (Board games, odd kids’ toys, carrom, table tennis, PC games, Wii and a pool table) a bit cramped but will keep kids occupied for a couple of hours.Location:If you enjoy the beach, this is the place. Ten minutes walking distance to the Betalbatim beach. The beach itself is clean and not commercialized as the popular ones. You get a lot of space to do your thing. Recliners, shacks and life guard, all in place for a great sunset or sunrise dip.Down side:They need to throw in free WiFi. Internet cost is a rip-off! Distance from most happening night life places. Make no mistake, without a car/cab your mobility is severely restricted. Cabs are expensive so factor in INR 1600/- a day to hire one for 8hours / 80 Kms. Must do things:Thallasa at Vagator for sunset and Greek food with lots of Sangrias. Fisherman's Wharf, Cavelossim, for on the river experience.Check out the vaious flea markets.\n": "Positive",
                    "\nWe stayed at Sterling Villagio inn for three days and two nights in March 2012. First of all the location is very good, a mere 10 minute walk from the Betalbatim beach. The hotel and rooms are very nice, have a great ambience and very well maintained. The swimming pool is also good. The staff was courteous and helpful.We enjoyed the food too especially the breakfast buffet which offered a lot of variety. The colva beach is nearby, where you can participate in a variety of water sports.Overall we had a very good experience at the Villagio Inn and would definitely go back with my family next time.\n": "Positive",
                    "\nWe stayed at Villagio Goa in July 2014. It is a basic clean hotel with friendly staff. The restaurant is terrible, don't try it. Also the reviews will scare you about the bike / car rental scene. The cars / bike rental guys right outside the hotel are useless and will rip you apart. Just walk 2 mins into the main road & rent it from there.Overall would suggest to stay here if you get a good deal.\n": "Positive",
                    "\nWe stayed at club Villagio just few days ago.very nice property away from normal hustle bustle of the city. The best part is that Bettalium beach is just walking distance from here.this beach is AWSOME as it's quiet and very very clean compared to other beaches in Goa.The food was extremely good and dinner is served in open with live music.The singer was also very good\n": "Positive",
                    "\nWe stayed at the Villagio Inn, during August 2012, booked using Sterling Holidays. I have to compliment Sterling Holidays for their excellent service. The resort was better than I expected and special mention to all the staff who made our stay into a memorable vacation. Villagio Inn gave us an upgraded room and that was a wonderful gesture. The rooms are clean, well maintained. Kids had a nice time at the recreation room (albeit it was a bit small). The swimming pool was quite deep even at the shallow side and the resort did not provide any 'floaters' etc.There are no lifeguards on duty. A couple of rubber floaters could have really made the difference to those who want to enjoy the pool, but, don't know how to swim. Food choices are limited, but, we did enjoy the package deal (B/F + dinner). Restaurant options are limited near the resort unless you have a car / bike to commute. The biggest disadvantage of the location is commuting and the presence of the taxi \"mafia\" near the hotel. They fleece you like hell and you cannot hire any other taxi from anywhere else in town because these guys create problems. I found my solution thru' one of the reviews written on Tripadvisor, wherein a telephone contact of one Mr. Joseph is mentioned. His shop (Kims Collections) is located 5 mins from the resort, at the Betalbatim market. He is a very heplful person and rents cars/bikes to tourists. Thanks to Mr. Joseph, we hired 2 cars are self drove around Goa. It was fascinating and he was very helpful in providing us with directions and assistance at every stage. Betalbatim beach is very clean and not too crowded and it is just a 10 min walk from the hotel. To sum it up, we had a very enjoyable stay and spent quality family time at the Villagio.\n": "Positive",
                    "\nWe stayed at this property for two days. The property itself is clean and maintained well. But is overpriced with bad service. Its priced at 3 to 4 star levels but quality of the service is poor. We used the restaurant for breakfast both the days and it was disappointing. Both the food and the service. Paid wifi did not work. On the positive side, they have a nice pool and a recreational area, which is nice. The Majorda beach resort is a kilometer away and is the nearest beach in the area. If you are looking for a stay near the majored beach resort, keep this as your last option\n": "Negative",
                    "\nWe stayed at villagio for a family vacation for 3 nights.It is a nice and well maintained property at a walking distance from beach betalbatim.Doorman sushant is courteous always smiling and very helpful. Front desk experience was average they took very long time to make us check in.This area needs a lot of improvement so that the guests should not feel ignored by the front desk staff.Rooms are spacious very well maintained,house keeping is good but a little bit slow.The pool area is excellent pool water is very clean and clear.Recreation room is also very nice.Activities during dinner are perfect.overall it was a nice experience.\n": "Positive",
                    "\nWe stayed between 4th December to 19th December 2011. Very nice hotel, friendly staff, a really good 5 star hotel. We are not new to the Betalbatim area but new to this hotel and it lived up to our expectations, breakfast is buffet style and probably amongst the best we have experienced,but if you do not like salt in your omelette or fried eggs you must tell the chef otherwise they put a lot of salt in and it is inedible, we cannot comment on other meals because we booked bed and breakfast only, but were told by other guests that the evening meals were overpriced, we just used our usual local eating places, Albert's, ( great staff, Cherry,Suchant and Sarjeen) Dunstons in the village & Greenlands on Majorda Beach(English owners Roger & Clare who were very helpful with advice etc,) to name a few.Anyone new to the area would enjoy this hotel as a first taste of Betalbatim. We experienced only two downsides, firstly we had to depart our room on the last day at 10am although our flight was not leaving until 1.30am the following day but they did let us use the swimming pool shower!! ( sic) ( we have stayed at the Alagoa before and they always managed to accomodate us,in fact Nitin the manager from the Alagoa came round to see us and say farewell on our last evening and was very surprised that another room could not be found for our use and kindly offered us a room at The Alagoa foc, but by then it was too late, Which goes to prove that the Alagoa, as a small establishment, know how to treat their guests properly) secondly we were not allowed guests in our room even for only a short visit,Carole's sister and brother in law came down to see us from Calangute and we had to entertain them in the hotel reception area. During our beach days we stayed at Seawaves beach shack, Hi to John ,Netty and Simon, they will make you very welcome with always a friendly smile.If you are looking for a great taxi driver and guide look up Bonny Fenandes, who used to be the driver at Alagoa, next season he will have his own Taxi and will be looking for business, a really personable and friendly knowledgeable young guy. Betalbatim area is a lot quieter than North Goa and seems to be predominantly frequented by middle aged Brits who do not like hassle,hustle and bustle.Quick hello to Jose and Alan to let you know we have found a wonderful apartment to rent next year for 5 months, hope to see you at Seawaves next Year\n": "Positive",
                    "\nWe stayed for 4 nights.Its so well located away from the madness of north Goa. Beach is a 10 minute walk. As we travelled in the off season, not many people on the beach. Nice clean, long stretch of a beach.Rooms:We stayed by the pool facing deluxe room.Lovely room, large, airy and spacious (414) with balcony on 2 sides.The housekeeping did a good job but did have to be reminded of special requests a few times before they would abide.Restaurant:Good, consistent food.Although the buffet was monotonous and needed a little creativity in planning.Attentive staff (especially Ajay)The staff does need some training in helping them go the extra bit in guest satisfaction. But friendly staff.Tips:The taxis are a menace. Walk up to the town centre which is in the opposite direction of the beach and look for Kim's Collection.(closed on Sundays) Speak with Joseph Cota. Has good cars for rent with or without drivers. For those looking for help with planning the Goa trip, is a good resource.\n": "Positive",
                    "\nWe stayed here for the second time and will certainly go back. The rooms are very spacious and cleaned thoroughly everyday. The resort hass a beautiful swimming pool. The games room is very well equipped. The staff is very friendly and helpful. Betalbatim beach is a kilometre away and Colva beach is very close. The restaurant severs both Indian and continental cuisine. The peace and tranquility makes this a beautiful resort\n": "Positive",
                    "\nWe stayed here in march 2013, the place was clean and staff were very friendly and attentive. The breakfast buffet was just passable but the restaurant was poor. Visit Colva for some good munch.We would recommend it to people who want to shun the hustle and bustle of the north and do not mind taking some sort of transport to visit anything. Avoid if you can the cabs outside the hotel, we befriended a tut tut driver in Colva who was only a phone call away.\n": "Positive",
                    "\nWe stayed in the month of October,climate was awesome then.The poolside room where we stayed are nice and cosy.Special mentioning about the F.O Staff,they were abosolutely perfect for the hotel, as they were always smilinmg and ready to help at any time our stay.No problem at all.\n": "Positive",
                    "\nWe visited here fir 3 nights as i had a conference to attend. The resort is nice, surrounded by greenery and betalbatim beach at just 10 mins walking distance. But the wifi isn't free and they don't include breakfast. They are little short staffed. Our room was spacious and came with a huge bathroom with a bath tub. Overall a comfortable stay.\n": "Neutral",
                    "\nWe visited this property during mid April where in it was very very hot - actually it was wrong time ti visit Goa. This property was booked under membership program - we had a very smooth checkin, rooms were good, activities were ok, for kids average options, people serving very very good and friendly but the food quality n taste was not upto the mark like it should have been for sterling.. An average stay\n": "Neutral",
                    "\nWe went to spend holidays at Goa Villagio from 10 April to 13 April 2013. We reached Goa at 5 AM at Madgaon Railway Station. From there we booked a Pre-Paid Taxi to Sterling Goa Villagio Hotel. They charged us Rs 450. We reached hotel within 30 mins and our Check - in was quite smooth. Other than utility charges we have to pay heavy Rs 600 as luxury tax. Our room was at 3rd floor. There are no lifts in the hotel so better you take lower floor rooms otherwise have to walk up the floor.After rest we went for a walk to see around. There is nice beach called Betalbatim very near with 10 mins walking distance. Beach was clean and less crowded as well. Being on west side you can see the sunset there. Then we came back to our hotel and enquired about Sight Seeing. Travel Desk staff told that because of the Taxi Union you yourself have to talk to them for pay and all. These people are standing with their taxis right infront of the hotel. You can either go for taxi or you can go for rent a scooter. There are 2 trips like North Goa and South Goa. For North Goa visit amount is Rs 2300 with 4-5 places of visit and for South Goa you have to shell out Rs 2100. Both trips include 2-3 Beach visits as well so it was just go and see. No time to enjoy equally in all the beached. Fort Aguada , Dona Paula, St Francis Church and Dolphin Trip was great. There are 2-3 temples also. If you are going in April around don't forget to take sunscreen lotion and temperature reached 35-36 degrees at Noon.Coming to Sterling Villagio - Its a small hotel with different towers containing 4 rooms at each floor. Food Masti Package was worth and usually buffet was provided near to swimming pool. IPL Matches were also projected on wall during these days and this time they offered 20% discount as Happy Hour at Bar. Overall it was good and relaxing vacation with supportive staff.During checkouts no one asked about our feedback/recommendations of our stay as asked usually by all Sterling Hotels. Rest was all good\n": "Positive",
                    "\nWe were a reunion-group of 15 people, in 10 rooms, all adults. We did have some \"special requirements\" - we could spare one of the rooms booked by us for Group Get-togethers ) music, reminiscing, chatting over drinks; but we wanted that room cleared of beds and, with lots of chairs put in! The staff were MOST helpful! About this, and every little request we made!Our rooms were extremely comfortable and well equipped, and extremely well serviced. Every room comes with a verandah / sit-out, which is very nice too!Food at the resort was excellent.There is a pretty wide range in the breakfast buffet, to suit all tastes. We had our lunches outside, but dinners at the resort were excellent. The chef was happy to discuss menus in advance with us, and served delightful local cuisine at our request. All in all, while the resort itself is well located, and very well-appointed and maintained, the staff made the whole experience even more idyllic - they were extremely courteous, always willing to help, gave us good suggestions, and everyone always had a smile!\n": "Positive",
                    "\nWe were delighted with the rooms and the location. Pool is clean and safe and there's anough things to keep childen engaged. This is a place for those who love a relaxed holiday since this is far awar from the happening Northern part. The long strolls in the village is claming and folks are friendly. Theres a beach within a kilometer though this is not on the beach. The staff were helpful even though busy .Food took its own sweet time to find its way on to the table. However you can walk down to some delightful eateris next door .\n": "Positive",
                    "\nWe were given Studio rooms which was bigger than expectations has balcony and bath tubs. Our room was diagonally opposite to Reception. The beds and linens were nicely done. Gives you a business executive feeling unless you enter other corners of the resort. Pool is nice and well maintained. Food is an issue but I don't blame the team and chef as they are trained to make continental food. I am a north indian foody person. Not fond of any international cuisines. Sea food is a good option. However, please check prices before you order something different and get shocks or Cardio attacks while check out / paying bills. A glass of bournvita may cost you anywhere between 125 to 150 exclusive of taxes.Better to eat outside.Also I would recommend you to travel to Goa with your own vehicle. If that is not possible hire vehicle from people who are near the resort. Two wheelers would like Activa would cost you approx. INR 350 per day and additionally you need to fill fuel.Avenger or RE's will cost you approx. INR 450 or 500+ per day. They shall retain your original ID and give you vehicles on rent. Also try and not breakdown or make dents on the vehicle, as for Tourists like us Goa can become a nightmare.While returning to the resort late night we were caught by cops who checked our DLs but did not fine us for drink and drive. I would suggest not to try this as these days the regulatory bodies have become very strict. Please DO NOT DRINK and DRIVE.Villagio Inn did not have any activities or fun zones programs conducted by the resort. I have been to places where ideally DJ, Ghazal nights by the pool or Dinner is arranged by the resort, but here nothing of that sort. Did not observe any games too arranged for families.Complimentary options are Carom, Chess and Table Tennis. Pool is chargeable per board.In room dining and service available. Your in room fridge would be full of chocolates and Beers which is nice concept, but chargeable basis.Irene the resort manager and her staff was really helpful.However, trust me Sterling Holidays has better resorts at locations like Munnar, Kodai and Manali which have far better and appealing resorts and standards.Regards,Vinay\n": "Positive",
                    "\nWe were pleasantly surprised at the quiet surroundings of the resort very far from the maddening crowd. The room size is large and we stayed in road facing room. The entire staff was very courteous and we liked the food. The resort is well maintained and the beach is about 1 km from the resort and it is very clean not crowded. All in all a very pleasant stay and must be recommended for a visit.\n": "Positive",
                    "\nWe were received warmly by Ms Sulakshna from the front office and were quickly checked in and guided to comfortable rooms next to the pool. The rooms were large enough and comfy and clean and nice,and quiet too. Very near to Betalbatim beach- around 5 to 8 minutes walk on a lazy stretch.Need to mention specially about the F & B Consultant of Sterling Holidays, ever smiling and helpfull and informative ,Mr Bhim Singh who made eating in their restaurant a pleasure day after day. It was fun interacting with him.The buffet spread was decent enough and tasty. The Staff in the resort were courteous and quick in their service .All in all enjoyed a very warm and pleasant stay. Will return again.\n": "Positive",
                    "\nWe were there on 16th June 2012 to 21st June 2012. Location of the resort is very good and is about 25 mins from Madgaon Railway Station, we came by a cab and the cab charged us Rs.450/= to drop us there (I bargained with them they were asking for 500). We were 4 Adults and 2 Kids . The Betalbatim Beach is just 10 mins walking distance it is a nice clean and scarsely populated beach (Just what we wanted). The Resort is just recently developed so the rooms are brand new and very spacious, equipped with A/c and Tea & Coffe Maker, also they had provided a Digital locker in the wardrobe and many other small small things which might be useful during our stay. Room service was a bit slow but that was ok we were never in a hurry. Overall, it is a beautiful property and the swimming pool was clean and most enjoyable and they have Holiday activity room also where in you could play carrom, chess, Table Tennis & many other games so the kids can have a great time. Staff is very co-operative and helpful and the North Indian veg food in the restaurant \"Pebbles & Sand\" we had was awesome and very tasty. It was a rainy day when we arrived in Goa and it continuously rained heavily for 2 days but the other 2 days were sunny. We did not want the guided tour provided by the Cabbies at the resort so I checked with the resort people for a self driven car but they discouraged me as the cabbies union people would fight with them so they suggested me to check at the nearby market so then I went walking down to the nearest Betalbatim Market which was 10 mins away from the Resort and enquired about a self driven car on rent, I could manage to get Maruti Sx4 on hire for Rs. 1200 per day from Mr. Joseph Cota - 9850477357, it was a brand new car and we used it to roam around for 2 days. We went to North Goa and also moved around in the South Goa. Getting a self driven car in Goa is hassle free but you have to be equipped with GPS and road map in order to move around there other wise you can end up losing all your time in finding places. Since we had the car we could go to calangute beach, Baga Beach, Fort Aguada, Miramar Beach, Anjuna Beach, Dona Paula Beach, Colva Beach, Taj Exotica, Gandhi Market - Margao, Majorda Beach, Benaulim Beach. We went to the Taj Exotica, its a lovely property they have and they easily let you go in for a stroll, there are no restrictions you can also go to their private beach and move around, they have a kids area where in the kids can play in the park and also there are computer games which they can play (Everything is free with out being a room guest. You can move around as much as you want.) Overall, It was total fun and enjoyment in Sterling and in Goa.\n": "Positive",
                    "\nWe were to this property by the second week of February, as we were attending IBW 2016. We had a prior booking, and were riding our bikes all the way from Bangalore to Goa. The property had well furnished spacious rooms, a descent pool, play area and a pool side bar and restaurant. A perfect place to dive to a deep sleep after whole day ride.People who ride own vehicle, please note that they DO NOT have a PARKING AREA. You will have to leave your car/bike some where in-front of the property. As we were riding on exotic bikes, we inquired for a safe parking for our bikes, where it would be noticed by the security. Then this guy Mr Bhaskar, some manager of the property entered the scene ad started the show. He was that arrogant and rude to us, at some point we felt we were asking him for a free stay there. He took the show a long way and then some other staff came in and helped us to resolve our problem. This was the only experience that could be underrated.Except this, our stay was pleasant and had a great time there.\n": "Neutral",
                    "\nWe were two couples and had 3 night stay at the hotel.As a sterling member two room cost us 6000Rs for 3 nights which was very cheap.We were hardly in the hotel.Roaming out in the beaches(10mins walk),Casinos and Dudhsagar Waterfalls.I found the staff was very friendly.Swimming pool was very big and clean.In house dining was good and rooms were very clean.View from the rooms is okay except if get a pool view room.Had a great time in Villagio Inn and Goa\n": "Positive",
                    "\nWe`ve just returned from The Villagio, having spent 1 month there. This was a repeat visit as we stayed there in February 2012, when we thought that you really had value for money. The rooms are comfortable and kept very clean. Towels are changed daily and bed linen twice a week.Although we didn`t eat in the hotel of an evening as there are many restaurants in Majorda and Colva that serve excellent food at reasonable prices, we found the breakfast menu to be plentiful and sufficient.The staff in all departments were always very friendly and were only too pleased to help you. Reception, is manned 24hrs and you were always given a welcoming smile each time you passed through there, then you were greeted by Sashunt the security guard.The beach is only a 10 minute stroll away where there are numerous shacks to spend the day at.We had an enjoyable stay there and have already booked to return in 2014!!\n": "Positive",
                    "\nWell, let me brief you .. If u r nt hygine friendly n if u dnt expect good customer service then u must njoi this place.. U ll find ants in d juice which is cost of 140 rupees a glass .. N sandwich is 200 rupees.. U ll get toppings of hairs n ants on it.. No hygine ... They r nt even providing hot water... If u complain to the manager then she said that\" sir! This is INDIA nd u should expect this frmHere\" managers name is IRENE .. Very pathetic experience.. They will ruined ur holiday... Never ever go...also, to get the hot water u need to call d reception 6 times a day nd then staff is blaming on each other.. One should never go... Even they have activity room.. Bt nobody sits there.. Lollzz i can laugh on me itself.. How this is maintain\n": "Negative",
                    "\nWhere do I start...everything about this place is obnoxious to say the least. We were a group of 66 and are staying since 9th. A quick rundownWifi is notional dusconnects often essentially a pathetic hotspot. Most of the lockers dont work. Roomboys forget to lock rooms. Be safe with laundry it can get burnt and silently shoved into your cupboard. No irons in room. Like hell you need to ask for a milk water or tea replenishment. Lo behold your towel and linen wont be changed inspite of leaving on floor. If thats not enough you have to ask for eggs in a buffet breakfast. Rude waiters and room boys. Front office responds after 5 requests and the manager a gentleman named manish is always in a meeting. You may get an unresolved power cut. Dimly lit shabbily kept rooms with even the utility kit in toilet being replaced. They do not have slippers make sure you carry them after reading all this. We did warn them of this review hoping for an improvement..sad no change. Today have requested in writing for the basic dos in the front office ...more on that once I see whether they have acted on it. They are capable of incorrect billing and newspaper is inly given the first day. The muck cleared out if your room will remain on the staircase right outside your room. The furniture is a sham. The fruits on the table are complimentary and remain so for the three days of stay as they are not changed. The list is endless a humble advice stay clear of this resort be aware we were staying off season full rates.\n": "Negative",
                    "\nWith family I stayed 5 nights in the last week of March 2015. Excellent property far away from the huzzle buzzle, just about 10 minutes walk to the wonderful Betalbatim beach and 4km to another wonderful Colva beach. All these fine features were marred by poor service especially unfriendly front office staff. Having had the experience of staying in Sterling properties for over 10 years now, I can definitely say, the service and culture bears no semblance to the common resort service culture that you find normally in any Sterling properties...Misdirected guidance on car renting, very less help in tourist activies etc..\n": "Neutral",
                    "\nWorse resort and worst experience in my life.Being as a doctor we choose this resort with my doctors friends , first night my friends cash was stolen and the locker or safe was provided in the room that's was not totally safe.Someone had tried to open when we were not in the room.Room service and other services were extremely poor or I don't ve words to explain all these things.Reception and staff don't be any courtesy. You ve to fight for every thing for whom u already paid.Kindly it's my humble request to all please don't choose sterling resort as ur choice.\n": "Negative",
                    "\nWorst services you can find in any hotel... poor room service, rude staff... better find another hotel if you want to enjoy your trip.. this hotel spoil the name of sterling ............location is not good.. more better places are available\n": "Negative",
                    "\na good and calm resort in a peaceful environment. Visited the resort as a member. The resort was recently unpgraded and maintained neatly. Staff are co-operative. The taxi and bike facility are available for hire outside the hotel for a reasonable fare. The negative is cost of food which is abnormal and not worth of the amount spent.\n": "Positive",
                    "\nhotel is located near the betal beach 1/2 km,though the more famous colva beach is about 2-3 kms We stayed there as sterling member. hotel is in south Goa and is about 12 km from Margaon railway station and 22 km from Dabolim airport. this place is less crowdy than the more famous calangute and Panjim . Hotel' landscape and rooms are very nice though the front of resort is still under renovation. rooms are spacious , well mantained and neat & clean. Restuarant & food are good, less spicy and have more than an average variety. Sizzler though not in menu , the chef got the same ready for us. breakfast lavish and reasonably priced. Staff courteous , helpful and service good.overall ambience is good.\n": "Positive",
                    "\ni am a member of sterling resorts, my family of 4 adults stayed 2 nights during 1st week of jan 2015, The place is quite calm & peaceful with good surrondings .Rooms were spacious & well maintained and rooms facing pool are very nice , service is okay\n": "Positive",
                    "\ni stayed at goa villagio in month of may 2014. i found property mentioned well. need to improve food quality. option for buffet to members are reasonable but need to increase menu items and also quality of food which was average. need for external activities will also improve attractions.\n": "Neutral",
                    "\ni was wondering where to stay in goa with my family in this season....found this place on tripadvisor....was lil apprehensive initially but decided to try it out finally........i should say that this is the ultimate place in goa to stay with the serene environment and good hospitality.....food was average quality but was value for money....rooms are kept clean and room service is very good....i travel to goa twice a year since last 10 years and everytime i choose a new place to stay.....i should say that sterling resort has not disappointed me this time....i would recommend this place to each and everyone who wants to have a pleasant stay in goa with their family......hats off to sterling resort and their staff.....they made my trip memorable.........love you goa...................................\n": "Positive",
                    "\njust returned from 2 week stay at this hotelthe rooms are first class the staff are wonderfull jan and i would defineately return in fact hoping to in marchwe rate this hotel 9 out of tenit would have gat a ten but for some small issues regarding cateringdefineately worth a visit\n": "Positive",
                    "\none thing about this is it cannot be considered as a beach resort. it is a just a hotel near sea ( not beach).you have to have strong legs to climb to the room , come down climb to restaurant , it was quite diff task, having said this the redeeming factor was the staff who were always at your service. we should definitely mention the house keeping and the restaurant service.\n": "Neutral",
                    "\nstay was very good, restaurant a bit costly , service tax is horrible, service from the front room is excellent, room service good, rooms and bath rooms are well furnished, food tasty,average swimming pool.\n": "Neutral",
                    "\nstayed in this resort in the month of February very beauty full resort well maintained and super clean.Housekeeping works very hard do not remember the manager name but Ajay from housekeeping was very polite and attentive manager had instructed him after some problem with housekeeping and every thing was taken care very nicely.\n": "Positive",
                    "\nvery nice resort neat and clean initially we had some problem but ajay was very help full food is ok but if rates are little high and north Indian taste is missing overall very nice experience.... I'll never forget it\n": "Positive",
                    "\nvisited this resort in march 2015 for one Day only but I like this resort so much that I want to go there next time for one full week.it is very near to airport and for going to beach walking distance is there.good food good staff and very good atmosphere.\n": "Positive",
                    "\nwe celebrated our sons first birthday at this resort. A friend of ours introduced us to Sterling to purchase their membership when we saw the reviews we were reluctant to even approach we decided to ho and stay. We were simply amazed with the courteous staff from the doorman to the resort manager who made our stay memorable . Our sons birthday was celebrated with so much of anxiety every single employee knew it was our sons birthday a cake gift and a the ballon setup done for his first birthday even without any expectations is a memeory which we treasure and speak about. We bought sterling membership n we are glad we did please keep up to your services\n": "Positive",
                    "\nwe had stayed here in june this year. rooms are good,well maintained. as with all sterling resorts, this too is situated away from the main city. there is betalbetim beach just 10 min from the resort. then there is colva beach some 20 min away, where one can engage in water sports.basically its a nice place to relax. better if u hav your own vehicle. we dint try much of food in the hotel. do visit martin's corner,one of the best restaurent in south goa.\n": "Positive",
                    "\nwhen I think Sterling, I think of an above average, almost touching luxury stay. Ive experienced the same in Kerala, But i was dissapointed at Betalbatim. For the amount I paid, I felt the stay was below average. It was shocking that the resort provides no toiletries. There is one gel which you use for shower and hair. There are no moisturizers or shower caps. the room service did not even wash the mugs which we used for coffee. There were no hand towels provided, nor there were any foot mats. Foot mats are a must in goa because of the sand which all around, and sticks to your legs. The room was large enough though which was a plus.  The buffet was expensive with 1 non veg dish and 3 veg dishes. A highly disappointing trip according to the expectations i had.\n": "Neutral",
                    "\n“A beautiful beach within a Km, clean and neatly maintained swimming pool, good food and service”-this was what we expected when we booked our holiday with Sterling Villagio. We were glad that all our expectations were met when we arrived there. There is the clean and unadulterated beach at Betalbatim within a walkable distance of Sterling Villagio, where you can while away your time. You can also play in the swimming pool which is clean and well maintained. As far as food is concerned,you can enjoy your choice out of the menu spread out in buffet for dinner and breakfast.There was a fantastic Sitar Recital during dinned on the second day of our stay. The service at Villagio is quite good and quick too. If you want to go out for sight seeing, there are plenty of taxis available right outside, but you have to bargain otherwise the taxis will take you literally for a ride as far as fares are concerned. On the whole, our stay at Sterling Villagio was comfortable and we enjoyed our stay there.A couple of suggestions to Sterling: Activity Room is too small and cramped. Strering should do something about it so that all those using it can relax. Further, the billing process at the Restaurant and Reception needs to be speeded up.\n": "Positive"
                },
                "sentiment_segg": {
                    "beach": 0.8907849829351536,
                    "clean": 0.3856655290102389,
                    "food": 0.6313993174061433,
                    "goa": 0.7167235494880546,
                    "good": 1.0,
                    "hotel": 0.8088737201365188,
                    "nice": 0.3515358361774744,
                    "place": 0.3993174061433447,
                    "pool": 0.5255972696245734,
                    "property": 0.3037542662116041
                }
            },
            "zomato": {
                "Negative": 0,
                "Neutral": 0,
                "Positive": 0,
                "options_count": {},
                "sentiment_segg": {}
            }
        }
    }
}